{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/logfiles/PractictionersPaper_2020-04-17_00-13-32.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Apr 2020, 00:13:32
{txt}
{com}. 
. *** On ALSPAC data held at Erasmus
. use     "${c -(}dir{c )-}/Data_Set/Rietveld_12Sep18.dta", clear
{txt}
{com}. 
. 
. * Month of birth
. gen     MoB = ka498
{txt}(3,101 missing values generated)

{com}. recode  MoB (-9999=.)
{txt}(MoB: 6 changes made)

{com}. label   def MoB 1 "Jan" 2 "Feb" 3 "Mar" 4 "Apr" 5 "May" 6 "Jun" 7 "Jul" 8 "Aug" 9 "Sep" 10 "Oct" 11 "Nov" 12 "Dec"
{txt}
{com}. label   val MoB MoB
{txt}
{com}. label   var MoB "Month of birth"
{txt}
{com}. 
. 
. * Gender
. gen     male = kz021
{txt}
{com}. recode  male (2=0) (-9999 -1 = .)
{txt}(male: 7810 changes made)

{com}. label   var male "Male"
{txt}
{com}. 
. 
. * Entry assessment score
. recode  sat092b (-10 -6 -5 = .)
{txt}(sat092b: 8653 changes made)

{com}. sum     sat092b 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}sat092b {c |}{res}      3,746    25.92258    6.232598          0         39
{txt}
{com}. gen     ea = (sat092b - r(mean)) / r(sd)
{txt}(11,699 missing values generated)

{com}. label   var ea "Entry Assessment score"
{txt}
{com}. 
. 
. * Key stage 1 
. recode  sat190a (-10 -6 -5 = .)
{txt}(sat190a: 863 changes made)

{com}. sum     sat190a

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}sat190a {c |}{res}     11,536    9.100381    3.763509          0         15
{txt}
{com}. gen     ks1 = (sat190a - r(mean)) / r(sd)
{txt}(3,909 missing values generated)

{com}. label   var ks1 "Key stage 1 summary score"
{txt}
{com}. 
. 
. * Key stage 2
. foreach i in k2_tote k2_totm k2_tots {c -(}
{txt}  2{com}.         replace `i' = " " if inlist(`i',"_NV","-10","A","B","L","T","X","Z")
{txt}  3{com}. {c )-}
{txt}(3,167 real changes made)
(3,164 real changes made)
(3,035 real changes made)

{com}. destring k2_tote, gen(k2e)
{txt}k2_tote: all characters numeric; k2e {res}generated {txt}as {res}byte
{txt}(3439 missing values generated)
{res}{txt}
{com}. destring k2_totm, gen(k2m)
{txt}k2_totm: all characters numeric; k2m {res}generated {txt}as {res}byte
{txt}(3423 missing values generated)
{res}{txt}
{com}. destring k2_tots, gen(k2s)
{txt}k2_tots: all characters numeric; k2s {res}generated {txt}as {res}byte
{txt}(3270 missing values generated)
{res}{txt}
{com}. egen    k2 = rsum(k2e k2m k2s)
{txt}
{com}. sum     k2 if k2e<. & k2m<. & k2s<.

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}k2 {c |}{res}     11,813    180.9299    44.73032         17        272
{txt}
{com}. gen     ks2 = (k2 - r(mean)) / r(sd) if k2e<. & k2m<. & k2s<.
{txt}(3,632 missing values generated)

{com}. label   var ks2 "Key stage 2 summary score"
{txt}
{com}. drop    k2e k2m k2s k2
{txt}
{com}. 
. 
. * Key stage 3                   // We're missing the science score
. foreach i in k3_tote k3_totm {c -(}
{txt}  2{com}.         replace `i' = " " if inlist(`i',"-10","A","IN","M","V")
{txt}  3{com}. {c )-}
{txt}(4,554 real changes made)
(4,441 real changes made)

{com}. destring k3_tote, gen(k3e)
{txt}k3_tote: all characters numeric; k3e {res}generated {txt}as {res}byte
{txt}(5147 missing values generated)
{res}{txt}
{com}. destring k3_totm, gen(k3m)
{txt}k3_totm: all characters numeric; k3m {res}generated {txt}as {res}int
{txt}(4806 missing values generated)
{res}{txt}
{com}. egen    k3 = rsum(k3e k3m)
{txt}
{com}. sum     k3 if k3e<. & k3m<. 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}k3 {c |}{res}     10,170    127.6099    33.06029         12        238
{txt}
{com}. gen     ks3 = (k3 - r(mean)) / r(sd) if k3e<. & k3m<.
{txt}(5,275 missing values generated)

{com}. label   var ks3 "Key stage 3 summary score"
{txt}
{com}. drop    k3e k3m k3 
{txt}
{com}. 
. 
. * Key stage 4
. replace ks4_ptstnewe = . if inlist(`i',-10,-1,0)
{txt}(0 real changes made)

{com}. sum     ks4_ptstnewe 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
ks4_ptstnewe {c |}{res}     15,285    307.3833     214.792        -10       1281
{txt}
{com}. gen     ks4 = (ks4_ptstnewe - r(mean)) / r(sd)
{txt}(160 missing values generated)

{com}. label   var ks4 "Key stage 4 summary score"
{txt}
{com}. 
. 
. * IQ (WISC)
. recode  f8ws112 (-9999 -3 -2 = .)
{txt}(f8ws112: 140 changes made)

{com}. sum     f8ws112 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}f8ws112 {c |}{res}      7,348     103.974    16.53861         45        151
{txt}
{com}. gen     IQ = (f8ws112 - r(mean)) / r(sd)
{txt}(8,097 missing values generated)

{com}. label   var IQ "IQ (WISC) score, F8"
{txt}
{com}. 
. 
. *   August vs. September births
. gen     MoBnew = MoB
{txt}(3,107 missing values generated)

{com}. recode  MoBnew (9=1) (10=2) (11=3) (12=4) (1=5) (2=6) (3=7) (4=8) (5=9) (6=10) (7=11) (8=12)
{txt}(MoBnew: 12338 changes made)

{com}. label   def MoBnew 1 "Sep" 2 "Oct" 3 "Nov" 4 "Dec" 5 "Jan" 6 "Feb" 7 "Mar" 8 "Apr" 9 "May" 10 "Jun" 11 "Jul" 12 "Aug" 
{txt}
{com}. label   val MoBnew MoBnew
{txt}
{com}. 
. 
. 
. ***************************************************************************
. keep    cidB2492 qlet male ea ks1 ks2 ks3 ks4 IQ MoB MoBnew
{txt}
{com}. 
. preserve
{txt}
{com}. 
.         * Collapse the data
.         collapse ea ks1 ks2 ks3 ks4, by(MoB)
{txt}
{com}. 
.         twoway  (line ea    MoB, sort) ///
>                 (line ks1 MoB, sort) ///
>                 (line ks2 MoB, sort) ///
>                 (line ks3 MoB, sort) ///
>                 (line ks4 MoB, sort) ///
>                 , xlabel(1(1)12, valuelabel) ///
>                 ytitle("Standardised score") xtitle("Month of birth") ///
>                 legend(on order(1 "Age 4" 2 "Age 7" 3 "Age 11" 4 "Age 14" 5 "Age 16") pos(6) row(1)) ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Test scores by month of birth") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB.png", replace
{txt}(note: file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB.png not found)
(file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB.png written in PNG format)

{com}. 
.         twoway (line ea MoB, sort), xlabel(1(1)12, valuelabel) ///
>                 ytitle("Entry assessment") xtitle("Month of birth") ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Score on Entry Assessment test (age 4/5)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_EA.png", replace
{txt}(note: file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_EA.png not found)
(file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_EA.png written in PNG format)

{com}. 
.         twoway (line ks1 MoB, sort) if ks1>-0.5, xlabel(1(1)12, valuelabel) ///
>                 ytitle("Key Stage 1") xtitle("Month of birth") ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Score on Key Stage 1 test (age 7)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_KS1.png", replace
{txt}(note: file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_KS1.png not found)
(file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_KS1.png written in PNG format)

{com}. 
.         twoway (line ks2 MoB, sort) if ks2>-0.5, xlabel(1(1)12, valuelabel) ///
>                 ytitle("Neuroticism score") xtitle("Month of birth") ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Score on Key Stage 2 test (age 11)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_KS2.png", replace
{txt}(note: file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_KS2.png not found)
(file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_KS2.png written in PNG format)

{com}. 
.         twoway (line ks3 MoB, sort) if ks3>-0.5, xlabel(1(1)12, valuelabel) ///
>                 ytitle("Digits remembered correctly") xtitle("Month of birth") ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Score on Key Stage 3 test (age 14)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_KS3.png", replace
{txt}(note: file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_KS3.png not found)
(file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_KS3.png written in PNG format)

{com}. 
.         twoway (line ks4 MoB, sort) if ks4>-0.5, xlabel(1(1)12, valuelabel) ///
>                 ytitle("Prospective memory result") xtitle("Month of birth") ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Score on Key Stage 4 test (age 16)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_KS4.png", replace
{txt}(note: file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_KS4.png not found)
(file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/figures/MoB_KS4.png written in PNG format)

{com}. 
. restore
{txt}
{com}. 
. * Some simple regressions       // currently missing cohort members' (continuous) age when they sat the exam, need to request 
. *foreach i in ea age_ks1 age_ks2 age_ks3 age_ks4 {c -(}
. *       gen `i'x = `i'^2
. *{c )-}
. 
. eststo  m1: reg ea  ib8.MoB /*ea_age  ea_agex */ male, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     3,078
                                                {txt}{help j_robustsingular:F(0, 11) }         =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1551
                                                {txt}Root MSE          =    {res} .90457

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          ea{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .6180231{col 26}{space 2} .0003118{col 37}{space 1} 1981.91{col 46}{space 3}0.000{col 54}{space 4} .6173367{col 67}{space 3} .6187094
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .4697091{col 26}{space 2} .0012742{col 37}{space 1}  368.63{col 46}{space 3}0.000{col 54}{space 4} .4669046{col 67}{space 3} .4725136
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .3908032{col 26}{space 2}  .000073{col 37}{space 1} 5354.05{col 46}{space 3}0.000{col 54}{space 4} .3906426{col 67}{space 3} .3909639
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .4228937{col 26}{space 2} .0001176{col 37}{space 1} 3597.00{col 46}{space 3}0.000{col 54}{space 4} .4226349{col 67}{space 3} .4231524
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .2548549{col 26}{space 2} .0002579{col 37}{space 1}  988.31{col 46}{space 3}0.000{col 54}{space 4} .2542873{col 67}{space 3} .2554224
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .3138224{col 26}{space 2} .0001889{col 37}{space 1} 1661.13{col 46}{space 3}0.000{col 54}{space 4} .3134065{col 67}{space 3} .3142382
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .0398753{col 26}{space 2} .0003027{col 37}{space 1}  131.72{col 46}{space 3}0.000{col 54}{space 4}  .039209{col 67}{space 3} .0405416
{txt}{space 8}Sep  {c |}{col 14}{res}{space 2} 1.068263{col 26}{space 2} .0006467{col 37}{space 1} 1651.89{col 46}{space 3}0.000{col 54}{space 4}  1.06684{col 67}{space 3} 1.069686
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .9034336{col 26}{space 2}  .001051{col 37}{space 1}  859.56{col 46}{space 3}0.000{col 54}{space 4} .9011203{col 67}{space 3} .9057469
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .8216434{col 26}{space 2} .0002613{col 37}{space 1} 3144.77{col 46}{space 3}0.000{col 54}{space 4} .8210683{col 67}{space 3} .8222184
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .7352624{col 26}{space 2} .0004764{col 37}{space 1} 1543.34{col 46}{space 3}0.000{col 54}{space 4} .7342138{col 67}{space 3} .7363109
{txt}{space 12} {c |}
{space 8}male {c |}{col 14}{res}{space 2}-.3158166{col 26}{space 2} .0204034{col 37}{space 1}  -15.48{col 46}{space 3}0.000{col 54}{space 4}-.3607242{col 67}{space 3}-.2709089
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.2843167{col 26}{space 2} .0103906{col 37}{space 1}  -27.36{col 46}{space 3}0.000{col 54}{space 4}-.3071863{col 67}{space 3}-.2614471
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m2: reg ks1 ib8.MoB /*age_ks1 age_ks1x*/ male, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     9,570
                                                {txt}{help j_robustsingular:F(0, 11) }         =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0750
                                                {txt}Root MSE          =    {res} .94613

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .4668173{col 26}{space 2} .0000952{col 37}{space 1} 4901.99{col 46}{space 3}0.000{col 54}{space 4} .4666077{col 67}{space 3} .4670269
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .3526297{col 26}{space 2} .0000974{col 37}{space 1} 3619.97{col 46}{space 3}0.000{col 54}{space 4} .3524153{col 67}{space 3} .3528441
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .3364231{col 26}{space 2} .0005064{col 37}{space 1}  664.30{col 46}{space 3}0.000{col 54}{space 4} .3353084{col 67}{space 3} .3375378
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .3222722{col 26}{space 2} .0002511{col 37}{space 1} 1283.60{col 46}{space 3}0.000{col 54}{space 4} .3217196{col 67}{space 3} .3228248
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .1953627{col 26}{space 2} 2.61e-06{col 37}{space 1} 7.5e+04{col 46}{space 3}0.000{col 54}{space 4}  .195357{col 67}{space 3} .1953684
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}  .208365{col 26}{space 2} .0000785{col 37}{space 1} 2654.95{col 46}{space 3}0.000{col 54}{space 4} .2081923{col 67}{space 3} .2085378
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .1244092{col 26}{space 2} .0004466{col 37}{space 1}  278.57{col 46}{space 3}0.000{col 54}{space 4} .1234263{col 67}{space 3} .1253922
{txt}{space 8}Sep  {c |}{col 14}{res}{space 2} .6791138{col 26}{space 2} .0002196{col 37}{space 1} 3092.84{col 46}{space 3}0.000{col 54}{space 4} .6786306{col 67}{space 3} .6795971
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .6810836{col 26}{space 2}   .00021{col 37}{space 1} 3242.59{col 46}{space 3}0.000{col 54}{space 4} .6806213{col 67}{space 3} .6815459
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .6166193{col 26}{space 2} .0003966{col 37}{space 1} 1554.63{col 46}{space 3}0.000{col 54}{space 4} .6157463{col 67}{space 3} .6174923
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .6086041{col 26}{space 2} .0002768{col 37}{space 1} 2199.00{col 46}{space 3}0.000{col 54}{space 4} .6079949{col 67}{space 3} .6092132
{txt}{space 12} {c |}
{space 8}male {c |}{col 14}{res}{space 2}-.2642908{col 26}{space 2} .0173513{col 37}{space 1}  -15.23{col 46}{space 3}0.000{col 54}{space 4}-.3024808{col 67}{space 3}-.2261008
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.1776115{col 26}{space 2} .0088016{col 37}{space 1}  -20.18{col 46}{space 3}0.000{col 54}{space 4}-.1969838{col 67}{space 3}-.1582392
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m3: reg ks2 ib8.MoB /*age_ks2 age_ks2x*/ male, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}    10,031
                                                {txt}{help j_robustsingular:F(0, 11) }         =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0141
                                                {txt}Root MSE          =    {res} .97739

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .2427037{col 26}{space 2} .0001658{col 37}{space 1} 1463.67{col 46}{space 3}0.000{col 54}{space 4} .2423387{col 67}{space 3} .2430686
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .0290162{col 26}{space 2} .0003125{col 37}{space 1}   92.87{col 46}{space 3}0.000{col 54}{space 4} .0283285{col 67}{space 3} .0297039
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}  .099724{col 26}{space 2} .0006662{col 37}{space 1}  149.69{col 46}{space 3}0.000{col 54}{space 4} .0982577{col 67}{space 3} .1011903
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .1740905{col 26}{space 2} .0000419{col 37}{space 1} 4157.23{col 46}{space 3}0.000{col 54}{space 4} .1739983{col 67}{space 3} .1741826
{txt}{space 8}May  {c |}{col 14}{res}{space 2}  .158289{col 26}{space 2} .0000993{col 37}{space 1} 1593.46{col 46}{space 3}0.000{col 54}{space 4} .1580704{col 67}{space 3} .1585077
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .1846519{col 26}{space 2}  .000019{col 37}{space 1} 9716.22{col 46}{space 3}0.000{col 54}{space 4} .1846101{col 67}{space 3} .1846937
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}    .0771{col 26}{space 2} .0006717{col 37}{space 1}  114.78{col 46}{space 3}0.000{col 54}{space 4} .0756216{col 67}{space 3} .0785784
{txt}{space 8}Sep  {c |}{col 14}{res}{space 2}  .307107{col 26}{space 2} .0003896{col 37}{space 1}  788.32{col 46}{space 3}0.000{col 54}{space 4} .3062496{col 67}{space 3} .3079645
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .3393335{col 26}{space 2} .0000361{col 37}{space 1} 9390.30{col 46}{space 3}0.000{col 54}{space 4} .3392539{col 67}{space 3}  .339413
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .3029669{col 26}{space 2}  .000547{col 37}{space 1}  553.91{col 46}{space 3}0.000{col 54}{space 4} .3017631{col 67}{space 3} .3041708
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .2929717{col 26}{space 2} .0008274{col 37}{space 1}  354.10{col 46}{space 3}0.000{col 54}{space 4} .2911507{col 67}{space 3} .2947927
{txt}{space 12} {c |}
{space 8}male {c |}{col 14}{res}{space 2}-.0692444{col 26}{space 2} .0196671{col 37}{space 1}   -3.52{col 46}{space 3}0.005{col 54}{space 4}-.1125313{col 67}{space 3}-.0259575
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.0980788{col 26}{space 2} .0095819{col 37}{space 1}  -10.24{col 46}{space 3}0.000{col 54}{space 4}-.1191684{col 67}{space 3}-.0769892
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m4: reg ks3 ib8.MoB /*age_ks3 age_ks3x*/ male, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     8,643
                                                {txt}{help j_robustsingular:F(0, 11) }         =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0109
                                                {txt}Root MSE          =    {res} .99145

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .1261761{col 26}{space 2} .0000695{col 37}{space 1} 1814.29{col 46}{space 3}0.000{col 54}{space 4}  .126023{col 67}{space 3} .1263292
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .0152897{col 26}{space 2} .0002753{col 37}{space 1}   55.53{col 46}{space 3}0.000{col 54}{space 4} .0146837{col 67}{space 3} .0158958
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .0781658{col 26}{space 2} .0010544{col 37}{space 1}   74.14{col 46}{space 3}0.000{col 54}{space 4} .0758452{col 67}{space 3} .0804865
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0696053{col 26}{space 2} .0002665{col 37}{space 1}  261.23{col 46}{space 3}0.000{col 54}{space 4} .0690188{col 67}{space 3} .0701918
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0508406{col 26}{space 2} .0003628{col 37}{space 1}  140.13{col 46}{space 3}0.000{col 54}{space 4} .0500421{col 67}{space 3} .0516391
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .0581682{col 26}{space 2} .0001045{col 37}{space 1}  556.63{col 46}{space 3}0.000{col 54}{space 4} .0579382{col 67}{space 3} .0583983
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .0034704{col 26}{space 2} .0009062{col 37}{space 1}    3.83{col 46}{space 3}0.003{col 54}{space 4} .0014759{col 67}{space 3} .0054648
{txt}{space 8}Sep  {c |}{col 14}{res}{space 2} .1582011{col 26}{space 2} .0007802{col 37}{space 1}  202.77{col 46}{space 3}0.000{col 54}{space 4} .1564839{col 67}{space 3} .1599183
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2}  .269922{col 26}{space 2} .0001859{col 37}{space 1} 1452.30{col 46}{space 3}0.000{col 54}{space 4}  .269513{col 67}{space 3} .2703311
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .1284285{col 26}{space 2} .0006819{col 37}{space 1}  188.34{col 46}{space 3}0.000{col 54}{space 4} .1269277{col 67}{space 3} .1299293
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .1374556{col 26}{space 2} .0011072{col 37}{space 1}  124.15{col 46}{space 3}0.000{col 54}{space 4} .1350186{col 67}{space 3} .1398926
{txt}{space 12} {c |}
{space 8}male {c |}{col 14}{res}{space 2} -.136393{col 26}{space 2}  .027253{col 37}{space 1}   -5.00{col 46}{space 3}0.000{col 54}{space 4}-.1963765{col 67}{space 3}-.0764095
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .022289{col 26}{space 2} .0131278{col 37}{space 1}    1.70{col 46}{space 3}0.118{col 54}{space 4} -.006605{col 67}{space 3} .0511831
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m5: reg ks4 ib8.MoB                      male, robust cluster(MoB) 

{txt}Linear regression                               Number of obs     = {res}    12,338
                                                {txt}{help j_robustsingular:F(0, 11) }         =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0161
                                                {txt}Root MSE          =    {res} .96832

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .1142588{col 26}{space 2} .0000294{col 37}{space 1} 3884.35{col 46}{space 3}0.000{col 54}{space 4} .1141941{col 67}{space 3} .1143236
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .0507706{col 26}{space 2} .0003418{col 37}{space 1}  148.53{col 46}{space 3}0.000{col 54}{space 4} .0500182{col 67}{space 3} .0515229
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .0248033{col 26}{space 2} .0002789{col 37}{space 1}   88.93{col 46}{space 3}0.000{col 54}{space 4} .0241894{col 67}{space 3} .0254172
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0541986{col 26}{space 2} .0002034{col 37}{space 1}  266.43{col 46}{space 3}0.000{col 54}{space 4} .0537508{col 67}{space 3} .0546463
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0656837{col 26}{space 2} .0001046{col 37}{space 1}  628.04{col 46}{space 3}0.000{col 54}{space 4} .0654535{col 67}{space 3} .0659139
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .0490169{col 26}{space 2} .0000371{col 37}{space 1} 1320.13{col 46}{space 3}0.000{col 54}{space 4} .0489352{col 67}{space 3} .0490986
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .0026171{col 26}{space 2} .0007085{col 37}{space 1}    3.69{col 46}{space 3}0.004{col 54}{space 4} .0010578{col 67}{space 3} .0041764
{txt}{space 8}Sep  {c |}{col 14}{res}{space 2} .1273333{col 26}{space 2} .0003001{col 37}{space 1}  424.36{col 46}{space 3}0.000{col 54}{space 4} .1266728{col 67}{space 3} .1279937
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .1898665{col 26}{space 2}  .000066{col 37}{space 1} 2876.67{col 46}{space 3}0.000{col 54}{space 4} .1897212{col 67}{space 3} .1900118
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}  .138845{col 26}{space 2} .0003104{col 37}{space 1}  447.26{col 46}{space 3}0.000{col 54}{space 4} .1381618{col 67}{space 3} .1395283
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .1510282{col 26}{space 2} .0005053{col 37}{space 1}  298.89{col 46}{space 3}0.000{col 54}{space 4} .1499161{col 67}{space 3} .1521404
{txt}{space 12} {c |}
{space 8}male {c |}{col 14}{res}{space 2}-.2137669{col 26}{space 2} .0197313{col 37}{space 1}  -10.83{col 46}{space 3}0.000{col 54}{space 4}-.2571952{col 67}{space 3}-.1703386
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1300813{col 26}{space 2} .0099889{col 37}{space 1}   13.02{col 46}{space 3}0.000{col 54}{space 4} .1080959{col 67}{space 3} .1520666
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab  m1 m2 m3 m4 m5, b se keep(*.MoB) star(* 0.10 ** 0.05 *** 0.01) stats(N, fmt(0))
{res}
{txt}{hline 92}
{txt}                      (1)             (2)             (3)             (4)             (5)   
{txt}                       ea             ks1             ks2             ks3             ks4   
{txt}{hline 92}
{txt}1.MoB       {res}        0.618***        0.467***        0.243***        0.126***        0.114***{txt}
            {res} {ralign 12:{txt:(}0.000312{txt:)}}    {ralign 12:{txt:(}0.0000952{txt:)}}    {ralign 12:{txt:(}0.000166{txt:)}}    {ralign 12:{txt:(}0.0000695{txt:)}}    {ralign 12:{txt:(}0.0000294{txt:)}}   {txt}

{txt}2.MoB       {res}        0.470***        0.353***       0.0290***       0.0153***       0.0508***{txt}
            {res} {ralign 12:{txt:(}0.00127{txt:)}}    {ralign 12:{txt:(}0.0000974{txt:)}}    {ralign 12:{txt:(}0.000312{txt:)}}    {ralign 12:{txt:(}0.000275{txt:)}}    {ralign 12:{txt:(}0.000342{txt:)}}   {txt}

{txt}3.MoB       {res}        0.391***        0.336***       0.0997***       0.0782***       0.0248***{txt}
            {res} {ralign 12:{txt:(}0.0000730{txt:)}}    {ralign 12:{txt:(}0.000506{txt:)}}    {ralign 12:{txt:(}0.000666{txt:)}}    {ralign 12:{txt:(}0.00105{txt:)}}    {ralign 12:{txt:(}0.000279{txt:)}}   {txt}

{txt}4.MoB       {res}        0.423***        0.322***        0.174***       0.0696***       0.0542***{txt}
            {res} {ralign 12:{txt:(}0.000118{txt:)}}    {ralign 12:{txt:(}0.000251{txt:)}}    {ralign 12:{txt:(}0.0000419{txt:)}}    {ralign 12:{txt:(}0.000266{txt:)}}    {ralign 12:{txt:(}0.000203{txt:)}}   {txt}

{txt}5.MoB       {res}        0.255***        0.195***        0.158***       0.0508***       0.0657***{txt}
            {res} {ralign 12:{txt:(}0.000258{txt:)}}    {ralign 12:{txt:(}0.00000261{txt:)}}    {ralign 12:{txt:(}0.0000993{txt:)}}    {ralign 12:{txt:(}0.000363{txt:)}}    {ralign 12:{txt:(}0.000105{txt:)}}   {txt}

{txt}6.MoB       {res}        0.314***        0.208***        0.185***       0.0582***       0.0490***{txt}
            {res} {ralign 12:{txt:(}0.000189{txt:)}}    {ralign 12:{txt:(}0.0000785{txt:)}}    {ralign 12:{txt:(}0.0000190{txt:)}}    {ralign 12:{txt:(}0.000105{txt:)}}    {ralign 12:{txt:(}0.0000371{txt:)}}   {txt}

{txt}7.MoB       {res}       0.0399***        0.124***       0.0771***      0.00347***      0.00262***{txt}
            {res} {ralign 12:{txt:(}0.000303{txt:)}}    {ralign 12:{txt:(}0.000447{txt:)}}    {ralign 12:{txt:(}0.000672{txt:)}}    {ralign 12:{txt:(}0.000906{txt:)}}    {ralign 12:{txt:(}0.000708{txt:)}}   {txt}

{txt}8.MoB       {res}            0               0               0               0               0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}9.MoB       {res}        1.068***        0.679***        0.307***        0.158***        0.127***{txt}
            {res} {ralign 12:{txt:(}0.000647{txt:)}}    {ralign 12:{txt:(}0.000220{txt:)}}    {ralign 12:{txt:(}0.000390{txt:)}}    {ralign 12:{txt:(}0.000780{txt:)}}    {ralign 12:{txt:(}0.000300{txt:)}}   {txt}

{txt}10.MoB      {res}        0.903***        0.681***        0.339***        0.270***        0.190***{txt}
            {res} {ralign 12:{txt:(}0.00105{txt:)}}    {ralign 12:{txt:(}0.000210{txt:)}}    {ralign 12:{txt:(}0.0000361{txt:)}}    {ralign 12:{txt:(}0.000186{txt:)}}    {ralign 12:{txt:(}0.0000660{txt:)}}   {txt}

{txt}11.MoB      {res}        0.822***        0.617***        0.303***        0.128***        0.139***{txt}
            {res} {ralign 12:{txt:(}0.000261{txt:)}}    {ralign 12:{txt:(}0.000397{txt:)}}    {ralign 12:{txt:(}0.000547{txt:)}}    {ralign 12:{txt:(}0.000682{txt:)}}    {ralign 12:{txt:(}0.000310{txt:)}}   {txt}

{txt}12.MoB      {res}        0.735***        0.609***        0.293***        0.137***        0.151***{txt}
            {res} {ralign 12:{txt:(}0.000476{txt:)}}    {ralign 12:{txt:(}0.000277{txt:)}}    {ralign 12:{txt:(}0.000827{txt:)}}    {ralign 12:{txt:(}0.00111{txt:)}}    {ralign 12:{txt:(}0.000505{txt:)}}   {txt}
{txt}{hline 92}
{txt}N           {res}         3078            9570           10031            8643           12338   {txt}
{txt}{hline 92}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. esttab  m1 m2 m3 m4 m5 using "${c -(}dirtables{c )-}/MoB_OLS.tex", replace ///
>         frag bookt b(2) se(2) keep(*.MoB) drop(8.MoB) star(* 0.10 ** 0.05 *** 0.01) ///
>         mtitles("Age 4" "Age 7" "Age 11" "Age 14" "Age 16") ///
>         stats(N, label("Observations") fmt(0)) nonotes coeflabel(1.MoB "Jan" 2.MoB "Feb" 3.MoB "Mar" 4.MoB "Apr" 5.MoB "May" 6.MoB "Jun" 7.MoB "Jul" 9.MoB "Sep" 10.MoB "Oct" 11.MoB "Nov" 12.MoB "Dec" ) 
{res}{txt}(note: file C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/tables/MoB_OLS.tex not found)
(output written to {browse  `"C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/tables/MoB_OLS.tex"'})

{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:/Users/pbirol/Documents/work/ALSPAC_GxE/Alspac/logfiles/PractictionersPaper_2020-04-17_00-13-32.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Apr 2020, 00:13:40
{txt}{.-}
{smcl}
{txt}{sf}{ul off}