{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}\\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/logfiles/PractictionersPaper_2020-04-17_22-29-23.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Apr 2020, 22:29:23
{txt}
{com}. 
. 
. 
. *** Saving PCs into Stata format
. insheet using "${c -(}dir{c )-}/Child/ALSPAC_pc_10_CHILDREN.csv", clear
{txt}(12 vars, 8,226 obs)

{com}. rename  v1 id_child 
{res}{txt}
{com}. drop    v2
{txt}
{com}. foreach i in 3 4 5 6 7 8 9 10 11 12 {c -(}
{txt}  2{com}.         local p = (`i'-2)
{txt}  3{com}.         rename v`i' PC`p'
{txt}  4{com}. {c )-}
{res}{txt}
{com}. compress
{txt}  (0 bytes saved)

{com}. save    "${c -(}dir{c )-}/Child/ALSPAC_pc_10_CHILDREN.dta", replace
{txt}file \\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/Child/ALSPAC_pc_10_CHILDREN.dta saved

{com}. 
. 
. 
. *** On ALSPAC data held at Erasmus
. use     "${c -(}dir{c )-}/Data_Set/Rietveld_12Sep18.dta", clear
{txt}
{com}. rename  qlet birth_order
{res}{txt}
{com}. merge   1:1 cidB2492 birth_order using "${c -(}dir{c )-}/Child/PGS_children_alspac_plink_EA.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}           7,459
{txt}{col 9}from master{col 30}{res}           7,339{txt}  (_merge==1)
{col 9}from using{col 30}{res}             120{txt}  (_merge==2)

{col 5}matched{col 30}{res}           8,106{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop    if _m<3
{txt}(7,459 observations deleted)

{com}. drop    _merge
{txt}
{com}. merge   1:1 id_child using "${c -(}dir{c )-}/Child/ALSPAC_pc_10_CHILDREN.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}             120
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}             120{txt}  (_merge==2)

{col 5}matched{col 30}{res}           8,106{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop    if _m<3
{txt}(120 observations deleted)

{com}. drop    _merge
{txt}
{com}. 
. 
. * Month of birth
. gen     MoB = ka498
{txt}(833 missing values generated)

{com}. recode  MoB (-9999=.)
{txt}(MoB: 5 changes made)

{com}. label   def MoB 1 "Jan" 2 "Feb" 3 "Mar" 4 "Apr" 5 "May" 6 "Jun" 7 "Jul" 8 "Aug" 9 "Sep" 10 "Oct" 11 "Nov" 12 "Dec"
{txt}
{com}. label   val MoB MoB
{txt}
{com}. label   var MoB "Month of birth"
{txt}
{com}. 
. 
. * Gender
. gen     male = kz021
{txt}
{com}. recode  male (2=0) (-9999 -1 = .)
{txt}(male: 3957 changes made)

{com}. label   var male "Male"
{txt}
{com}. 
. 
. * Entry assessment score
. recode  sat092b (-10 -6 -5 = .)
{txt}(sat092b: 4859 changes made)

{com}. sum     sat092b 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}sat092b {c |}{res}      2,066    26.75315    6.021194          3         39
{txt}
{com}. gen     ea = (sat092b - r(mean)) / r(sd)
{txt}(6,040 missing values generated)

{com}. label   var ea "Entry Assessment score"
{txt}
{com}. 
. 
. * Key stage 1 
. recode  sat190a (-10 -6 -5 = .)
{txt}(sat190a: 471 changes made)

{com}. sum     sat190a

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}sat190a {c |}{res}      6,454    9.645181    3.652533          0         15
{txt}
{com}. gen     ks1 = (sat190a - r(mean)) / r(sd)
{txt}(1,652 missing values generated)

{com}. label   var ks1 "Key stage 1 summary score"
{txt}
{com}. 
. 
. * Key stage 2
. foreach i in k2_tote k2_totm k2_tots {c -(}
{txt}  2{com}.         replace `i' = " " if inlist(`i',"_NV","-10","A","B","L","T","X","Z")
{txt}  3{com}. {c )-}
{txt}(1,191 real changes made)
(1,183 real changes made)
(1,129 real changes made)

{com}. destring k2_tote, gen(k2e)
{txt}k2_tote: all characters numeric; k2e {res}generated {txt}as {res}byte
{txt}(1272 missing values generated)
{res}{txt}
{com}. destring k2_totm, gen(k2m)
{txt}k2_totm: all characters numeric; k2m {res}generated {txt}as {res}byte
{txt}(1262 missing values generated)
{res}{txt}
{com}. destring k2_tots, gen(k2s)
{txt}k2_tots: all characters numeric; k2s {res}generated {txt}as {res}byte
{txt}(1199 missing values generated)
{res}{txt}
{com}. egen    k2 = rsum(k2e k2m k2s)
{txt}
{com}. sum     k2 if k2e<. & k2m<. & k2s<.

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}k2 {c |}{res}      6,749    186.6582    42.95279         24        272
{txt}
{com}. gen     ks2 = (k2 - r(mean)) / r(sd) if k2e<. & k2m<. & k2s<.
{txt}(1,357 missing values generated)

{com}. label   var ks2 "Key stage 2 summary score"
{txt}
{com}. drop    k2e k2m k2s k2
{txt}
{com}. 
. 
. * Key stage 3
. foreach i in k3_tote k3_totm {c -(}
{txt}  2{com}.         replace `i' = " " if inlist(`i',"-10","A","IN","M","V")
{txt}  3{com}. {c )-}
{txt}(1,987 real changes made)
(1,934 real changes made)

{com}. destring k3_tote, gen(k3e)
{txt}k3_tote: all characters numeric; k3e {res}generated {txt}as {res}byte
{txt}(2218 missing values generated)
{res}{txt}
{com}. destring k3_totm, gen(k3m)
{txt}k3_totm: all characters numeric; k3m {res}generated {txt}as {res}int
{txt}(2066 missing values generated)
{res}{txt}
{com}. egen    k3 = rsum(k3e k3m)
{txt}
{com}. sum     k3 if k3e<. & k3m<. 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}k3 {c |}{res}      5,826    131.6672    32.46244         19        238
{txt}
{com}. gen     ks3 = (k3 - r(mean)) / r(sd) if k3e<. & k3m<.
{txt}(2,280 missing values generated)

{com}. label   var ks3 "Key stage 3 summary score"
{txt}
{com}. drop    k3e k3m k3 
{txt}
{com}. 
. 
. * Key stage 4
. replace ks4_ptstnewe = . if inlist(`i',-10,-1,0)
{txt}(0 real changes made)

{com}. sum     ks4_ptstnewe 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
ks4_ptstnewe {c |}{res}      8,064    346.4378    205.0115        -10     1170.5
{txt}
{com}. gen     ks4 = (ks4_ptstnewe - r(mean)) / r(sd)
{txt}(42 missing values generated)

{com}. label   var ks4 "Key stage 4 summary score"
{txt}
{com}. 
. 
. * IQ (WISC)
. recode  f8ws112 (-9999 -3 -2 = .)
{txt}(f8ws112: 99 changes made)

{com}. sum     f8ws112 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}f8ws112 {c |}{res}      5,438     104.831    16.40612         45        151
{txt}
{com}. gen     IQ = (f8ws112 - r(mean)) / r(sd)
{txt}(2,668 missing values generated)

{com}. label   var IQ "IQ (WISC) score, F8"
{txt}
{com}. 
. 
. *   August vs. September births
. gen     MoBnew = MoB
{txt}(838 missing values generated)

{com}. recode  MoBnew (9=1) (10=2) (11=3) (12=4) (1=5) (2=6) (3=7) (4=8) (5=9) (6=10) (7=11) (8=12)
{txt}(MoBnew: 7268 changes made)

{com}. label   def MoBnew 1 "Sep" 2 "Oct" 3 "Nov" 4 "Dec" 5 "Jan" 6 "Feb" 7 "Mar" 8 "Apr" 9 "May" 10 "Jun" 11 "Jul" 12 "Aug" 
{txt}
{com}. label   val MoBnew MoBnew
{txt}
{com}. 
. 
. 
. ***************************************************************************
. keep    cidB2492 birth_order male ea ks1 ks2 ks3 ks4 IQ MoB MoBnew pgs_child_EA PC*
{txt}
{com}. rename  pgs_child_EA PGS
{res}{txt}
{com}. 
. * Standardize to have mean 0 and standard deviation 1
. sum     PGS

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}PGS {c |}{res}      8,106   -.0000432      .00005  -.0002172   .0001586
{txt}
{com}. replace PGS = (PGS-r(mean))/(r(sd))
{txt}(8,106 real changes made)

{com}. sum     PGS

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}PGS {c |}{res}      8,106   -3.25e-10           1  -3.479574   4.034519
{txt}
{com}. 
. preserve
{txt}
{com}. 
.         * Collapse the data
.         collapse ea ks1 ks2 ks3 ks4, by(MoB MoBnew)
{txt}
{com}. 
.         twoway  (line ea  MoBnew, sort) ///
>                 (line ks1 MoBnew, sort) ///
>                 (line ks2 MoBnew, sort) ///
>                 (line ks3 MoBnew, sort) ///
>                 (line ks4 MoBnew, sort) ///
>                 , xlabel(1(1)12, valuelabel) ///
>                 ytitle("Standardised score") xtitle("Month of birth") ///
>                 legend(on order(1 "Age 4" 2 "Age 7" 3 "Age 11" 4 "Age 14" 5 "Age 16") pos(6) row(1)) ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Test scores by month of birth") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoBnew.png", replace
{txt}(file \\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/figures/MoBnew.png written in PNG format)

{com}.         
.         twoway  (line ea  MoB, sort) ///
>                 (line ks1 MoB, sort) ///
>                 (line ks2 MoB, sort) ///
>                 (line ks3 MoB, sort) ///
>                 (line ks4 MoB, sort) ///
>                 , xlabel(1(1)12, valuelabel) ///
>                 ytitle("Standardised score") xtitle("Month of birth") ///
>                 legend(on order(1 "Age 4" 2 "Age 7" 3 "Age 11" 4 "Age 14" 5 "Age 16") pos(6) row(1)) ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Test scores by month of birth") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB.png", replace
{txt}(file \\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/figures/MoB.png written in PNG format)

{com}. 
.         twoway (line ea MoB, sort), xlabel(1(1)12, valuelabel) ///
>                 ytitle("Entry assessment") xtitle("Month of birth") ///
>                 ylabel(-1(.5)1) yscale(range(-1 1)) yline(0) ///
>                 title("Score on Entry Assessment test (age 4/5)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_EA.png", replace
{txt}(file \\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/figures/MoB_EA.png written in PNG format)

{com}.         
.         twoway (line ks1 MoB, sort) if ks1>-0.5, xlabel(1(1)12, valuelabel) ///
>                 ytitle("Key Stage 1") xtitle("Month of birth") ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Score on Key Stage 1 test (age 7)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_KS1.png", replace
{txt}(file \\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/figures/MoB_KS1.png written in PNG format)

{com}. 
.         twoway (line ks2 MoB, sort) if ks2>-0.5, xlabel(1(1)12, valuelabel) ///
>                 ytitle("Neuroticism score") xtitle("Month of birth") ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Score on Key Stage 2 test (age 11)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_KS2.png", replace
{txt}(file \\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/figures/MoB_KS2.png written in PNG format)

{com}.         
.         twoway (line ks3 MoB, sort) if ks3>-0.5, xlabel(1(1)12, valuelabel) ///
>                 ytitle("Digits remembered correctly") xtitle("Month of birth") ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Score on Key Stage 3 test (age 14)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_KS3.png", replace
{txt}(file \\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/figures/MoB_KS3.png written in PNG format)

{com}. 
.         twoway (line ks4 MoB, sort) if ks4>-0.5, xlabel(1(1)12, valuelabel) ///
>                 ytitle("Prospective memory result") xtitle("Month of birth") ///
>                 ylabel(-.5(.25).5) yscale(range(-0.5 0.5)) yline(0) ///
>                 title("Score on Key Stage 4 test (age 16)") scheme(s1mono)
{res}{txt}
{com}.         graph export "${c -(}dirfigures{c )-}/MoB_KS4.png", replace
{txt}(file \\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/figures/MoB_KS4.png written in PNG format)

{com}. 
. restore
{txt}
{com}. 
. * Some simple regressions
. 
. * No GxE interactions
. eststo  m1: reg ea  ib9.MoB PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     1,826
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1866
                                                {txt}Root MSE          =    {res} .89719

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          ea{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}-.2072028{col 26}{space 2} .0054888{col 37}{space 1}  -37.75{col 46}{space 3}0.000{col 54}{space 4}-.2192835{col 67}{space 3}-.1951221
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.5747052{col 26}{space 2} .0061919{col 37}{space 1}  -92.82{col 46}{space 3}0.000{col 54}{space 4}-.5883335{col 67}{space 3}-.5610769
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.6114168{col 26}{space 2} .0085835{col 37}{space 1}  -71.23{col 46}{space 3}0.000{col 54}{space 4}-.6303089{col 67}{space 3}-.5925248
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.4451914{col 26}{space 2} .0086393{col 37}{space 1}  -51.53{col 46}{space 3}0.000{col 54}{space 4}-.4642065{col 67}{space 3}-.4261763
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.7430479{col 26}{space 2} .0057667{col 37}{space 1} -128.85{col 46}{space 3}0.000{col 54}{space 4}-.7557402{col 67}{space 3}-.7303555
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} -.680788{col 26}{space 2} .0058515{col 37}{space 1} -116.34{col 46}{space 3}0.000{col 54}{space 4}-.6936672{col 67}{space 3}-.6679089
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-1.002926{col 26}{space 2} .0068314{col 37}{space 1} -146.81{col 46}{space 3}0.000{col 54}{space 4}-1.017961{col 67}{space 3}-.9878896
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.9721355{col 26}{space 2}  .008325{col 37}{space 1} -116.77{col 46}{space 3}0.000{col 54}{space 4}-.9904587{col 67}{space 3}-.9538123
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2}-.1412398{col 26}{space 2} .0051869{col 37}{space 1}  -27.23{col 46}{space 3}0.000{col 54}{space 4}-.1526562{col 67}{space 3}-.1298235
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}-.1684965{col 26}{space 2} .0076001{col 37}{space 1}  -22.17{col 46}{space 3}0.000{col 54}{space 4}-.1852242{col 67}{space 3}-.1517688
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.3103599{col 26}{space 2} .0042404{col 37}{space 1}  -73.19{col 46}{space 3}0.000{col 54}{space 4}-.3196929{col 67}{space 3}-.3010269
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .1354025{col 26}{space 2} .0258778{col 37}{space 1}    5.23{col 46}{space 3}0.000{col 54}{space 4} .0784459{col 67}{space 3}  .192359
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3882236{col 26}{space 2} .0298276{col 37}{space 1}  -13.02{col 46}{space 3}0.000{col 54}{space 4}-.4538736{col 67}{space 3}-.3225736
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-3.798066{col 26}{space 2} 1.607382{col 37}{space 1}   -2.36{col 46}{space 3}0.038{col 54}{space 4} -7.33589{col 67}{space 3}-.2602425
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} 3.392759{col 26}{space 2} 2.373157{col 37}{space 1}    1.43{col 46}{space 3}0.181{col 54}{space 4}-1.830525{col 67}{space 3} 8.616042
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}  .539355{col 26}{space 2} 1.524538{col 37}{space 1}    0.35{col 46}{space 3}0.730{col 54}{space 4} -2.81613{col 67}{space 3}  3.89484
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} -1.80441{col 26}{space 2} 1.864727{col 37}{space 1}   -0.97{col 46}{space 3}0.354{col 54}{space 4}-5.908646{col 67}{space 3} 2.299827
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-.8361552{col 26}{space 2}  2.66426{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-6.700152{col 67}{space 3} 5.027841
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2} 1.345765{col 26}{space 2}  1.60591{col 37}{space 1}    0.84{col 46}{space 3}0.420{col 54}{space 4}-2.188819{col 67}{space 3} 4.880348
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.036981{col 26}{space 2}  2.03639{col 37}{space 1}    0.51{col 46}{space 3}0.621{col 54}{space 4}-3.445082{col 67}{space 3} 5.519045
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-2.798752{col 26}{space 2} 1.307165{col 37}{space 1}   -2.14{col 46}{space 3}0.056{col 54}{space 4}-5.675802{col 67}{space 3} .0782974
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-1.817065{col 26}{space 2} 1.944461{col 37}{space 1}   -0.93{col 46}{space 3}0.370{col 54}{space 4}-6.096794{col 67}{space 3} 2.462664
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.8382145{col 26}{space 2} 1.928842{col 37}{space 1}   -0.43{col 46}{space 3}0.672{col 54}{space 4}-5.083567{col 67}{space 3} 3.407138
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .737499{col 26}{space 2}  .014135{col 37}{space 1}   52.18{col 46}{space 3}0.000{col 54}{space 4}  .706388{col 67}{space 3}   .76861
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m2: reg ks1 ib9.MoB PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,734
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1379
                                                {txt}Root MSE          =    {res} .91376

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}  -.18571{col 26}{space 2} .0030785{col 37}{space 1}  -60.32{col 46}{space 3}0.000{col 54}{space 4}-.1924857{col 67}{space 3}-.1789343
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.3170556{col 26}{space 2} .0026244{col 37}{space 1} -120.81{col 46}{space 3}0.000{col 54}{space 4}-.3228319{col 67}{space 3}-.3112792
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.3819824{col 26}{space 2} .0020377{col 37}{space 1} -187.46{col 46}{space 3}0.000{col 54}{space 4}-.3864673{col 67}{space 3}-.3774975
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.3491325{col 26}{space 2} .0010649{col 37}{space 1} -327.87{col 46}{space 3}0.000{col 54}{space 4}-.3514762{col 67}{space 3}-.3467887
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.4604687{col 26}{space 2} .0021401{col 37}{space 1} -215.16{col 46}{space 3}0.000{col 54}{space 4}-.4651791{col 67}{space 3}-.4557584
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.4621673{col 26}{space 2} .0024129{col 37}{space 1} -191.54{col 46}{space 3}0.000{col 54}{space 4} -.467478{col 67}{space 3}-.4568567
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.5224579{col 26}{space 2} .0017101{col 37}{space 1} -305.51{col 46}{space 3}0.000{col 54}{space 4}-.5262218{col 67}{space 3} -.518694
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.654396{col 26}{space 2}  .002204{col 37}{space 1} -296.91{col 46}{space 3}0.000{col 54}{space 4} -.659247{col 67}{space 3}-.6495449
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2}-.0363438{col 26}{space 2}  .001343{col 37}{space 1}  -27.06{col 46}{space 3}0.000{col 54}{space 4}-.0392997{col 67}{space 3}-.0333878
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}-.0451925{col 26}{space 2} .0015218{col 37}{space 1}  -29.70{col 46}{space 3}0.000{col 54}{space 4}-.0485418{col 67}{space 3}-.0418431
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0695002{col 26}{space 2} .0017605{col 37}{space 1}  -39.48{col 46}{space 3}0.000{col 54}{space 4} -.073375{col 67}{space 3}-.0656254
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .2442087{col 26}{space 2}  .008919{col 37}{space 1}   27.38{col 46}{space 3}0.000{col 54}{space 4} .2245781{col 67}{space 3} .2638394
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3054633{col 26}{space 2} .0215027{col 37}{space 1}  -14.21{col 46}{space 3}0.000{col 54}{space 4}-.3527903{col 67}{space 3}-.2581362
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} -1.28599{col 26}{space 2}  1.18378{col 37}{space 1}   -1.09{col 46}{space 3}0.301{col 54}{space 4}-3.891473{col 67}{space 3} 1.319493
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.6615521{col 26}{space 2}  .748159{col 37}{space 1}   -0.88{col 46}{space 3}0.395{col 54}{space 4}-2.308239{col 67}{space 3} .9851346
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}-1.095729{col 26}{space 2} .4844826{col 37}{space 1}   -2.26{col 46}{space 3}0.045{col 54}{space 4}-2.162068{col 67}{space 3}-.0293903
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} .9218761{col 26}{space 2} 1.115259{col 37}{space 1}    0.83{col 46}{space 3}0.426{col 54}{space 4}-1.532793{col 67}{space 3} 3.376546
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.211539{col 26}{space 2}   1.0445{col 37}{space 1}   -1.16{col 46}{space 3}0.271{col 54}{space 4}-3.510469{col 67}{space 3}  1.08739
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2} .1199528{col 26}{space 2} 1.103164{col 37}{space 1}    0.11{col 46}{space 3}0.915{col 54}{space 4}-2.308095{col 67}{space 3}    2.548
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.488797{col 26}{space 2}  1.31846{col 37}{space 1}    1.13{col 46}{space 3}0.283{col 54}{space 4}-1.413114{col 67}{space 3} 4.390708
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.6045012{col 26}{space 2} .8572367{col 37}{space 1}   -0.71{col 46}{space 3}0.495{col 54}{space 4}-2.491267{col 67}{space 3} 1.282264
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2} -2.60559{col 26}{space 2} .8768195{col 37}{space 1}   -2.97{col 46}{space 3}0.013{col 54}{space 4}-4.535457{col 67}{space 3}-.6757235
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .1768726{col 26}{space 2} .9359525{col 37}{space 1}    0.19{col 46}{space 3}0.854{col 54}{space 4}-1.883145{col 67}{space 3}  2.23689
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4970185{col 26}{space 2} .0109441{col 37}{space 1}   45.41{col 46}{space 3}0.000{col 54}{space 4} .4729306{col 67}{space 3} .5211064
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m3: reg ks2 ib9.MoB PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     6,075
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1128
                                                {txt}Root MSE          =    {res} .93079

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}-.0380031{col 26}{space 2} .0028975{col 37}{space 1}  -13.12{col 46}{space 3}0.000{col 54}{space 4}-.0443804{col 67}{space 3}-.0316259
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} -.235375{col 26}{space 2}  .000743{col 37}{space 1} -316.81{col 46}{space 3}0.000{col 54}{space 4}-.2370102{col 67}{space 3}-.2337397
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.2080839{col 26}{space 2}  .001816{col 37}{space 1} -114.58{col 46}{space 3}0.000{col 54}{space 4}-.2120809{col 67}{space 3}-.2040869
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.1327026{col 26}{space 2} .0019593{col 37}{space 1}  -67.73{col 46}{space 3}0.000{col 54}{space 4} -.137015{col 67}{space 3}-.1283902
{txt}{space 8}May  {c |}{col 14}{res}{space 2} -.156657{col 26}{space 2} .0028207{col 37}{space 1}  -55.54{col 46}{space 3}0.000{col 54}{space 4}-.1628653{col 67}{space 3}-.1504487
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.1028139{col 26}{space 2} .0019467{col 37}{space 1}  -52.81{col 46}{space 3}0.000{col 54}{space 4}-.1070987{col 67}{space 3}-.0985292
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.2418209{col 26}{space 2} .0029309{col 37}{space 1}  -82.51{col 46}{space 3}0.000{col 54}{space 4}-.2482719{col 67}{space 3}  -.23537
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.301657{col 26}{space 2} .0028528{col 37}{space 1} -105.74{col 46}{space 3}0.000{col 54}{space 4}-.3079359{col 67}{space 3}-.2953781
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2}  .024565{col 26}{space 2} .0016222{col 37}{space 1}   15.14{col 46}{space 3}0.000{col 54}{space 4} .0209945{col 67}{space 3} .0281354
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}  .022144{col 26}{space 2} .0017964{col 37}{space 1}   12.33{col 46}{space 3}0.000{col 54}{space 4}   .01819{col 67}{space 3} .0260979
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0416953{col 26}{space 2} .0027426{col 37}{space 1}  -15.20{col 46}{space 3}0.000{col 54}{space 4}-.0477317{col 67}{space 3}-.0356589
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .3086516{col 26}{space 2} .0117932{col 37}{space 1}   26.17{col 46}{space 3}0.000{col 54}{space 4}  .282695{col 67}{space 3} .3346082
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1197716{col 26}{space 2} .0225081{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-.1693116{col 67}{space 3}-.0702316
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-.6501818{col 26}{space 2} .9175074{col 37}{space 1}   -0.71{col 46}{space 3}0.493{col 54}{space 4}-2.669602{col 67}{space 3} 1.369238
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} .9882684{col 26}{space 2} .8565832{col 37}{space 1}    1.15{col 46}{space 3}0.273{col 54}{space 4}-.8970585{col 67}{space 3} 2.873595
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}-.0689867{col 26}{space 2} .7410717{col 37}{space 1}   -0.09{col 46}{space 3}0.928{col 54}{space 4}-1.700074{col 67}{space 3} 1.562101
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 2.351226{col 26}{space 2} 1.195063{col 37}{space 1}    1.97{col 46}{space 3}0.075{col 54}{space 4}-.2790892{col 67}{space 3} 4.981542
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.364756{col 26}{space 2}  1.15769{col 37}{space 1}   -1.18{col 46}{space 3}0.263{col 54}{space 4}-3.912815{col 67}{space 3} 1.183303
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-.4907964{col 26}{space 2} 1.054427{col 37}{space 1}   -0.47{col 46}{space 3}0.651{col 54}{space 4}-2.811575{col 67}{space 3} 1.829982
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.246615{col 26}{space 2} 1.110541{col 37}{space 1}    1.12{col 46}{space 3}0.286{col 54}{space 4}-1.197669{col 67}{space 3} 3.690898
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-1.487752{col 26}{space 2} 1.107962{col 37}{space 1}   -1.34{col 46}{space 3}0.206{col 54}{space 4}-3.926361{col 67}{space 3} .9508566
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}  -2.2083{col 26}{space 2} 1.415423{col 37}{space 1}   -1.56{col 46}{space 3}0.147{col 54}{space 4}-5.323625{col 67}{space 3} .9070248
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .3578649{col 26}{space 2} .8891235{col 37}{space 1}    0.40{col 46}{space 3}0.695{col 54}{space 4}-1.599083{col 67}{space 3} 2.314813
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2067718{col 26}{space 2} .0113275{col 37}{space 1}   18.25{col 46}{space 3}0.000{col 54}{space 4} .1818401{col 67}{space 3} .2317035
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m4: reg ks3 ib9.MoB PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,240
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1101
                                                {txt}Root MSE          =    {res} .94189

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .0053307{col 26}{space 2} .0023776{col 37}{space 1}    2.24{col 46}{space 3}0.047{col 54}{space 4} .0000976{col 67}{space 3} .0105638
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.1199532{col 26}{space 2} .0029252{col 37}{space 1}  -41.01{col 46}{space 3}0.000{col 54}{space 4}-.1263914{col 67}{space 3}-.1135149
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.0640077{col 26}{space 2} .0021747{col 37}{space 1}  -29.43{col 46}{space 3}0.000{col 54}{space 4}-.0687941{col 67}{space 3}-.0592212
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.1151996{col 26}{space 2} .0020303{col 37}{space 1}  -56.74{col 46}{space 3}0.000{col 54}{space 4}-.1196683{col 67}{space 3} -.110731
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.0745865{col 26}{space 2} .0025234{col 37}{space 1}  -29.56{col 46}{space 3}0.000{col 54}{space 4}-.0801404{col 67}{space 3}-.0690326
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0847456{col 26}{space 2} .0017905{col 37}{space 1}  -47.33{col 46}{space 3}0.000{col 54}{space 4}-.0886865{col 67}{space 3}-.0808048
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.1694747{col 26}{space 2} .0018934{col 37}{space 1}  -89.51{col 46}{space 3}0.000{col 54}{space 4}-.1736422{col 67}{space 3}-.1653073
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.1463413{col 26}{space 2} .0013909{col 37}{space 1} -105.22{col 46}{space 3}0.000{col 54}{space 4}-.1494026{col 67}{space 3}  -.14328
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .1105415{col 26}{space 2} .0019615{col 37}{space 1}   56.36{col 46}{space 3}0.000{col 54}{space 4} .1062243{col 67}{space 3} .1148586
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0300194{col 26}{space 2} .0024319{col 37}{space 1}   12.34{col 46}{space 3}0.000{col 54}{space 4} .0246668{col 67}{space 3} .0353721
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} -.001438{col 26}{space 2} .0018854{col 37}{space 1}   -0.76{col 46}{space 3}0.462{col 54}{space 4}-.0055878{col 67}{space 3} .0027118
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .3107598{col 26}{space 2} .0102773{col 37}{space 1}   30.24{col 46}{space 3}0.000{col 54}{space 4} .2881395{col 67}{space 3}   .33338
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1647858{col 26}{space 2} .0200026{col 37}{space 1}   -8.24{col 46}{space 3}0.000{col 54}{space 4}-.2088112{col 67}{space 3}-.1207604
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} .1380988{col 26}{space 2} 1.252222{col 37}{space 1}    0.11{col 46}{space 3}0.914{col 54}{space 4}-2.618023{col 67}{space 3}  2.89422
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.1724347{col 26}{space 2} 1.421618{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-3.301394{col 67}{space 3} 2.956525
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .1113657{col 26}{space 2} 1.059777{col 37}{space 1}    0.11{col 46}{space 3}0.918{col 54}{space 4}-2.221188{col 67}{space 3} 2.443919
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 1.262792{col 26}{space 2} 1.281939{col 37}{space 1}    0.99{col 46}{space 3}0.346{col 54}{space 4}-1.558737{col 67}{space 3} 4.084322
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.881065{col 26}{space 2}  1.07249{col 37}{space 1}   -1.75{col 46}{space 3}0.107{col 54}{space 4}-4.241601{col 67}{space 3} .4794701
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-1.173944{col 26}{space 2} 1.449813{col 37}{space 1}   -0.81{col 46}{space 3}0.435{col 54}{space 4}-4.364961{col 67}{space 3} 2.017073
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 2.304964{col 26}{space 2} .6588553{col 37}{space 1}    3.50{col 46}{space 3}0.005{col 54}{space 4} .8548334{col 67}{space 3} 3.755095
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-2.442807{col 26}{space 2} .8750168{col 37}{space 1}   -2.79{col 46}{space 3}0.018{col 54}{space 4}-4.368706{col 67}{space 3}-.5169083
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-1.250361{col 26}{space 2}   1.1593{col 37}{space 1}   -1.08{col 46}{space 3}0.304{col 54}{space 4}-3.801963{col 67}{space 3} 1.301241
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.7634141{col 26}{space 2} .9345046{col 37}{space 1}   -0.82{col 46}{space 3}0.431{col 54}{space 4}-2.820245{col 67}{space 3} 1.293417
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1699088{col 26}{space 2} .0094448{col 37}{space 1}   17.99{col 46}{space 3}0.000{col 54}{space 4}  .149121{col 67}{space 3} .1906966
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m5: reg ks4 ib9.MoB PGS male PC*, robust cluster(MoB) 

{txt}Linear regression                               Number of obs     = {res}     7,268
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0352
                                                {txt}Root MSE          =    {res}  .9899

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .0490359{col 26}{space 2} .0017914{col 37}{space 1}   27.37{col 46}{space 3}0.000{col 54}{space 4} .0450931{col 67}{space 3} .0529788
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.0924774{col 26}{space 2} .0015833{col 37}{space 1}  -58.41{col 46}{space 3}0.000{col 54}{space 4}-.0959622{col 67}{space 3}-.0889927
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.1495654{col 26}{space 2} .0010767{col 37}{space 1} -138.91{col 46}{space 3}0.000{col 54}{space 4}-.1519352{col 67}{space 3}-.1471956
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.0857911{col 26}{space 2} .0019379{col 37}{space 1}  -44.27{col 46}{space 3}0.000{col 54}{space 4}-.0900563{col 67}{space 3}-.0815259
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0118994{col 26}{space 2} .0020109{col 37}{space 1}    5.92{col 46}{space 3}0.000{col 54}{space 4} .0074734{col 67}{space 3} .0163253
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0872825{col 26}{space 2} .0024856{col 37}{space 1}  -35.12{col 46}{space 3}0.000{col 54}{space 4}-.0927533{col 67}{space 3}-.0818118
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.1172004{col 26}{space 2} .0021363{col 37}{space 1}  -54.86{col 46}{space 3}0.000{col 54}{space 4}-.1219024{col 67}{space 3}-.1124985
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.129727{col 26}{space 2}  .002071{col 37}{space 1}  -62.64{col 46}{space 3}0.000{col 54}{space 4}-.1342854{col 67}{space 3}-.1251687
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .0631135{col 26}{space 2} .0018804{col 37}{space 1}   33.56{col 46}{space 3}0.000{col 54}{space 4} .0589748{col 67}{space 3} .0672522
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0383019{col 26}{space 2} .0017935{col 37}{space 1}   21.36{col 46}{space 3}0.000{col 54}{space 4} .0343545{col 67}{space 3} .0422493
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0027528{col 26}{space 2} .0015115{col 37}{space 1}    1.82{col 46}{space 3}0.096{col 54}{space 4}-.0005739{col 67}{space 3} .0060796
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .1205753{col 26}{space 2} .0121965{col 37}{space 1}    9.89{col 46}{space 3}0.000{col 54}{space 4}  .093731{col 67}{space 3} .1474196
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.2412638{col 26}{space 2} .0295827{col 37}{space 1}   -8.16{col 46}{space 3}0.000{col 54}{space 4}-.3063748{col 67}{space 3}-.1761528
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-1.238235{col 26}{space 2}  1.18782{col 37}{space 1}   -1.04{col 46}{space 3}0.320{col 54}{space 4}-3.852609{col 67}{space 3} 1.376139
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} -1.36638{col 26}{space 2} .9914883{col 37}{space 1}   -1.38{col 46}{space 3}0.196{col 54}{space 4}-3.548631{col 67}{space 3}  .815871
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .3864803{col 26}{space 2} .8875552{col 37}{space 1}    0.44{col 46}{space 3}0.672{col 54}{space 4}-1.567015{col 67}{space 3} 2.339976
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 2.209365{col 26}{space 2} 1.166592{col 37}{space 1}    1.89{col 46}{space 3}0.085{col 54}{space 4}-.3582879{col 67}{space 3} 4.777017
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-.4051598{col 26}{space 2} .7481652{col 37}{space 1}   -0.54{col 46}{space 3}0.599{col 54}{space 4} -2.05186{col 67}{space 3} 1.241541
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-2.147713{col 26}{space 2} 1.131331{col 37}{space 1}   -1.90{col 46}{space 3}0.084{col 54}{space 4}-4.637757{col 67}{space 3} .3423302
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} .8814751{col 26}{space 2} 1.170611{col 37}{space 1}    0.75{col 46}{space 3}0.467{col 54}{space 4}-1.695022{col 67}{space 3} 3.457972
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.8661576{col 26}{space 2}  .840499{col 37}{space 1}   -1.03{col 46}{space 3}0.325{col 54}{space 4}-2.716084{col 67}{space 3} .9837683
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-.5537863{col 26}{space 2} .8041131{col 37}{space 1}   -0.69{col 46}{space 3}0.505{col 54}{space 4}-2.323627{col 67}{space 3} 1.216055
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.3202518{col 26}{space 2} .6618884{col 37}{space 1}   -0.48{col 46}{space 3}0.638{col 54}{space 4}-1.777058{col 67}{space 3} 1.136555
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1785379{col 26}{space 2} .0153708{col 37}{space 1}   11.62{col 46}{space 3}0.000{col 54}{space 4}  .144707{col 67}{space 3} .2123688
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab  m1 m2 m3 m4 m5, b se keep(*.MoB PGS) star(* 0.10 ** 0.05 *** 0.01) stats(N, fmt(0))
{res}
{txt}{hline 92}
{txt}                      (1)             (2)             (3)             (4)             (5)   
{txt}                       ea             ks1             ks2             ks3             ks4   
{txt}{hline 92}
{txt}1.MoB       {res}       -0.207***       -0.186***      -0.0380***      0.00533**        0.0490***{txt}
            {res} {ralign 12:{txt:(}0.00549{txt:)}}    {ralign 12:{txt:(}0.00308{txt:)}}    {ralign 12:{txt:(}0.00290{txt:)}}    {ralign 12:{txt:(}0.00238{txt:)}}    {ralign 12:{txt:(}0.00179{txt:)}}   {txt}

{txt}2.MoB       {res}       -0.575***       -0.317***       -0.235***       -0.120***      -0.0925***{txt}
            {res} {ralign 12:{txt:(}0.00619{txt:)}}    {ralign 12:{txt:(}0.00262{txt:)}}    {ralign 12:{txt:(}0.000743{txt:)}}    {ralign 12:{txt:(}0.00293{txt:)}}    {ralign 12:{txt:(}0.00158{txt:)}}   {txt}

{txt}3.MoB       {res}       -0.611***       -0.382***       -0.208***      -0.0640***       -0.150***{txt}
            {res} {ralign 12:{txt:(}0.00858{txt:)}}    {ralign 12:{txt:(}0.00204{txt:)}}    {ralign 12:{txt:(}0.00182{txt:)}}    {ralign 12:{txt:(}0.00217{txt:)}}    {ralign 12:{txt:(}0.00108{txt:)}}   {txt}

{txt}4.MoB       {res}       -0.445***       -0.349***       -0.133***       -0.115***      -0.0858***{txt}
            {res} {ralign 12:{txt:(}0.00864{txt:)}}    {ralign 12:{txt:(}0.00106{txt:)}}    {ralign 12:{txt:(}0.00196{txt:)}}    {ralign 12:{txt:(}0.00203{txt:)}}    {ralign 12:{txt:(}0.00194{txt:)}}   {txt}

{txt}5.MoB       {res}       -0.743***       -0.460***       -0.157***      -0.0746***       0.0119***{txt}
            {res} {ralign 12:{txt:(}0.00577{txt:)}}    {ralign 12:{txt:(}0.00214{txt:)}}    {ralign 12:{txt:(}0.00282{txt:)}}    {ralign 12:{txt:(}0.00252{txt:)}}    {ralign 12:{txt:(}0.00201{txt:)}}   {txt}

{txt}6.MoB       {res}       -0.681***       -0.462***       -0.103***      -0.0847***      -0.0873***{txt}
            {res} {ralign 12:{txt:(}0.00585{txt:)}}    {ralign 12:{txt:(}0.00241{txt:)}}    {ralign 12:{txt:(}0.00195{txt:)}}    {ralign 12:{txt:(}0.00179{txt:)}}    {ralign 12:{txt:(}0.00249{txt:)}}   {txt}

{txt}7.MoB       {res}       -1.003***       -0.522***       -0.242***       -0.169***       -0.117***{txt}
            {res} {ralign 12:{txt:(}0.00683{txt:)}}    {ralign 12:{txt:(}0.00171{txt:)}}    {ralign 12:{txt:(}0.00293{txt:)}}    {ralign 12:{txt:(}0.00189{txt:)}}    {ralign 12:{txt:(}0.00214{txt:)}}   {txt}

{txt}8.MoB       {res}       -0.972***       -0.654***       -0.302***       -0.146***       -0.130***{txt}
            {res} {ralign 12:{txt:(}0.00833{txt:)}}    {ralign 12:{txt:(}0.00220{txt:)}}    {ralign 12:{txt:(}0.00285{txt:)}}    {ralign 12:{txt:(}0.00139{txt:)}}    {ralign 12:{txt:(}0.00207{txt:)}}   {txt}

{txt}9.MoB       {res}            0               0               0               0               0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}10.MoB      {res}       -0.141***      -0.0363***       0.0246***        0.111***       0.0631***{txt}
            {res} {ralign 12:{txt:(}0.00519{txt:)}}    {ralign 12:{txt:(}0.00134{txt:)}}    {ralign 12:{txt:(}0.00162{txt:)}}    {ralign 12:{txt:(}0.00196{txt:)}}    {ralign 12:{txt:(}0.00188{txt:)}}   {txt}

{txt}11.MoB      {res}       -0.168***      -0.0452***       0.0221***       0.0300***       0.0383***{txt}
            {res} {ralign 12:{txt:(}0.00760{txt:)}}    {ralign 12:{txt:(}0.00152{txt:)}}    {ralign 12:{txt:(}0.00180{txt:)}}    {ralign 12:{txt:(}0.00243{txt:)}}    {ralign 12:{txt:(}0.00179{txt:)}}   {txt}

{txt}12.MoB      {res}       -0.310***      -0.0695***      -0.0417***     -0.00144         0.00275*  {txt}
            {res} {ralign 12:{txt:(}0.00424{txt:)}}    {ralign 12:{txt:(}0.00176{txt:)}}    {ralign 12:{txt:(}0.00274{txt:)}}    {ralign 12:{txt:(}0.00189{txt:)}}    {ralign 12:{txt:(}0.00151{txt:)}}   {txt}

{txt}PGS         {res}        0.135***        0.244***        0.309***        0.311***        0.121***{txt}
            {res} {ralign 12:{txt:(}0.0259{txt:)}}    {ralign 12:{txt:(}0.00892{txt:)}}    {ralign 12:{txt:(}0.0118{txt:)}}    {ralign 12:{txt:(}0.0103{txt:)}}    {ralign 12:{txt:(}0.0122{txt:)}}   {txt}
{txt}{hline 92}
{txt}N           {res}         1826            5734            6075            5240            7268   {txt}
{txt}{hline 92}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. *esttab         m1 m2 m3 m4 m5 using "${c -(}dirtables{c )-}/MoB_OLS.tex", replace ///
>         frag bookt b(3) se(3) keep(*.MoB PGS) drop(9.MoB) star(* 0.10 ** 0.05 *** 0.01) ///
>         mtitles("Age 4" "Age 7" "Age 11" "Age 14" "Age 16") ///
>         stats(r2 N, label("R2" "Observations") fmt(3 0)) nonotes coeflabel(1.MoB "Jan" 2.MoB "Feb" 3.MoB "Mar" 4.MoB "Apr" 5.MoB "May" 6.MoB "Jun" 7.MoB "Jul" 8.MoB "Aug" 9.MoB "Sep" 10.MoB "Oct" 11.MoB "Nov" 12.MoB "Dec" PGS "PGS") 
. 
. 
. eststo  m1: reg ea  ib1.MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     1,826
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1866
                                                {txt}Root MSE          =    {res} .89719

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          ea{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2}-.1412398{col 26}{space 2} .0051869{col 37}{space 1}  -27.23{col 46}{space 3}0.000{col 54}{space 4}-.1526562{col 67}{space 3}-.1298235
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}-.1684965{col 26}{space 2} .0076001{col 37}{space 1}  -22.17{col 46}{space 3}0.000{col 54}{space 4}-.1852242{col 67}{space 3}-.1517688
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.3103599{col 26}{space 2} .0042404{col 37}{space 1}  -73.19{col 46}{space 3}0.000{col 54}{space 4}-.3196929{col 67}{space 3}-.3010269
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}-.2072028{col 26}{space 2} .0054888{col 37}{space 1}  -37.75{col 46}{space 3}0.000{col 54}{space 4}-.2192835{col 67}{space 3}-.1951221
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.5747052{col 26}{space 2} .0061919{col 37}{space 1}  -92.82{col 46}{space 3}0.000{col 54}{space 4}-.5883335{col 67}{space 3}-.5610769
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.6114168{col 26}{space 2} .0085835{col 37}{space 1}  -71.23{col 46}{space 3}0.000{col 54}{space 4}-.6303089{col 67}{space 3}-.5925248
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.4451914{col 26}{space 2} .0086393{col 37}{space 1}  -51.53{col 46}{space 3}0.000{col 54}{space 4}-.4642065{col 67}{space 3}-.4261763
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.7430479{col 26}{space 2} .0057667{col 37}{space 1} -128.85{col 46}{space 3}0.000{col 54}{space 4}-.7557402{col 67}{space 3}-.7303555
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} -.680788{col 26}{space 2} .0058515{col 37}{space 1} -116.34{col 46}{space 3}0.000{col 54}{space 4}-.6936672{col 67}{space 3}-.6679089
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-1.002926{col 26}{space 2} .0068314{col 37}{space 1} -146.81{col 46}{space 3}0.000{col 54}{space 4}-1.017961{col 67}{space 3}-.9878896
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.9721355{col 26}{space 2}  .008325{col 37}{space 1} -116.77{col 46}{space 3}0.000{col 54}{space 4}-.9904587{col 67}{space 3}-.9538123
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .1354025{col 26}{space 2} .0258778{col 37}{space 1}    5.23{col 46}{space 3}0.000{col 54}{space 4} .0784459{col 67}{space 3}  .192359
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3882236{col 26}{space 2} .0298276{col 37}{space 1}  -13.02{col 46}{space 3}0.000{col 54}{space 4}-.4538736{col 67}{space 3}-.3225736
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-3.798066{col 26}{space 2} 1.607382{col 37}{space 1}   -2.36{col 46}{space 3}0.038{col 54}{space 4} -7.33589{col 67}{space 3}-.2602425
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} 3.392759{col 26}{space 2} 2.373157{col 37}{space 1}    1.43{col 46}{space 3}0.181{col 54}{space 4}-1.830525{col 67}{space 3} 8.616042
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}  .539355{col 26}{space 2} 1.524538{col 37}{space 1}    0.35{col 46}{space 3}0.730{col 54}{space 4} -2.81613{col 67}{space 3}  3.89484
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} -1.80441{col 26}{space 2} 1.864727{col 37}{space 1}   -0.97{col 46}{space 3}0.354{col 54}{space 4}-5.908646{col 67}{space 3} 2.299827
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-.8361552{col 26}{space 2}  2.66426{col 37}{space 1}   -0.31{col 46}{space 3}0.760{col 54}{space 4}-6.700152{col 67}{space 3} 5.027841
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2} 1.345765{col 26}{space 2}  1.60591{col 37}{space 1}    0.84{col 46}{space 3}0.420{col 54}{space 4}-2.188819{col 67}{space 3} 4.880348
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.036981{col 26}{space 2}  2.03639{col 37}{space 1}    0.51{col 46}{space 3}0.621{col 54}{space 4}-3.445082{col 67}{space 3} 5.519045
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-2.798752{col 26}{space 2} 1.307165{col 37}{space 1}   -2.14{col 46}{space 3}0.056{col 54}{space 4}-5.675802{col 67}{space 3} .0782974
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-1.817065{col 26}{space 2} 1.944461{col 37}{space 1}   -0.93{col 46}{space 3}0.370{col 54}{space 4}-6.096794{col 67}{space 3} 2.462664
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.8382145{col 26}{space 2} 1.928842{col 37}{space 1}   -0.43{col 46}{space 3}0.672{col 54}{space 4}-5.083567{col 67}{space 3} 3.407138
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .737499{col 26}{space 2}  .014135{col 37}{space 1}   52.18{col 46}{space 3}0.000{col 54}{space 4}  .706388{col 67}{space 3}   .76861
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m2: reg ks1 ib1.MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,734
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1379
                                                {txt}Root MSE          =    {res} .91376

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2}-.0363438{col 26}{space 2}  .001343{col 37}{space 1}  -27.06{col 46}{space 3}0.000{col 54}{space 4}-.0392997{col 67}{space 3}-.0333878
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}-.0451925{col 26}{space 2} .0015218{col 37}{space 1}  -29.70{col 46}{space 3}0.000{col 54}{space 4}-.0485418{col 67}{space 3}-.0418431
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0695002{col 26}{space 2} .0017605{col 37}{space 1}  -39.48{col 46}{space 3}0.000{col 54}{space 4} -.073375{col 67}{space 3}-.0656254
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}  -.18571{col 26}{space 2} .0030785{col 37}{space 1}  -60.32{col 46}{space 3}0.000{col 54}{space 4}-.1924857{col 67}{space 3}-.1789343
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.3170556{col 26}{space 2} .0026244{col 37}{space 1} -120.81{col 46}{space 3}0.000{col 54}{space 4}-.3228319{col 67}{space 3}-.3112792
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.3819824{col 26}{space 2} .0020377{col 37}{space 1} -187.46{col 46}{space 3}0.000{col 54}{space 4}-.3864673{col 67}{space 3}-.3774975
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.3491325{col 26}{space 2} .0010649{col 37}{space 1} -327.87{col 46}{space 3}0.000{col 54}{space 4}-.3514762{col 67}{space 3}-.3467887
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.4604687{col 26}{space 2} .0021401{col 37}{space 1} -215.16{col 46}{space 3}0.000{col 54}{space 4}-.4651791{col 67}{space 3}-.4557584
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.4621673{col 26}{space 2} .0024129{col 37}{space 1} -191.54{col 46}{space 3}0.000{col 54}{space 4} -.467478{col 67}{space 3}-.4568567
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.5224579{col 26}{space 2} .0017101{col 37}{space 1} -305.51{col 46}{space 3}0.000{col 54}{space 4}-.5262218{col 67}{space 3} -.518694
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.654396{col 26}{space 2}  .002204{col 37}{space 1} -296.91{col 46}{space 3}0.000{col 54}{space 4} -.659247{col 67}{space 3}-.6495449
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .2442087{col 26}{space 2}  .008919{col 37}{space 1}   27.38{col 46}{space 3}0.000{col 54}{space 4} .2245781{col 67}{space 3} .2638394
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3054633{col 26}{space 2} .0215027{col 37}{space 1}  -14.21{col 46}{space 3}0.000{col 54}{space 4}-.3527903{col 67}{space 3}-.2581362
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} -1.28599{col 26}{space 2}  1.18378{col 37}{space 1}   -1.09{col 46}{space 3}0.301{col 54}{space 4}-3.891473{col 67}{space 3} 1.319493
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.6615521{col 26}{space 2}  .748159{col 37}{space 1}   -0.88{col 46}{space 3}0.395{col 54}{space 4}-2.308239{col 67}{space 3} .9851346
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}-1.095729{col 26}{space 2} .4844826{col 37}{space 1}   -2.26{col 46}{space 3}0.045{col 54}{space 4}-2.162068{col 67}{space 3}-.0293903
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} .9218761{col 26}{space 2} 1.115259{col 37}{space 1}    0.83{col 46}{space 3}0.426{col 54}{space 4}-1.532793{col 67}{space 3} 3.376546
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.211539{col 26}{space 2}   1.0445{col 37}{space 1}   -1.16{col 46}{space 3}0.271{col 54}{space 4}-3.510469{col 67}{space 3}  1.08739
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2} .1199528{col 26}{space 2} 1.103164{col 37}{space 1}    0.11{col 46}{space 3}0.915{col 54}{space 4}-2.308095{col 67}{space 3}    2.548
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.488797{col 26}{space 2}  1.31846{col 37}{space 1}    1.13{col 46}{space 3}0.283{col 54}{space 4}-1.413114{col 67}{space 3} 4.390708
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.6045012{col 26}{space 2} .8572367{col 37}{space 1}   -0.71{col 46}{space 3}0.495{col 54}{space 4}-2.491267{col 67}{space 3} 1.282264
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2} -2.60559{col 26}{space 2} .8768195{col 37}{space 1}   -2.97{col 46}{space 3}0.013{col 54}{space 4}-4.535457{col 67}{space 3}-.6757235
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .1768726{col 26}{space 2} .9359525{col 37}{space 1}    0.19{col 46}{space 3}0.854{col 54}{space 4}-1.883145{col 67}{space 3}  2.23689
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4970185{col 26}{space 2} .0109441{col 37}{space 1}   45.41{col 46}{space 3}0.000{col 54}{space 4} .4729306{col 67}{space 3} .5211064
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m3: reg ks2 ib1.MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     6,075
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1128
                                                {txt}Root MSE          =    {res} .93079

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2}  .024565{col 26}{space 2} .0016222{col 37}{space 1}   15.14{col 46}{space 3}0.000{col 54}{space 4} .0209945{col 67}{space 3} .0281354
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}  .022144{col 26}{space 2} .0017964{col 37}{space 1}   12.33{col 46}{space 3}0.000{col 54}{space 4}   .01819{col 67}{space 3} .0260979
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0416953{col 26}{space 2} .0027426{col 37}{space 1}  -15.20{col 46}{space 3}0.000{col 54}{space 4}-.0477317{col 67}{space 3}-.0356589
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}-.0380031{col 26}{space 2} .0028975{col 37}{space 1}  -13.12{col 46}{space 3}0.000{col 54}{space 4}-.0443804{col 67}{space 3}-.0316259
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} -.235375{col 26}{space 2}  .000743{col 37}{space 1} -316.81{col 46}{space 3}0.000{col 54}{space 4}-.2370102{col 67}{space 3}-.2337397
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.2080839{col 26}{space 2}  .001816{col 37}{space 1} -114.58{col 46}{space 3}0.000{col 54}{space 4}-.2120809{col 67}{space 3}-.2040869
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.1327026{col 26}{space 2} .0019593{col 37}{space 1}  -67.73{col 46}{space 3}0.000{col 54}{space 4} -.137015{col 67}{space 3}-.1283902
{txt}{space 8}May  {c |}{col 14}{res}{space 2} -.156657{col 26}{space 2} .0028207{col 37}{space 1}  -55.54{col 46}{space 3}0.000{col 54}{space 4}-.1628653{col 67}{space 3}-.1504487
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.1028139{col 26}{space 2} .0019467{col 37}{space 1}  -52.81{col 46}{space 3}0.000{col 54}{space 4}-.1070987{col 67}{space 3}-.0985292
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.2418209{col 26}{space 2} .0029309{col 37}{space 1}  -82.51{col 46}{space 3}0.000{col 54}{space 4}-.2482719{col 67}{space 3}  -.23537
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.301657{col 26}{space 2} .0028528{col 37}{space 1} -105.74{col 46}{space 3}0.000{col 54}{space 4}-.3079359{col 67}{space 3}-.2953781
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .3086516{col 26}{space 2} .0117932{col 37}{space 1}   26.17{col 46}{space 3}0.000{col 54}{space 4}  .282695{col 67}{space 3} .3346082
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1197716{col 26}{space 2} .0225081{col 37}{space 1}   -5.32{col 46}{space 3}0.000{col 54}{space 4}-.1693116{col 67}{space 3}-.0702316
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-.6501818{col 26}{space 2} .9175074{col 37}{space 1}   -0.71{col 46}{space 3}0.493{col 54}{space 4}-2.669602{col 67}{space 3} 1.369238
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} .9882684{col 26}{space 2} .8565832{col 37}{space 1}    1.15{col 46}{space 3}0.273{col 54}{space 4}-.8970585{col 67}{space 3} 2.873595
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}-.0689867{col 26}{space 2} .7410717{col 37}{space 1}   -0.09{col 46}{space 3}0.928{col 54}{space 4}-1.700074{col 67}{space 3} 1.562101
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 2.351226{col 26}{space 2} 1.195063{col 37}{space 1}    1.97{col 46}{space 3}0.075{col 54}{space 4}-.2790892{col 67}{space 3} 4.981542
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.364756{col 26}{space 2}  1.15769{col 37}{space 1}   -1.18{col 46}{space 3}0.263{col 54}{space 4}-3.912815{col 67}{space 3} 1.183303
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-.4907964{col 26}{space 2} 1.054427{col 37}{space 1}   -0.47{col 46}{space 3}0.651{col 54}{space 4}-2.811575{col 67}{space 3} 1.829982
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.246615{col 26}{space 2} 1.110541{col 37}{space 1}    1.12{col 46}{space 3}0.286{col 54}{space 4}-1.197669{col 67}{space 3} 3.690898
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-1.487752{col 26}{space 2} 1.107962{col 37}{space 1}   -1.34{col 46}{space 3}0.206{col 54}{space 4}-3.926361{col 67}{space 3} .9508566
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}  -2.2083{col 26}{space 2} 1.415423{col 37}{space 1}   -1.56{col 46}{space 3}0.147{col 54}{space 4}-5.323625{col 67}{space 3} .9070248
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .3578649{col 26}{space 2} .8891235{col 37}{space 1}    0.40{col 46}{space 3}0.695{col 54}{space 4}-1.599083{col 67}{space 3} 2.314813
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2067718{col 26}{space 2} .0113275{col 37}{space 1}   18.25{col 46}{space 3}0.000{col 54}{space 4} .1818401{col 67}{space 3} .2317035
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m4: reg ks3 ib1.MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,240
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1101
                                                {txt}Root MSE          =    {res} .94189

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2} .1105415{col 26}{space 2} .0019615{col 37}{space 1}   56.36{col 46}{space 3}0.000{col 54}{space 4} .1062243{col 67}{space 3} .1148586
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0300194{col 26}{space 2} .0024319{col 37}{space 1}   12.34{col 46}{space 3}0.000{col 54}{space 4} .0246668{col 67}{space 3} .0353721
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} -.001438{col 26}{space 2} .0018854{col 37}{space 1}   -0.76{col 46}{space 3}0.462{col 54}{space 4}-.0055878{col 67}{space 3} .0027118
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2} .0053307{col 26}{space 2} .0023776{col 37}{space 1}    2.24{col 46}{space 3}0.047{col 54}{space 4} .0000976{col 67}{space 3} .0105638
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.1199532{col 26}{space 2} .0029252{col 37}{space 1}  -41.01{col 46}{space 3}0.000{col 54}{space 4}-.1263914{col 67}{space 3}-.1135149
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.0640077{col 26}{space 2} .0021747{col 37}{space 1}  -29.43{col 46}{space 3}0.000{col 54}{space 4}-.0687941{col 67}{space 3}-.0592212
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.1151996{col 26}{space 2} .0020303{col 37}{space 1}  -56.74{col 46}{space 3}0.000{col 54}{space 4}-.1196683{col 67}{space 3} -.110731
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.0745865{col 26}{space 2} .0025234{col 37}{space 1}  -29.56{col 46}{space 3}0.000{col 54}{space 4}-.0801404{col 67}{space 3}-.0690326
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0847456{col 26}{space 2} .0017905{col 37}{space 1}  -47.33{col 46}{space 3}0.000{col 54}{space 4}-.0886865{col 67}{space 3}-.0808048
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.1694747{col 26}{space 2} .0018934{col 37}{space 1}  -89.51{col 46}{space 3}0.000{col 54}{space 4}-.1736422{col 67}{space 3}-.1653073
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.1463413{col 26}{space 2} .0013909{col 37}{space 1} -105.22{col 46}{space 3}0.000{col 54}{space 4}-.1494026{col 67}{space 3}  -.14328
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .3107598{col 26}{space 2} .0102773{col 37}{space 1}   30.24{col 46}{space 3}0.000{col 54}{space 4} .2881395{col 67}{space 3}   .33338
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1647858{col 26}{space 2} .0200026{col 37}{space 1}   -8.24{col 46}{space 3}0.000{col 54}{space 4}-.2088112{col 67}{space 3}-.1207604
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} .1380988{col 26}{space 2} 1.252222{col 37}{space 1}    0.11{col 46}{space 3}0.914{col 54}{space 4}-2.618023{col 67}{space 3}  2.89422
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.1724347{col 26}{space 2} 1.421618{col 37}{space 1}   -0.12{col 46}{space 3}0.906{col 54}{space 4}-3.301394{col 67}{space 3} 2.956525
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .1113657{col 26}{space 2} 1.059777{col 37}{space 1}    0.11{col 46}{space 3}0.918{col 54}{space 4}-2.221188{col 67}{space 3} 2.443919
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 1.262792{col 26}{space 2} 1.281939{col 37}{space 1}    0.99{col 46}{space 3}0.346{col 54}{space 4}-1.558737{col 67}{space 3} 4.084322
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.881065{col 26}{space 2}  1.07249{col 37}{space 1}   -1.75{col 46}{space 3}0.107{col 54}{space 4}-4.241601{col 67}{space 3} .4794701
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-1.173944{col 26}{space 2} 1.449813{col 37}{space 1}   -0.81{col 46}{space 3}0.435{col 54}{space 4}-4.364961{col 67}{space 3} 2.017073
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 2.304964{col 26}{space 2} .6588553{col 37}{space 1}    3.50{col 46}{space 3}0.005{col 54}{space 4} .8548334{col 67}{space 3} 3.755095
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-2.442807{col 26}{space 2} .8750168{col 37}{space 1}   -2.79{col 46}{space 3}0.018{col 54}{space 4}-4.368706{col 67}{space 3}-.5169083
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-1.250361{col 26}{space 2}   1.1593{col 37}{space 1}   -1.08{col 46}{space 3}0.304{col 54}{space 4}-3.801963{col 67}{space 3} 1.301241
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.7634141{col 26}{space 2} .9345046{col 37}{space 1}   -0.82{col 46}{space 3}0.431{col 54}{space 4}-2.820245{col 67}{space 3} 1.293417
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1699088{col 26}{space 2} .0094448{col 37}{space 1}   17.99{col 46}{space 3}0.000{col 54}{space 4}  .149121{col 67}{space 3} .1906966
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m5: reg ks4 ib1.MoBnew PGS male PC*, robust cluster(MoB) 

{txt}Linear regression                               Number of obs     = {res}     7,268
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0352
                                                {txt}Root MSE          =    {res}  .9899

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2} .0631135{col 26}{space 2} .0018804{col 37}{space 1}   33.56{col 46}{space 3}0.000{col 54}{space 4} .0589748{col 67}{space 3} .0672522
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0383019{col 26}{space 2} .0017935{col 37}{space 1}   21.36{col 46}{space 3}0.000{col 54}{space 4} .0343545{col 67}{space 3} .0422493
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0027528{col 26}{space 2} .0015115{col 37}{space 1}    1.82{col 46}{space 3}0.096{col 54}{space 4}-.0005739{col 67}{space 3} .0060796
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2} .0490359{col 26}{space 2} .0017914{col 37}{space 1}   27.37{col 46}{space 3}0.000{col 54}{space 4} .0450931{col 67}{space 3} .0529788
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.0924774{col 26}{space 2} .0015833{col 37}{space 1}  -58.41{col 46}{space 3}0.000{col 54}{space 4}-.0959622{col 67}{space 3}-.0889927
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.1495654{col 26}{space 2} .0010767{col 37}{space 1} -138.91{col 46}{space 3}0.000{col 54}{space 4}-.1519352{col 67}{space 3}-.1471956
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.0857911{col 26}{space 2} .0019379{col 37}{space 1}  -44.27{col 46}{space 3}0.000{col 54}{space 4}-.0900563{col 67}{space 3}-.0815259
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0118994{col 26}{space 2} .0020109{col 37}{space 1}    5.92{col 46}{space 3}0.000{col 54}{space 4} .0074734{col 67}{space 3} .0163253
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0872825{col 26}{space 2} .0024856{col 37}{space 1}  -35.12{col 46}{space 3}0.000{col 54}{space 4}-.0927533{col 67}{space 3}-.0818118
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.1172004{col 26}{space 2} .0021363{col 37}{space 1}  -54.86{col 46}{space 3}0.000{col 54}{space 4}-.1219024{col 67}{space 3}-.1124985
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.129727{col 26}{space 2}  .002071{col 37}{space 1}  -62.64{col 46}{space 3}0.000{col 54}{space 4}-.1342854{col 67}{space 3}-.1251687
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .1205753{col 26}{space 2} .0121965{col 37}{space 1}    9.89{col 46}{space 3}0.000{col 54}{space 4}  .093731{col 67}{space 3} .1474196
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.2412638{col 26}{space 2} .0295827{col 37}{space 1}   -8.16{col 46}{space 3}0.000{col 54}{space 4}-.3063748{col 67}{space 3}-.1761528
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-1.238235{col 26}{space 2}  1.18782{col 37}{space 1}   -1.04{col 46}{space 3}0.320{col 54}{space 4}-3.852609{col 67}{space 3} 1.376139
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} -1.36638{col 26}{space 2} .9914883{col 37}{space 1}   -1.38{col 46}{space 3}0.196{col 54}{space 4}-3.548631{col 67}{space 3}  .815871
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .3864803{col 26}{space 2} .8875552{col 37}{space 1}    0.44{col 46}{space 3}0.672{col 54}{space 4}-1.567015{col 67}{space 3} 2.339976
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 2.209365{col 26}{space 2} 1.166592{col 37}{space 1}    1.89{col 46}{space 3}0.085{col 54}{space 4}-.3582879{col 67}{space 3} 4.777017
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-.4051598{col 26}{space 2} .7481652{col 37}{space 1}   -0.54{col 46}{space 3}0.599{col 54}{space 4} -2.05186{col 67}{space 3} 1.241541
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-2.147713{col 26}{space 2} 1.131331{col 37}{space 1}   -1.90{col 46}{space 3}0.084{col 54}{space 4}-4.637757{col 67}{space 3} .3423302
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} .8814751{col 26}{space 2} 1.170611{col 37}{space 1}    0.75{col 46}{space 3}0.467{col 54}{space 4}-1.695022{col 67}{space 3} 3.457972
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.8661576{col 26}{space 2}  .840499{col 37}{space 1}   -1.03{col 46}{space 3}0.325{col 54}{space 4}-2.716084{col 67}{space 3} .9837683
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-.5537863{col 26}{space 2} .8041131{col 37}{space 1}   -0.69{col 46}{space 3}0.505{col 54}{space 4}-2.323627{col 67}{space 3} 1.216055
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.3202518{col 26}{space 2} .6618884{col 37}{space 1}   -0.48{col 46}{space 3}0.638{col 54}{space 4}-1.777058{col 67}{space 3} 1.136555
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1785379{col 26}{space 2} .0153708{col 37}{space 1}   11.62{col 46}{space 3}0.000{col 54}{space 4}  .144707{col 67}{space 3} .2123688
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab  m1 m2 m3 m4 m5, b se keep(*.MoBnew PGS) star(* 0.10 ** 0.05 *** 0.01) stats(N, fmt(0))
{res}
{txt}{hline 92}
{txt}                      (1)             (2)             (3)             (4)             (5)   
{txt}                       ea             ks1             ks2             ks3             ks4   
{txt}{hline 92}
{txt}1.MoBnew    {res}            0               0               0               0               0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.MoBnew    {res}       -0.141***      -0.0363***       0.0246***        0.111***       0.0631***{txt}
            {res} {ralign 12:{txt:(}0.00519{txt:)}}    {ralign 12:{txt:(}0.00134{txt:)}}    {ralign 12:{txt:(}0.00162{txt:)}}    {ralign 12:{txt:(}0.00196{txt:)}}    {ralign 12:{txt:(}0.00188{txt:)}}   {txt}

{txt}3.MoBnew    {res}       -0.168***      -0.0452***       0.0221***       0.0300***       0.0383***{txt}
            {res} {ralign 12:{txt:(}0.00760{txt:)}}    {ralign 12:{txt:(}0.00152{txt:)}}    {ralign 12:{txt:(}0.00180{txt:)}}    {ralign 12:{txt:(}0.00243{txt:)}}    {ralign 12:{txt:(}0.00179{txt:)}}   {txt}

{txt}4.MoBnew    {res}       -0.310***      -0.0695***      -0.0417***     -0.00144         0.00275*  {txt}
            {res} {ralign 12:{txt:(}0.00424{txt:)}}    {ralign 12:{txt:(}0.00176{txt:)}}    {ralign 12:{txt:(}0.00274{txt:)}}    {ralign 12:{txt:(}0.00189{txt:)}}    {ralign 12:{txt:(}0.00151{txt:)}}   {txt}

{txt}5.MoBnew    {res}       -0.207***       -0.186***      -0.0380***      0.00533**        0.0490***{txt}
            {res} {ralign 12:{txt:(}0.00549{txt:)}}    {ralign 12:{txt:(}0.00308{txt:)}}    {ralign 12:{txt:(}0.00290{txt:)}}    {ralign 12:{txt:(}0.00238{txt:)}}    {ralign 12:{txt:(}0.00179{txt:)}}   {txt}

{txt}6.MoBnew    {res}       -0.575***       -0.317***       -0.235***       -0.120***      -0.0925***{txt}
            {res} {ralign 12:{txt:(}0.00619{txt:)}}    {ralign 12:{txt:(}0.00262{txt:)}}    {ralign 12:{txt:(}0.000743{txt:)}}    {ralign 12:{txt:(}0.00293{txt:)}}    {ralign 12:{txt:(}0.00158{txt:)}}   {txt}

{txt}7.MoBnew    {res}       -0.611***       -0.382***       -0.208***      -0.0640***       -0.150***{txt}
            {res} {ralign 12:{txt:(}0.00858{txt:)}}    {ralign 12:{txt:(}0.00204{txt:)}}    {ralign 12:{txt:(}0.00182{txt:)}}    {ralign 12:{txt:(}0.00217{txt:)}}    {ralign 12:{txt:(}0.00108{txt:)}}   {txt}

{txt}8.MoBnew    {res}       -0.445***       -0.349***       -0.133***       -0.115***      -0.0858***{txt}
            {res} {ralign 12:{txt:(}0.00864{txt:)}}    {ralign 12:{txt:(}0.00106{txt:)}}    {ralign 12:{txt:(}0.00196{txt:)}}    {ralign 12:{txt:(}0.00203{txt:)}}    {ralign 12:{txt:(}0.00194{txt:)}}   {txt}

{txt}9.MoBnew    {res}       -0.743***       -0.460***       -0.157***      -0.0746***       0.0119***{txt}
            {res} {ralign 12:{txt:(}0.00577{txt:)}}    {ralign 12:{txt:(}0.00214{txt:)}}    {ralign 12:{txt:(}0.00282{txt:)}}    {ralign 12:{txt:(}0.00252{txt:)}}    {ralign 12:{txt:(}0.00201{txt:)}}   {txt}

{txt}10.MoBnew   {res}       -0.681***       -0.462***       -0.103***      -0.0847***      -0.0873***{txt}
            {res} {ralign 12:{txt:(}0.00585{txt:)}}    {ralign 12:{txt:(}0.00241{txt:)}}    {ralign 12:{txt:(}0.00195{txt:)}}    {ralign 12:{txt:(}0.00179{txt:)}}    {ralign 12:{txt:(}0.00249{txt:)}}   {txt}

{txt}11.MoBnew   {res}       -1.003***       -0.522***       -0.242***       -0.169***       -0.117***{txt}
            {res} {ralign 12:{txt:(}0.00683{txt:)}}    {ralign 12:{txt:(}0.00171{txt:)}}    {ralign 12:{txt:(}0.00293{txt:)}}    {ralign 12:{txt:(}0.00189{txt:)}}    {ralign 12:{txt:(}0.00214{txt:)}}   {txt}

{txt}12.MoBnew   {res}       -0.972***       -0.654***       -0.302***       -0.146***       -0.130***{txt}
            {res} {ralign 12:{txt:(}0.00833{txt:)}}    {ralign 12:{txt:(}0.00220{txt:)}}    {ralign 12:{txt:(}0.00285{txt:)}}    {ralign 12:{txt:(}0.00139{txt:)}}    {ralign 12:{txt:(}0.00207{txt:)}}   {txt}

{txt}PGS         {res}        0.135***        0.244***        0.309***        0.311***        0.121***{txt}
            {res} {ralign 12:{txt:(}0.0259{txt:)}}    {ralign 12:{txt:(}0.00892{txt:)}}    {ralign 12:{txt:(}0.0118{txt:)}}    {ralign 12:{txt:(}0.0103{txt:)}}    {ralign 12:{txt:(}0.0122{txt:)}}   {txt}
{txt}{hline 92}
{txt}N           {res}         1826            5734            6075            5240            7268   {txt}
{txt}{hline 92}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. esttab  m1 m2 m3 m4 m5 using "${c -(}dirtables{c )-}/MoB_OLS.tex", replace ///
>         frag bookt b(3) se(3) keep(*.MoBnew PGS) drop(1.MoBnew) star(* 0.10 ** 0.05 *** 0.01) ///
>         mtitles("Age 4" "Age 7" "Age 11" "Age 14" "Age 16") ///
>         stats(r2 N, label("R2" "Observations") fmt(3 0)) nonotes coeflabel(1.MoBnew "Sep" 2.MoBnew "Oct" 3.MoBnew "Nov" 4.MoBnew "Dec" 5.MoBnew "Jan" 6.MoBnew "Feb" 7.MoBnew "Mar" 8.MoBnew "Apr" 9.MoBnew "May" 10.MoBnew "Jun" 11.MoBnew "Jul" 12.MoBnew "Aug" PGS "PGS") 
{res}{txt}(output written to {browse  `"\\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/tables/MoB_OLS.tex"'})

{com}. 
. 
. 
. * Continuous MoB
. eststo  m1: reg ea  MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     1,826
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1790
                                                {txt}Root MSE          =    {res}  .8989

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          ea{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}{col 14}{res}{space 2}-.0878769{col 26}{space 2} .0053745{col 37}{space 1}  -16.35{col 46}{space 3}0.000{col 54}{space 4}-.0997061{col 67}{space 3}-.0760476
{txt}{space 9}PGS {c |}{col 14}{res}{space 2} .1354472{col 26}{space 2} .0252442{col 37}{space 1}    5.37{col 46}{space 3}0.000{col 54}{space 4}  .079885{col 67}{space 3} .1910093
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3904988{col 26}{space 2} .0301222{col 37}{space 1}  -12.96{col 46}{space 3}0.000{col 54}{space 4}-.4567972{col 67}{space 3}-.3242003
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} -3.87371{col 26}{space 2} 1.615565{col 37}{space 1}   -2.40{col 46}{space 3}0.035{col 54}{space 4}-7.429545{col 67}{space 3}-.3178753
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} 3.431443{col 26}{space 2} 2.385321{col 37}{space 1}    1.44{col 46}{space 3}0.178{col 54}{space 4}-1.818614{col 67}{space 3} 8.681499
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .4128264{col 26}{space 2} 1.514499{col 37}{space 1}    0.27{col 46}{space 3}0.790{col 54}{space 4}-2.920563{col 67}{space 3} 3.746216
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2}-1.818385{col 26}{space 2} 1.868117{col 37}{space 1}   -0.97{col 46}{space 3}0.351{col 54}{space 4}-5.930082{col 67}{space 3} 2.293312
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.019368{col 26}{space 2} 2.543533{col 37}{space 1}   -0.40{col 46}{space 3}0.696{col 54}{space 4}-6.617645{col 67}{space 3}  4.57891
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2} 1.099619{col 26}{space 2} 1.591378{col 37}{space 1}    0.69{col 46}{space 3}0.504{col 54}{space 4} -2.40298{col 67}{space 3} 4.602218
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.348419{col 26}{space 2} 2.034037{col 37}{space 1}    0.66{col 46}{space 3}0.521{col 54}{space 4}-3.128465{col 67}{space 3} 5.825304
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-2.767087{col 26}{space 2}  1.27857{col 37}{space 1}   -2.16{col 46}{space 3}0.053{col 54}{space 4}  -5.5812{col 67}{space 3} .0470255
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-1.654348{col 26}{space 2} 1.894883{col 37}{space 1}   -0.87{col 46}{space 3}0.401{col 54}{space 4}-5.824956{col 67}{space 3} 2.516261
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.8964983{col 26}{space 2} 1.994555{col 37}{space 1}   -0.45{col 46}{space 3}0.662{col 54}{space 4}-5.286484{col 67}{space 3} 3.493488
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8169888{col 26}{space 2} .0306563{col 37}{space 1}   26.65{col 46}{space 3}0.000{col 54}{space 4} .7495147{col 67}{space 3} .8844629
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m2: reg ks1 MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,734
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1362
                                                {txt}Root MSE          =    {res} .91383

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}{col 14}{res}{space 2} -.059081{col 26}{space 2} .0031591{col 37}{space 1}  -18.70{col 46}{space 3}0.000{col 54}{space 4} -.066034{col 67}{space 3} -.052128
{txt}{space 9}PGS {c |}{col 14}{res}{space 2} .2444853{col 26}{space 2} .0088297{col 37}{space 1}   27.69{col 46}{space 3}0.000{col 54}{space 4} .2250512{col 67}{space 3} .2639194
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3064812{col 26}{space 2} .0215342{col 37}{space 1}  -14.23{col 46}{space 3}0.000{col 54}{space 4}-.3538777{col 67}{space 3}-.2590846
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-1.292397{col 26}{space 2} 1.198498{col 37}{space 1}   -1.08{col 46}{space 3}0.304{col 54}{space 4}-3.930274{col 67}{space 3} 1.345479
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.6701834{col 26}{space 2} .7254937{col 37}{space 1}   -0.92{col 46}{space 3}0.375{col 54}{space 4}-2.266984{col 67}{space 3} .9266174
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}-1.107555{col 26}{space 2} .4816973{col 37}{space 1}   -2.30{col 46}{space 3}0.042{col 54}{space 4}-2.167764{col 67}{space 3}-.0473464
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} .9269031{col 26}{space 2}  1.12357{col 37}{space 1}    0.82{col 46}{space 3}0.427{col 54}{space 4}-1.546058{col 67}{space 3} 3.399864
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.264368{col 26}{space 2} 1.040871{col 37}{space 1}   -1.21{col 46}{space 3}0.250{col 54}{space 4} -3.55531{col 67}{space 3} 1.026573
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2} .0723465{col 26}{space 2} 1.105689{col 37}{space 1}    0.07{col 46}{space 3}0.949{col 54}{space 4}-2.361258{col 67}{space 3} 2.505951
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.570785{col 26}{space 2} 1.298938{col 37}{space 1}    1.21{col 46}{space 3}0.252{col 54}{space 4}-1.288157{col 67}{space 3} 4.429727
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.6396985{col 26}{space 2} .8522846{col 37}{space 1}   -0.75{col 46}{space 3}0.469{col 54}{space 4}-2.515564{col 67}{space 3} 1.236167
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-2.579108{col 26}{space 2}  .849598{col 37}{space 1}   -3.04{col 46}{space 3}0.011{col 54}{space 4} -4.44906{col 67}{space 3} -.709155
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .1745238{col 26}{space 2} .9092867{col 37}{space 1}    0.19{col 46}{space 3}0.851{col 54}{space 4}-1.826803{col 67}{space 3}  2.17585
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5938431{col 26}{space 2} .0256577{col 37}{space 1}   23.14{col 46}{space 3}0.000{col 54}{space 4}  .537371{col 67}{space 3} .6503153
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m3: reg ks2 MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     6,075
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1099
                                                {txt}Root MSE          =    {res} .93155

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}{col 14}{res}{space 2} -.026084{col 26}{space 2} .0036404{col 37}{space 1}   -7.17{col 46}{space 3}0.000{col 54}{space 4}-.0340966{col 67}{space 3}-.0180715
{txt}{space 9}PGS {c |}{col 14}{res}{space 2} .3091734{col 26}{space 2} .0119941{col 37}{space 1}   25.78{col 46}{space 3}0.000{col 54}{space 4} .2827746{col 67}{space 3} .3355722
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1204047{col 26}{space 2} .0228261{col 37}{space 1}   -5.27{col 46}{space 3}0.000{col 54}{space 4}-.1706446{col 67}{space 3}-.0701649
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} -.700092{col 26}{space 2} .9318513{col 37}{space 1}   -0.75{col 46}{space 3}0.468{col 54}{space 4}-2.751083{col 67}{space 3} 1.350899
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} .9912254{col 26}{space 2} .8558116{col 37}{space 1}    1.16{col 46}{space 3}0.271{col 54}{space 4}-.8924032{col 67}{space 3} 2.874854
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .0185212{col 26}{space 2}  .748334{col 37}{space 1}    0.02{col 46}{space 3}0.981{col 54}{space 4}-1.628551{col 67}{space 3} 1.665593
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 2.352046{col 26}{space 2} 1.168325{col 37}{space 1}    2.01{col 46}{space 3}0.069{col 54}{space 4}-.2194202{col 67}{space 3} 4.923512
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.406044{col 26}{space 2} 1.151199{col 37}{space 1}   -1.22{col 46}{space 3}0.247{col 54}{space 4}-3.939815{col 67}{space 3} 1.127727
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-.5732631{col 26}{space 2}  1.06664{col 37}{space 1}   -0.54{col 46}{space 3}0.602{col 54}{space 4}-2.920922{col 67}{space 3} 1.774396
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.381432{col 26}{space 2} 1.114219{col 37}{space 1}    1.24{col 46}{space 3}0.241{col 54}{space 4}-1.070947{col 67}{space 3} 3.833812
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-1.540501{col 26}{space 2} 1.108905{col 37}{space 1}   -1.39{col 46}{space 3}0.192{col 54}{space 4}-3.981183{col 67}{space 3} .9001819
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-2.241512{col 26}{space 2} 1.411123{col 37}{space 1}   -1.59{col 46}{space 3}0.140{col 54}{space 4}-5.347373{col 67}{space 3} .8643478
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .3673734{col 26}{space 2} .8495498{col 37}{space 1}    0.43{col 46}{space 3}0.674{col 54}{space 4}-1.502473{col 67}{space 3}  2.23722
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2652601{col 26}{space 2} .0226297{col 37}{space 1}   11.72{col 46}{space 3}0.000{col 54}{space 4} .2154524{col 67}{space 3} .3150678
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m4: reg ks3 MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,240
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1085
                                                {txt}Root MSE          =    {res} .94182

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}{col 14}{res}{space 2}-.0196798{col 26}{space 2} .0038482{col 37}{space 1}   -5.11{col 46}{space 3}0.000{col 54}{space 4}-.0281496{col 67}{space 3}  -.01121
{txt}{space 9}PGS {c |}{col 14}{res}{space 2} .3115942{col 26}{space 2} .0105186{col 37}{space 1}   29.62{col 46}{space 3}0.000{col 54}{space 4} .2884429{col 67}{space 3} .3347454
{txt}{space 8}male {c |}{col 14}{res}{space 2} -.166528{col 26}{space 2} .0201866{col 37}{space 1}   -8.25{col 46}{space 3}0.000{col 54}{space 4}-.2109583{col 67}{space 3}-.1220976
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} .1022404{col 26}{space 2} 1.249221{col 37}{space 1}    0.08{col 46}{space 3}0.936{col 54}{space 4}-2.647276{col 67}{space 3} 2.851757
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.1749504{col 26}{space 2} 1.414247{col 37}{space 1}   -0.12{col 46}{space 3}0.904{col 54}{space 4}-3.287686{col 67}{space 3} 2.937785
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .1988284{col 26}{space 2} 1.074915{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-2.167043{col 67}{space 3}   2.5647
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 1.250894{col 26}{space 2} 1.255238{col 37}{space 1}    1.00{col 46}{space 3}0.340{col 54}{space 4}-1.511866{col 67}{space 3} 4.013655
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.831758{col 26}{space 2}  1.06978{col 37}{space 1}   -1.71{col 46}{space 3}0.115{col 54}{space 4}-4.186328{col 67}{space 3} .5228129
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-1.231275{col 26}{space 2} 1.442788{col 37}{space 1}   -0.85{col 46}{space 3}0.412{col 54}{space 4}-4.406829{col 67}{space 3} 1.944279
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 2.361383{col 26}{space 2} .6488137{col 37}{space 1}    3.64{col 46}{space 3}0.004{col 54}{space 4} .9333539{col 67}{space 3} 3.789413
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-2.396459{col 26}{space 2} .8670757{col 37}{space 1}   -2.76{col 46}{space 3}0.018{col 54}{space 4}-4.304879{col 67}{space 3}-.4880381
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-1.251662{col 26}{space 2} 1.155204{col 37}{space 1}   -1.08{col 46}{space 3}0.302{col 54}{space 4} -3.79425{col 67}{space 3} 1.290926
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.8141954{col 26}{space 2} .9202751{col 37}{space 1}   -0.88{col 46}{space 3}0.395{col 54}{space 4}-2.839707{col 67}{space 3} 1.211317
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2488721{col 26}{space 2} .0356922{col 37}{space 1}    6.97{col 46}{space 3}0.000{col 54}{space 4} .1703141{col 67}{space 3} .3274302
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m5: reg ks4 MoBnew PGS male PC*, robust cluster(MoB) 

{txt}Linear regression                               Number of obs     = {res}     7,268
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0331
                                                {txt}Root MSE          =    {res} .99031

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}MoBnew {c |}{col 14}{res}{space 2} -.014871{col 26}{space 2} .0028463{col 37}{space 1}   -5.22{col 46}{space 3}0.000{col 54}{space 4}-.0211357{col 67}{space 3}-.0086063
{txt}{space 9}PGS {c |}{col 14}{res}{space 2} .1213409{col 26}{space 2}  .012382{col 37}{space 1}    9.80{col 46}{space 3}0.000{col 54}{space 4} .0940882{col 67}{space 3} .1485936
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.2428583{col 26}{space 2} .0298678{col 37}{space 1}   -8.13{col 46}{space 3}0.000{col 54}{space 4}-.3085969{col 67}{space 3}-.1771197
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-1.284833{col 26}{space 2} 1.194031{col 37}{space 1}   -1.08{col 46}{space 3}0.305{col 54}{space 4}-3.912878{col 67}{space 3} 1.343212
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-1.404471{col 26}{space 2} .9900282{col 37}{space 1}   -1.42{col 46}{space 3}0.184{col 54}{space 4}-3.583508{col 67}{space 3} .7745668
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .4309687{col 26}{space 2} .8762712{col 37}{space 1}    0.49{col 46}{space 3}0.633{col 54}{space 4}-1.497691{col 67}{space 3} 2.359629
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 2.232786{col 26}{space 2} 1.155698{col 37}{space 1}    1.93{col 46}{space 3}0.080{col 54}{space 4}-.3108871{col 67}{space 3} 4.776459
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-.3835375{col 26}{space 2} .7397488{col 37}{space 1}   -0.52{col 46}{space 3}0.614{col 54}{space 4}-2.011714{col 67}{space 3} 1.244639
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-2.196436{col 26}{space 2} 1.134287{col 37}{space 1}   -1.94{col 46}{space 3}0.079{col 54}{space 4}-4.692984{col 67}{space 3} .3001124
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} .9448028{col 26}{space 2} 1.174088{col 37}{space 1}    0.80{col 46}{space 3}0.438{col 54}{space 4}-1.639348{col 67}{space 3} 3.528954
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.8549039{col 26}{space 2} .8487517{col 37}{space 1}   -1.01{col 46}{space 3}0.335{col 54}{space 4}-2.722994{col 67}{space 3} 1.013186
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-.4947618{col 26}{space 2} .8032068{col 37}{space 1}   -0.62{col 46}{space 3}0.550{col 54}{space 4}-2.262608{col 67}{space 3} 1.273084
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.3730768{col 26}{space 2} .6777568{col 37}{space 1}   -0.55{col 46}{space 3}0.593{col 54}{space 4}-1.864809{col 67}{space 3} 1.118656
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .2374225{col 26}{space 2} .0303002{col 37}{space 1}    7.84{col 46}{space 3}0.000{col 54}{space 4} .1707323{col 67}{space 3} .3041127
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab  m1 m2 m3 m4 m5, b se keep(MoBnew PGS) star(* 0.10 ** 0.05 *** 0.01) stats(N, fmt(0))
{res}
{txt}{hline 92}
{txt}                      (1)             (2)             (3)             (4)             (5)   
{txt}                       ea             ks1             ks2             ks3             ks4   
{txt}{hline 92}
{txt}MoBnew      {res}      -0.0879***      -0.0591***      -0.0261***      -0.0197***      -0.0149***{txt}
            {res} {ralign 12:{txt:(}0.00537{txt:)}}    {ralign 12:{txt:(}0.00316{txt:)}}    {ralign 12:{txt:(}0.00364{txt:)}}    {ralign 12:{txt:(}0.00385{txt:)}}    {ralign 12:{txt:(}0.00285{txt:)}}   {txt}

{txt}PGS         {res}        0.135***        0.244***        0.309***        0.312***        0.121***{txt}
            {res} {ralign 12:{txt:(}0.0252{txt:)}}    {ralign 12:{txt:(}0.00883{txt:)}}    {ralign 12:{txt:(}0.0120{txt:)}}    {ralign 12:{txt:(}0.0105{txt:)}}    {ralign 12:{txt:(}0.0124{txt:)}}   {txt}
{txt}{hline 92}
{txt}N           {res}         1826            5734            6075            5240            7268   {txt}
{txt}{hline 92}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. esttab  m1 m2 m3 m4 m5 using "${c -(}dirtables{c )-}/MoB_OLS2.tex", replace ///
>         frag bookt b(3) se(3) keep(MoBnew PGS) star(* 0.10 ** 0.05 *** 0.01) ///
>         mtitles("Age 4" "Age 7" "Age 11" "Age 14" "Age 16") ///
>         stats(r2 N, label("R2" "Observations") fmt(3 0)) nonotes coeflabel(MoBnew "MoB" PGS "PGS") 
{res}{txt}(output written to {browse  `"\\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/tables/MoB_OLS2.tex"'})

{com}. 
. 
. 
. ***************************************************************************
. * With GxE interactions
. eststo  m1: reg ea  ib9.MoB#c.PGS ib9.MoB PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     1,826
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1941
                                                {txt}Root MSE          =    {res} .89579

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          ea{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}MoB#c.PGS {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .0501204{col 26}{space 2} .0114857{col 37}{space 1}    4.36{col 46}{space 3}0.001{col 54}{space 4} .0248405{col 67}{space 3} .0754003
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .2238672{col 26}{space 2} .0083747{col 37}{space 1}   26.73{col 46}{space 3}0.000{col 54}{space 4} .2054347{col 67}{space 3} .2422998
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.1029665{col 26}{space 2} .0059864{col 37}{space 1}  -17.20{col 46}{space 3}0.000{col 54}{space 4}-.1161424{col 67}{space 3}-.0897906
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.0044496{col 26}{space 2} .0086036{col 37}{space 1}   -0.52{col 46}{space 3}0.615{col 54}{space 4}-.0233861{col 67}{space 3} .0144869
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0843366{col 26}{space 2} .0069822{col 37}{space 1}   12.08{col 46}{space 3}0.000{col 54}{space 4}  .068969{col 67}{space 3} .0997043
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .2329899{col 26}{space 2} .0037239{col 37}{space 1}   62.57{col 46}{space 3}0.000{col 54}{space 4} .2247936{col 67}{space 3} .2411862
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}  .172184{col 26}{space 2} .0078942{col 37}{space 1}   21.81{col 46}{space 3}0.000{col 54}{space 4}  .154809{col 67}{space 3} .1895591
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} .0531349{col 26}{space 2} .0024862{col 37}{space 1}   21.37{col 46}{space 3}0.000{col 54}{space 4} .0476627{col 67}{space 3}  .058607
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .1155557{col 26}{space 2} .0077626{col 37}{space 1}   14.89{col 46}{space 3}0.000{col 54}{space 4} .0984702{col 67}{space 3} .1326411
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .1436643{col 26}{space 2} .0062181{col 37}{space 1}   23.10{col 46}{space 3}0.000{col 54}{space 4} .1299782{col 67}{space 3} .1573503
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}     .087{col 26}{space 2} .0070811{col 37}{space 1}   12.29{col 46}{space 3}0.000{col 54}{space 4} .0714146{col 67}{space 3} .1025854
{txt}{space 12} {c |}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}-.2031382{col 26}{space 2}  .005739{col 37}{space 1}  -35.40{col 46}{space 3}0.000{col 54}{space 4}-.2157696{col 67}{space 3}-.1905069
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.5434785{col 26}{space 2} .0055291{col 37}{space 1}  -98.29{col 46}{space 3}0.000{col 54}{space 4}-.5556479{col 67}{space 3}-.5313091
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.6441946{col 26}{space 2} .0089699{col 37}{space 1}  -71.82{col 46}{space 3}0.000{col 54}{space 4}-.6639371{col 67}{space 3} -.624452
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.4442214{col 26}{space 2} .0085463{col 37}{space 1}  -51.98{col 46}{space 3}0.000{col 54}{space 4}-.4630316{col 67}{space 3}-.4254112
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.7367509{col 26}{space 2}  .005869{col 37}{space 1} -125.53{col 46}{space 3}0.000{col 54}{space 4}-.7496686{col 67}{space 3}-.7238332
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.6704823{col 26}{space 2} .0060621{col 37}{space 1} -110.60{col 46}{space 3}0.000{col 54}{space 4}-.6838249{col 67}{space 3}-.6571396
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} -1.00181{col 26}{space 2} .0061811{col 37}{space 1} -162.08{col 46}{space 3}0.000{col 54}{space 4}-1.015415{col 67}{space 3}-.9882058
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.9698667{col 26}{space 2} .0084934{col 37}{space 1} -114.19{col 46}{space 3}0.000{col 54}{space 4}-.9885606{col 67}{space 3}-.9511728
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2}-.1322282{col 26}{space 2} .0050589{col 37}{space 1}  -26.14{col 46}{space 3}0.000{col 54}{space 4}-.1433629{col 67}{space 3}-.1210936
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}-.1627945{col 26}{space 2} .0077293{col 37}{space 1}  -21.06{col 46}{space 3}0.000{col 54}{space 4}-.1798065{col 67}{space 3}-.1457825
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.3033789{col 26}{space 2}   .00435{col 37}{space 1}  -69.74{col 46}{space 3}0.000{col 54}{space 4}-.3129532{col 67}{space 3}-.2938046
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .0433448{col 26}{space 2} .0052819{col 37}{space 1}    8.21{col 46}{space 3}0.000{col 54}{space 4} .0317195{col 67}{space 3} .0549701
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3826527{col 26}{space 2} .0326372{col 37}{space 1}  -11.72{col 46}{space 3}0.000{col 54}{space 4}-.4544867{col 67}{space 3}-.3108187
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-3.656964{col 26}{space 2} 1.437728{col 37}{space 1}   -2.54{col 46}{space 3}0.027{col 54}{space 4}-6.821382{col 67}{space 3}-.4925456
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} 3.288473{col 26}{space 2} 2.440657{col 37}{space 1}    1.35{col 46}{space 3}0.205{col 54}{space 4}-2.083378{col 67}{space 3} 8.660323
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .5821543{col 26}{space 2} 1.534046{col 37}{space 1}    0.38{col 46}{space 3}0.712{col 54}{space 4}-2.794257{col 67}{space 3} 3.958566
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2}-1.967853{col 26}{space 2} 1.894557{col 37}{space 1}   -1.04{col 46}{space 3}0.321{col 54}{space 4}-6.137744{col 67}{space 3} 2.202038
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-.9945495{col 26}{space 2} 2.714534{col 37}{space 1}   -0.37{col 46}{space 3}0.721{col 54}{space 4}-6.969198{col 67}{space 3} 4.980099
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}  1.55655{col 26}{space 2} 1.643175{col 37}{space 1}    0.95{col 46}{space 3}0.364{col 54}{space 4}-2.060055{col 67}{space 3} 5.173155
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.357409{col 26}{space 2}  2.04847{col 37}{space 1}    0.66{col 46}{space 3}0.521{col 54}{space 4}-3.151244{col 67}{space 3} 5.866061
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-2.541337{col 26}{space 2} 1.544869{col 37}{space 1}   -1.65{col 46}{space 3}0.128{col 54}{space 4} -5.94157{col 67}{space 3} .8588959
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2} -1.88773{col 26}{space 2} 1.960699{col 37}{space 1}   -0.96{col 46}{space 3}0.356{col 54}{space 4}-6.203198{col 67}{space 3} 2.427738
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.7623456{col 26}{space 2} 1.916302{col 37}{space 1}   -0.40{col 46}{space 3}0.698{col 54}{space 4}-4.980099{col 67}{space 3} 3.455408
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .727297{col 26}{space 2} .0154382{col 37}{space 1}   47.11{col 46}{space 3}0.000{col 54}{space 4} .6933177{col 67}{space 3} .7612763
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m2: reg ks1 ib9.MoB#c.PGS ib9.MoB PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,734
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1388
                                                {txt}Root MSE          =    {res} .91415

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}MoB#c.PGS {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}-.0199354{col 26}{space 2}  .001704{col 37}{space 1}  -11.70{col 46}{space 3}0.000{col 54}{space 4}-.0236859{col 67}{space 3}-.0161849
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .0522298{col 26}{space 2} .0025051{col 37}{space 1}   20.85{col 46}{space 3}0.000{col 54}{space 4} .0467161{col 67}{space 3} .0577436
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .1004373{col 26}{space 2} .0021392{col 37}{space 1}   46.95{col 46}{space 3}0.000{col 54}{space 4} .0957289{col 67}{space 3} .1051458
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0494901{col 26}{space 2} .0054018{col 37}{space 1}    9.16{col 46}{space 3}0.000{col 54}{space 4} .0376007{col 67}{space 3} .0613794
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0887859{col 26}{space 2}  .002575{col 37}{space 1}   34.48{col 46}{space 3}0.000{col 54}{space 4} .0831183{col 67}{space 3} .0944535
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .0201478{col 26}{space 2} .0018134{col 37}{space 1}   11.11{col 46}{space 3}0.000{col 54}{space 4} .0161565{col 67}{space 3}  .024139
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .0542623{col 26}{space 2} .0030884{col 37}{space 1}   17.57{col 46}{space 3}0.000{col 54}{space 4} .0474648{col 67}{space 3} .0610599
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} .0635881{col 26}{space 2} .0030154{col 37}{space 1}   21.09{col 46}{space 3}0.000{col 54}{space 4} .0569513{col 67}{space 3} .0702248
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .0547301{col 26}{space 2} .0036125{col 37}{space 1}   15.15{col 46}{space 3}0.000{col 54}{space 4} .0467791{col 67}{space 3} .0626811
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0587424{col 26}{space 2} .0025342{col 37}{space 1}   23.18{col 46}{space 3}0.000{col 54}{space 4} .0531648{col 67}{space 3} .0643201
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0382814{col 26}{space 2} .0023667{col 37}{space 1}   16.18{col 46}{space 3}0.000{col 54}{space 4} .0330724{col 67}{space 3} .0434904
{txt}{space 12} {c |}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}  -.18348{col 26}{space 2} .0031568{col 37}{space 1}  -58.12{col 46}{space 3}0.000{col 54}{space 4}-.1904281{col 67}{space 3}-.1765319
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} -.311623{col 26}{space 2} .0028321{col 37}{space 1} -110.03{col 46}{space 3}0.000{col 54}{space 4}-.3178564{col 67}{space 3}-.3053895
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.3744235{col 26}{space 2} .0018794{col 37}{space 1} -199.23{col 46}{space 3}0.000{col 54}{space 4}-.3785599{col 67}{space 3} -.370287
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.3441075{col 26}{space 2} .0013534{col 37}{space 1} -254.26{col 46}{space 3}0.000{col 54}{space 4}-.3470863{col 67}{space 3}-.3411287
{txt}{space 8}May  {c |}{col 14}{res}{space 2} -.457148{col 26}{space 2} .0020018{col 37}{space 1} -228.37{col 46}{space 3}0.000{col 54}{space 4}-.4615539{col 67}{space 3} -.452742
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.4580599{col 26}{space 2} .0023678{col 37}{space 1} -193.46{col 46}{space 3}0.000{col 54}{space 4}-.4632713{col 67}{space 3}-.4528485
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.5178467{col 26}{space 2} .0012689{col 37}{space 1} -408.10{col 46}{space 3}0.000{col 54}{space 4}-.5206396{col 67}{space 3}-.5150539
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.648957{col 26}{space 2} .0020866{col 37}{space 1} -311.01{col 46}{space 3}0.000{col 54}{space 4}-.6535496{col 67}{space 3}-.6443643
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2}-.0314561{col 26}{space 2} .0011834{col 37}{space 1}  -26.58{col 46}{space 3}0.000{col 54}{space 4}-.0340608{col 67}{space 3}-.0288513
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}-.0397169{col 26}{space 2} .0016921{col 37}{space 1}  -23.47{col 46}{space 3}0.000{col 54}{space 4}-.0434412{col 67}{space 3}-.0359926
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0651481{col 26}{space 2}  .001737{col 37}{space 1}  -37.51{col 46}{space 3}0.000{col 54}{space 4}-.0689711{col 67}{space 3} -.061325
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .1974767{col 26}{space 2} .0017048{col 37}{space 1}  115.84{col 46}{space 3}0.000{col 54}{space 4} .1937245{col 67}{space 3} .2012289
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3053262{col 26}{space 2} .0216567{col 37}{space 1}  -14.10{col 46}{space 3}0.000{col 54}{space 4}-.3529922{col 67}{space 3}-.2576601
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-1.268627{col 26}{space 2} 1.176761{col 37}{space 1}   -1.08{col 46}{space 3}0.304{col 54}{space 4}-3.858661{col 67}{space 3} 1.321408
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.7062516{col 26}{space 2} .7622061{col 37}{space 1}   -0.93{col 46}{space 3}0.374{col 54}{space 4}-2.383856{col 67}{space 3} .9713526
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}-1.138282{col 26}{space 2} .4864641{col 37}{space 1}   -2.34{col 46}{space 3}0.039{col 54}{space 4}-2.208982{col 67}{space 3}-.0675818
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} .9578814{col 26}{space 2} 1.110127{col 37}{space 1}    0.86{col 46}{space 3}0.407{col 54}{space 4}-1.485493{col 67}{space 3} 3.401255
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.223518{col 26}{space 2} 1.068844{col 37}{space 1}   -1.14{col 46}{space 3}0.277{col 54}{space 4}-3.576029{col 67}{space 3} 1.128992
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2} .1124537{col 26}{space 2} 1.104964{col 37}{space 1}    0.10{col 46}{space 3}0.921{col 54}{space 4}-2.319556{col 67}{space 3} 2.544463
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.457653{col 26}{space 2} 1.331374{col 37}{space 1}    1.09{col 46}{space 3}0.297{col 54}{space 4}-1.472682{col 67}{space 3} 4.387987
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.6282988{col 26}{space 2} .8515547{col 37}{space 1}   -0.74{col 46}{space 3}0.476{col 54}{space 4}-2.502558{col 67}{space 3}  1.24596
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-2.583014{col 26}{space 2} .8845357{col 37}{space 1}   -2.92{col 46}{space 3}0.014{col 54}{space 4}-4.529864{col 67}{space 3}-.6361637
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .1660871{col 26}{space 2}  .928371{col 37}{space 1}    0.18{col 46}{space 3}0.861{col 54}{space 4}-1.877244{col 67}{space 3} 2.209418
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4920728{col 26}{space 2} .0112651{col 37}{space 1}   43.68{col 46}{space 3}0.000{col 54}{space 4} .4672785{col 67}{space 3} .5168672
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m3: reg ks2 ib9.MoB#c.PGS ib9.MoB PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     6,075
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1147
                                                {txt}Root MSE          =    {res} .93062

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}MoB#c.PGS {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}-.0551966{col 26}{space 2} .0023252{col 37}{space 1}  -23.74{col 46}{space 3}0.000{col 54}{space 4}-.0603145{col 67}{space 3}-.0500788
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .1051535{col 26}{space 2} .0025421{col 37}{space 1}   41.37{col 46}{space 3}0.000{col 54}{space 4} .0995585{col 67}{space 3} .1107485
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .1255069{col 26}{space 2} .0021481{col 37}{space 1}   58.43{col 46}{space 3}0.000{col 54}{space 4} .1207789{col 67}{space 3} .1302349
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0166602{col 26}{space 2} .0034642{col 37}{space 1}    4.81{col 46}{space 3}0.001{col 54}{space 4} .0090354{col 67}{space 3} .0242849
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0759979{col 26}{space 2} .0023041{col 37}{space 1}   32.98{col 46}{space 3}0.000{col 54}{space 4} .0709265{col 67}{space 3} .0810693
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .0098439{col 26}{space 2} .0015667{col 37}{space 1}    6.28{col 46}{space 3}0.000{col 54}{space 4} .0063957{col 67}{space 3} .0132921
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.0185856{col 26}{space 2} .0023692{col 37}{space 1}   -7.84{col 46}{space 3}0.000{col 54}{space 4}-.0238001{col 67}{space 3}-.0133711
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} .0223759{col 26}{space 2} .0026484{col 37}{space 1}    8.45{col 46}{space 3}0.000{col 54}{space 4} .0165468{col 67}{space 3} .0282051
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2}-.0109858{col 26}{space 2} .0023092{col 37}{space 1}   -4.76{col 46}{space 3}0.001{col 54}{space 4}-.0160684{col 67}{space 3}-.0059032
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}  .053902{col 26}{space 2} .0030452{col 37}{space 1}   17.70{col 46}{space 3}0.000{col 54}{space 4} .0471995{col 67}{space 3} .0606044
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0435771{col 26}{space 2} .0021307{col 37}{space 1}   20.45{col 46}{space 3}0.000{col 54}{space 4} .0388874{col 67}{space 3} .0482668
{txt}{space 12} {c |}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}-.0387394{col 26}{space 2} .0028983{col 37}{space 1}  -13.37{col 46}{space 3}0.000{col 54}{space 4}-.0451186{col 67}{space 3}-.0323602
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.2315176{col 26}{space 2} .0006989{col 37}{space 1} -331.25{col 46}{space 3}0.000{col 54}{space 4} -.233056{col 67}{space 3}-.2299793
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.2048818{col 26}{space 2} .0018646{col 37}{space 1} -109.88{col 46}{space 3}0.000{col 54}{space 4}-.2089859{col 67}{space 3}-.2007778
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} -.131998{col 26}{space 2} .0019914{col 37}{space 1}  -66.28{col 46}{space 3}0.000{col 54}{space 4}-.1363812{col 67}{space 3}-.1276149
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.1600048{col 26}{space 2} .0024424{col 37}{space 1}  -65.51{col 46}{space 3}0.000{col 54}{space 4}-.1653805{col 67}{space 3}-.1546292
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.1017441{col 26}{space 2} .0018954{col 37}{space 1}  -53.68{col 46}{space 3}0.000{col 54}{space 4}-.1059159{col 67}{space 3}-.0975724
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.2385789{col 26}{space 2} .0024048{col 37}{space 1}  -99.21{col 46}{space 3}0.000{col 54}{space 4}-.2438719{col 67}{space 3} -.233286
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.300834{col 26}{space 2} .0025965{col 37}{space 1} -115.86{col 46}{space 3}0.000{col 54}{space 4}-.3065488{col 67}{space 3}-.2951192
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .0265693{col 26}{space 2} .0012662{col 37}{space 1}   20.98{col 46}{space 3}0.000{col 54}{space 4} .0237825{col 67}{space 3} .0293562
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0232523{col 26}{space 2} .0019235{col 37}{space 1}   12.09{col 46}{space 3}0.000{col 54}{space 4} .0190186{col 67}{space 3} .0274859
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0398832{col 26}{space 2} .0028604{col 37}{space 1}  -13.94{col 46}{space 3}0.000{col 54}{space 4}-.0461788{col 67}{space 3}-.0335875
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .2818904{col 26}{space 2} .0016996{col 37}{space 1}  165.86{col 46}{space 3}0.000{col 54}{space 4} .2781496{col 67}{space 3} .2856311
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1192604{col 26}{space 2} .0220955{col 37}{space 1}   -5.40{col 46}{space 3}0.000{col 54}{space 4}-.1678923{col 67}{space 3}-.0706286
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-.7212056{col 26}{space 2} .9189741{col 37}{space 1}   -0.78{col 46}{space 3}0.449{col 54}{space 4}-2.743854{col 67}{space 3} 1.301443
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} .9962718{col 26}{space 2}  .875419{col 37}{space 1}    1.14{col 46}{space 3}0.279{col 54}{space 4}-.9305124{col 67}{space 3} 2.923056
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}-.1025714{col 26}{space 2} .7335334{col 37}{space 1}   -0.14{col 46}{space 3}0.891{col 54}{space 4}-1.717068{col 67}{space 3} 1.511925
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 2.363871{col 26}{space 2} 1.171347{col 37}{space 1}    2.02{col 46}{space 3}0.069{col 54}{space 4}-.2142464{col 67}{space 3} 4.941988
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.304872{col 26}{space 2} 1.201941{col 37}{space 1}   -1.09{col 46}{space 3}0.301{col 54}{space 4}-3.950326{col 67}{space 3} 1.340583
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-.5164942{col 26}{space 2} 1.050459{col 37}{space 1}   -0.49{col 46}{space 3}0.633{col 54}{space 4}-2.828539{col 67}{space 3} 1.795551
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.255386{col 26}{space 2} 1.114329{col 37}{space 1}    1.13{col 46}{space 3}0.284{col 54}{space 4}-1.197235{col 67}{space 3} 3.708007
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-1.483925{col 26}{space 2} 1.079149{col 37}{space 1}   -1.38{col 46}{space 3}0.196{col 54}{space 4}-3.859117{col 67}{space 3} .8912663
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-2.161754{col 26}{space 2} 1.426204{col 37}{space 1}   -1.52{col 46}{space 3}0.158{col 54}{space 4}-5.300809{col 67}{space 3} .9773007
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .3437562{col 26}{space 2}  .883709{col 37}{space 1}    0.39{col 46}{space 3}0.705{col 54}{space 4}-1.601274{col 67}{space 3} 2.288787
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .205746{col 26}{space 2} .0110487{col 37}{space 1}   18.62{col 46}{space 3}0.000{col 54}{space 4}  .181428{col 67}{space 3} .2300639
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m4: reg ks3 ib9.MoB#c.PGS ib9.MoB PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,240
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1112
                                                {txt}Root MSE          =    {res} .94229

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}MoB#c.PGS {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .0237659{col 26}{space 2} .0024878{col 37}{space 1}    9.55{col 46}{space 3}0.000{col 54}{space 4} .0182904{col 67}{space 3} .0292415
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .0771825{col 26}{space 2} .0032347{col 37}{space 1}   23.86{col 46}{space 3}0.000{col 54}{space 4} .0700628{col 67}{space 3} .0843021
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} -.012594{col 26}{space 2} .0035081{col 37}{space 1}   -3.59{col 46}{space 3}0.004{col 54}{space 4}-.0203152{col 67}{space 3}-.0048728
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0007577{col 26}{space 2} .0033209{col 37}{space 1}    0.23{col 46}{space 3}0.824{col 54}{space 4}-.0065515{col 67}{space 3} .0080668
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0313979{col 26}{space 2} .0025417{col 37}{space 1}   12.35{col 46}{space 3}0.000{col 54}{space 4} .0258038{col 67}{space 3} .0369921
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0251159{col 26}{space 2}  .001751{col 37}{space 1}  -14.34{col 46}{space 3}0.000{col 54}{space 4}-.0289698{col 67}{space 3}-.0212619
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .0177196{col 26}{space 2} .0032312{col 37}{space 1}    5.48{col 46}{space 3}0.000{col 54}{space 4} .0106078{col 67}{space 3} .0248313
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}  .043286{col 26}{space 2} .0025965{col 37}{space 1}   16.67{col 46}{space 3}0.000{col 54}{space 4} .0375711{col 67}{space 3} .0490009
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .0643827{col 26}{space 2} .0032635{col 37}{space 1}   19.73{col 46}{space 3}0.000{col 54}{space 4} .0571998{col 67}{space 3} .0715657
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0904782{col 26}{space 2} .0029845{col 37}{space 1}   30.32{col 46}{space 3}0.000{col 54}{space 4} .0839094{col 67}{space 3} .0970469
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0324914{col 26}{space 2} .0019616{col 37}{space 1}   16.56{col 46}{space 3}0.000{col 54}{space 4} .0281739{col 67}{space 3} .0368089
{txt}{space 12} {c |}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2} .0076126{col 26}{space 2} .0024877{col 37}{space 1}    3.06{col 46}{space 3}0.011{col 54}{space 4} .0021371{col 67}{space 3}  .013088
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.1139932{col 26}{space 2} .0029518{col 37}{space 1}  -38.62{col 46}{space 3}0.000{col 54}{space 4}-.1204902{col 67}{space 3}-.1074963
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.0638688{col 26}{space 2} .0023013{col 37}{space 1}  -27.75{col 46}{space 3}0.000{col 54}{space 4}-.0689339{col 67}{space 3}-.0588038
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.1130537{col 26}{space 2} .0021035{col 37}{space 1}  -53.75{col 46}{space 3}0.000{col 54}{space 4}-.1176835{col 67}{space 3} -.108424
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.0723877{col 26}{space 2} .0023331{col 37}{space 1}  -31.03{col 46}{space 3}0.000{col 54}{space 4}-.0775228{col 67}{space 3}-.0672526
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0844078{col 26}{space 2} .0017359{col 37}{space 1}  -48.62{col 46}{space 3}0.000{col 54}{space 4}-.0882286{col 67}{space 3} -.080587
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.1671578{col 26}{space 2} .0015768{col 37}{space 1} -106.01{col 46}{space 3}0.000{col 54}{space 4}-.1706284{col 67}{space 3}-.1636872
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.1440115{col 26}{space 2} .0015002{col 37}{space 1}  -95.99{col 46}{space 3}0.000{col 54}{space 4}-.1473134{col 67}{space 3}-.1407095
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .1117192{col 26}{space 2}  .001584{col 37}{space 1}   70.53{col 46}{space 3}0.000{col 54}{space 4} .1082329{col 67}{space 3} .1152056
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0358189{col 26}{space 2} .0023455{col 37}{space 1}   15.27{col 46}{space 3}0.000{col 54}{space 4} .0306565{col 67}{space 3} .0409813
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0011313{col 26}{space 2} .0018963{col 37}{space 1}    0.60{col 46}{space 3}0.563{col 54}{space 4}-.0030424{col 67}{space 3} .0053051
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .2831064{col 26}{space 2} .0019805{col 37}{space 1}  142.95{col 46}{space 3}0.000{col 54}{space 4} .2787474{col 67}{space 3} .2874654
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1639635{col 26}{space 2} .0197991{col 37}{space 1}   -8.28{col 46}{space 3}0.000{col 54}{space 4} -.207541{col 67}{space 3} -.120386
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} .1593847{col 26}{space 2} 1.274981{col 37}{space 1}    0.13{col 46}{space 3}0.903{col 54}{space 4}-2.646829{col 67}{space 3} 2.965599
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.0787527{col 26}{space 2} 1.431089{col 37}{space 1}   -0.06{col 46}{space 3}0.957{col 54}{space 4}-3.228559{col 67}{space 3} 3.071054
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}  .086241{col 26}{space 2} 1.074595{col 37}{space 1}    0.08{col 46}{space 3}0.937{col 54}{space 4}-2.278926{col 67}{space 3} 2.451408
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 1.230818{col 26}{space 2} 1.258075{col 37}{space 1}    0.98{col 46}{space 3}0.349{col 54}{space 4}-1.538186{col 67}{space 3} 3.999822
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2} -1.95809{col 26}{space 2} 1.092737{col 37}{space 1}   -1.79{col 46}{space 3}0.101{col 54}{space 4}-4.363189{col 67}{space 3}  .447008
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-1.152603{col 26}{space 2} 1.449334{col 37}{space 1}   -0.80{col 46}{space 3}0.443{col 54}{space 4}-4.342566{col 67}{space 3}  2.03736
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 2.277082{col 26}{space 2} .6421749{col 37}{space 1}    3.55{col 46}{space 3}0.005{col 54}{space 4} .8636645{col 67}{space 3} 3.690499
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2} -2.45882{col 26}{space 2} .8529712{col 37}{space 1}   -2.88{col 46}{space 3}0.015{col 54}{space 4}-4.336197{col 67}{space 3} -.581443
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-1.160615{col 26}{space 2} 1.174034{col 37}{space 1}   -0.99{col 46}{space 3}0.344{col 54}{space 4}-3.744646{col 67}{space 3} 1.423416
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.6927891{col 26}{space 2} .9216682{col 37}{space 1}   -0.75{col 46}{space 3}0.468{col 54}{space 4}-2.721367{col 67}{space 3} 1.335789
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1673147{col 26}{space 2} .0092282{col 37}{space 1}   18.13{col 46}{space 3}0.000{col 54}{space 4} .1470036{col 67}{space 3} .1876259
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m5: reg ks4 ib9.MoB#c.PGS ib9.MoB PGS male PC*, robust cluster(MoB) 

{txt}Linear regression                               Number of obs     = {res}     7,268
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0368
                                                {txt}Root MSE          =    {res} .98985

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}MoB#c.PGS {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}-.0281241{col 26}{space 2} .0019036{col 37}{space 1}  -14.77{col 46}{space 3}0.000{col 54}{space 4} -.032314{col 67}{space 3}-.0239343
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .0083322{col 26}{space 2} .0025756{col 37}{space 1}    3.24{col 46}{space 3}0.008{col 54}{space 4} .0026633{col 67}{space 3} .0140011
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .0448085{col 26}{space 2} .0019846{col 37}{space 1}   22.58{col 46}{space 3}0.000{col 54}{space 4} .0404404{col 67}{space 3} .0491765
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0196093{col 26}{space 2} .0039438{col 37}{space 1}    4.97{col 46}{space 3}0.000{col 54}{space 4} .0109291{col 67}{space 3} .0282896
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0883047{col 26}{space 2}  .001631{col 37}{space 1}   54.14{col 46}{space 3}0.000{col 54}{space 4} .0847148{col 67}{space 3} .0918946
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} -.068172{col 26}{space 2} .0020562{col 37}{space 1}  -33.15{col 46}{space 3}0.000{col 54}{space 4}-.0726977{col 67}{space 3}-.0636464
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .0126888{col 26}{space 2} .0025957{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4} .0069757{col 67}{space 3} .0184018
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} .0073864{col 26}{space 2} .0032094{col 37}{space 1}    2.30{col 46}{space 3}0.042{col 54}{space 4} .0003225{col 67}{space 3} .0144504
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .0295075{col 26}{space 2} .0026054{col 37}{space 1}   11.33{col 46}{space 3}0.000{col 54}{space 4} .0237732{col 67}{space 3} .0352419
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0374419{col 26}{space 2} .0024476{col 37}{space 1}   15.30{col 46}{space 3}0.000{col 54}{space 4} .0320548{col 67}{space 3}  .042829
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0321376{col 26}{space 2} .0022703{col 37}{space 1}  -14.16{col 46}{space 3}0.000{col 54}{space 4}-.0371344{col 67}{space 3}-.0271407
{txt}{space 12} {c |}
{space 9}MoB {c |}
{space 8}Jan  {c |}{col 14}{res}{space 2}  .049167{col 26}{space 2} .0016977{col 37}{space 1}   28.96{col 46}{space 3}0.000{col 54}{space 4} .0454304{col 67}{space 3} .0529037
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.0923631{col 26}{space 2}    .0016{col 37}{space 1}  -57.73{col 46}{space 3}0.000{col 54}{space 4}-.0958846{col 67}{space 3}-.0888416
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.1483534{col 26}{space 2} .0011362{col 37}{space 1} -130.57{col 46}{space 3}0.000{col 54}{space 4}-.1508542{col 67}{space 3}-.1458526
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.0857843{col 26}{space 2} .0019872{col 37}{space 1}  -43.17{col 46}{space 3}0.000{col 54}{space 4}-.0901581{col 67}{space 3}-.0814106
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0080556{col 26}{space 2} .0017273{col 37}{space 1}    4.66{col 46}{space 3}0.001{col 54}{space 4} .0042539{col 67}{space 3} .0118574
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0833249{col 26}{space 2} .0020502{col 37}{space 1}  -40.64{col 46}{space 3}0.000{col 54}{space 4}-.0878375{col 67}{space 3}-.0788124
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.1171275{col 26}{space 2} .0014292{col 37}{space 1}  -81.95{col 46}{space 3}0.000{col 54}{space 4}-.1202732{col 67}{space 3}-.1139817
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.1294467{col 26}{space 2} .0018331{col 37}{space 1}  -70.62{col 46}{space 3}0.000{col 54}{space 4}-.1334812{col 67}{space 3}-.1254121
{txt}{space 8}Oct  {c |}{col 14}{res}{space 2} .0624702{col 26}{space 2} .0016074{col 37}{space 1}   38.86{col 46}{space 3}0.000{col 54}{space 4} .0589323{col 67}{space 3}  .066008
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0381459{col 26}{space 2} .0017963{col 37}{space 1}   21.24{col 46}{space 3}0.000{col 54}{space 4} .0341922{col 67}{space 3} .0420996
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0029667{col 26}{space 2} .0014995{col 37}{space 1}    1.98{col 46}{space 3}0.073{col 54}{space 4}-.0003336{col 67}{space 3} .0062669
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .1101767{col 26}{space 2} .0013433{col 37}{space 1}   82.02{col 46}{space 3}0.000{col 54}{space 4} .1072201{col 67}{space 3} .1131333
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.2407772{col 26}{space 2} .0292698{col 37}{space 1}   -8.23{col 46}{space 3}0.000{col 54}{space 4}-.3051997{col 67}{space 3}-.1763547
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} -1.23068{col 26}{space 2} 1.193909{col 37}{space 1}   -1.03{col 46}{space 3}0.325{col 54}{space 4}-3.858456{col 67}{space 3} 1.397096
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-1.414408{col 26}{space 2} .9854913{col 37}{space 1}   -1.44{col 46}{space 3}0.179{col 54}{space 4} -3.58346{col 67}{space 3}  .754644
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}  .373497{col 26}{space 2} .8767515{col 37}{space 1}    0.43{col 46}{space 3}0.678{col 54}{space 4} -1.55622{col 67}{space 3} 2.303214
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2}  2.22934{col 26}{space 2} 1.159949{col 37}{space 1}    1.92{col 46}{space 3}0.081{col 54}{space 4}-.3236905{col 67}{space 3} 4.782371
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-.4555073{col 26}{space 2} .7817848{col 37}{space 1}   -0.58{col 46}{space 3}0.572{col 54}{space 4}-2.176204{col 67}{space 3} 1.265189
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-2.171593{col 26}{space 2} 1.127033{col 37}{space 1}   -1.93{col 46}{space 3}0.080{col 54}{space 4}-4.652176{col 67}{space 3} .3089897
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} .9124381{col 26}{space 2} 1.187339{col 37}{space 1}    0.77{col 46}{space 3}0.458{col 54}{space 4}-1.700877{col 67}{space 3} 3.525753
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.8833312{col 26}{space 2} .8475991{col 37}{space 1}   -1.04{col 46}{space 3}0.320{col 54}{space 4}-2.748884{col 67}{space 3} .9822219
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-.5058573{col 26}{space 2} .8102578{col 37}{space 1}   -0.62{col 46}{space 3}0.545{col 54}{space 4}-2.289223{col 67}{space 3} 1.277508
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.3048878{col 26}{space 2} .6685591{col 37}{space 1}   -0.46{col 46}{space 3}0.657{col 54}{space 4}-1.776376{col 67}{space 3} 1.166601
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1781002{col 26}{space 2} .0152178{col 37}{space 1}   11.70{col 46}{space 3}0.000{col 54}{space 4} .1446061{col 67}{space 3} .2115944
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab  m1 m2 m3 m4 m5, b se keep(*.MoB#c.PGS *.MoB PGS) star(* 0.10 ** 0.05 *** 0.01) stats(N, fmt(0))
{res}
{txt}{hline 92}
{txt}                      (1)             (2)             (3)             (4)             (5)   
{txt}                       ea             ks1             ks2             ks3             ks4   
{txt}{hline 92}
{txt}1.MoB#c.PGS {res}       0.0501***      -0.0199***      -0.0552***       0.0238***      -0.0281***{txt}
            {res} {ralign 12:{txt:(}0.0115{txt:)}}    {ralign 12:{txt:(}0.00170{txt:)}}    {ralign 12:{txt:(}0.00233{txt:)}}    {ralign 12:{txt:(}0.00249{txt:)}}    {ralign 12:{txt:(}0.00190{txt:)}}   {txt}

{txt}2.MoB#c.PGS {res}        0.224***       0.0522***        0.105***       0.0772***      0.00833***{txt}
            {res} {ralign 12:{txt:(}0.00837{txt:)}}    {ralign 12:{txt:(}0.00251{txt:)}}    {ralign 12:{txt:(}0.00254{txt:)}}    {ralign 12:{txt:(}0.00323{txt:)}}    {ralign 12:{txt:(}0.00258{txt:)}}   {txt}

{txt}3.MoB#c.PGS {res}       -0.103***        0.100***        0.126***      -0.0126***       0.0448***{txt}
            {res} {ralign 12:{txt:(}0.00599{txt:)}}    {ralign 12:{txt:(}0.00214{txt:)}}    {ralign 12:{txt:(}0.00215{txt:)}}    {ralign 12:{txt:(}0.00351{txt:)}}    {ralign 12:{txt:(}0.00198{txt:)}}   {txt}

{txt}4.MoB#c.PGS {res}     -0.00445          0.0495***       0.0167***     0.000758          0.0196***{txt}
            {res} {ralign 12:{txt:(}0.00860{txt:)}}    {ralign 12:{txt:(}0.00540{txt:)}}    {ralign 12:{txt:(}0.00346{txt:)}}    {ralign 12:{txt:(}0.00332{txt:)}}    {ralign 12:{txt:(}0.00394{txt:)}}   {txt}

{txt}5.MoB#c.PGS {res}       0.0843***       0.0888***       0.0760***       0.0314***       0.0883***{txt}
            {res} {ralign 12:{txt:(}0.00698{txt:)}}    {ralign 12:{txt:(}0.00258{txt:)}}    {ralign 12:{txt:(}0.00230{txt:)}}    {ralign 12:{txt:(}0.00254{txt:)}}    {ralign 12:{txt:(}0.00163{txt:)}}   {txt}

{txt}6.MoB#c.PGS {res}        0.233***       0.0201***      0.00984***      -0.0251***      -0.0682***{txt}
            {res} {ralign 12:{txt:(}0.00372{txt:)}}    {ralign 12:{txt:(}0.00181{txt:)}}    {ralign 12:{txt:(}0.00157{txt:)}}    {ralign 12:{txt:(}0.00175{txt:)}}    {ralign 12:{txt:(}0.00206{txt:)}}   {txt}

{txt}7.MoB#c.PGS {res}        0.172***       0.0543***      -0.0186***       0.0177***       0.0127***{txt}
            {res} {ralign 12:{txt:(}0.00789{txt:)}}    {ralign 12:{txt:(}0.00309{txt:)}}    {ralign 12:{txt:(}0.00237{txt:)}}    {ralign 12:{txt:(}0.00323{txt:)}}    {ralign 12:{txt:(}0.00260{txt:)}}   {txt}

{txt}8.MoB#c.PGS {res}       0.0531***       0.0636***       0.0224***       0.0433***      0.00739** {txt}
            {res} {ralign 12:{txt:(}0.00249{txt:)}}    {ralign 12:{txt:(}0.00302{txt:)}}    {ralign 12:{txt:(}0.00265{txt:)}}    {ralign 12:{txt:(}0.00260{txt:)}}    {ralign 12:{txt:(}0.00321{txt:)}}   {txt}

{txt}9.MoB#c.PGS {res}            0               0               0               0               0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}10.MoB#c.PGS{res}        0.116***       0.0547***      -0.0110***       0.0644***       0.0295***{txt}
            {res} {ralign 12:{txt:(}0.00776{txt:)}}    {ralign 12:{txt:(}0.00361{txt:)}}    {ralign 12:{txt:(}0.00231{txt:)}}    {ralign 12:{txt:(}0.00326{txt:)}}    {ralign 12:{txt:(}0.00261{txt:)}}   {txt}

{txt}11.MoB#c.PGS{res}        0.144***       0.0587***       0.0539***       0.0905***       0.0374***{txt}
            {res} {ralign 12:{txt:(}0.00622{txt:)}}    {ralign 12:{txt:(}0.00253{txt:)}}    {ralign 12:{txt:(}0.00305{txt:)}}    {ralign 12:{txt:(}0.00298{txt:)}}    {ralign 12:{txt:(}0.00245{txt:)}}   {txt}

{txt}12.MoB#c.PGS{res}       0.0870***       0.0383***       0.0436***       0.0325***      -0.0321***{txt}
            {res} {ralign 12:{txt:(}0.00708{txt:)}}    {ralign 12:{txt:(}0.00237{txt:)}}    {ralign 12:{txt:(}0.00213{txt:)}}    {ralign 12:{txt:(}0.00196{txt:)}}    {ralign 12:{txt:(}0.00227{txt:)}}   {txt}

{txt}1.MoB       {res}       -0.203***       -0.183***      -0.0387***      0.00761**        0.0492***{txt}
            {res} {ralign 12:{txt:(}0.00574{txt:)}}    {ralign 12:{txt:(}0.00316{txt:)}}    {ralign 12:{txt:(}0.00290{txt:)}}    {ralign 12:{txt:(}0.00249{txt:)}}    {ralign 12:{txt:(}0.00170{txt:)}}   {txt}

{txt}2.MoB       {res}       -0.543***       -0.312***       -0.232***       -0.114***      -0.0924***{txt}
            {res} {ralign 12:{txt:(}0.00553{txt:)}}    {ralign 12:{txt:(}0.00283{txt:)}}    {ralign 12:{txt:(}0.000699{txt:)}}    {ralign 12:{txt:(}0.00295{txt:)}}    {ralign 12:{txt:(}0.00160{txt:)}}   {txt}

{txt}3.MoB       {res}       -0.644***       -0.374***       -0.205***      -0.0639***       -0.148***{txt}
            {res} {ralign 12:{txt:(}0.00897{txt:)}}    {ralign 12:{txt:(}0.00188{txt:)}}    {ralign 12:{txt:(}0.00186{txt:)}}    {ralign 12:{txt:(}0.00230{txt:)}}    {ralign 12:{txt:(}0.00114{txt:)}}   {txt}

{txt}4.MoB       {res}       -0.444***       -0.344***       -0.132***       -0.113***      -0.0858***{txt}
            {res} {ralign 12:{txt:(}0.00855{txt:)}}    {ralign 12:{txt:(}0.00135{txt:)}}    {ralign 12:{txt:(}0.00199{txt:)}}    {ralign 12:{txt:(}0.00210{txt:)}}    {ralign 12:{txt:(}0.00199{txt:)}}   {txt}

{txt}5.MoB       {res}       -0.737***       -0.457***       -0.160***      -0.0724***      0.00806***{txt}
            {res} {ralign 12:{txt:(}0.00587{txt:)}}    {ralign 12:{txt:(}0.00200{txt:)}}    {ralign 12:{txt:(}0.00244{txt:)}}    {ralign 12:{txt:(}0.00233{txt:)}}    {ralign 12:{txt:(}0.00173{txt:)}}   {txt}

{txt}6.MoB       {res}       -0.670***       -0.458***       -0.102***      -0.0844***      -0.0833***{txt}
            {res} {ralign 12:{txt:(}0.00606{txt:)}}    {ralign 12:{txt:(}0.00237{txt:)}}    {ralign 12:{txt:(}0.00190{txt:)}}    {ralign 12:{txt:(}0.00174{txt:)}}    {ralign 12:{txt:(}0.00205{txt:)}}   {txt}

{txt}7.MoB       {res}       -1.002***       -0.518***       -0.239***       -0.167***       -0.117***{txt}
            {res} {ralign 12:{txt:(}0.00618{txt:)}}    {ralign 12:{txt:(}0.00127{txt:)}}    {ralign 12:{txt:(}0.00240{txt:)}}    {ralign 12:{txt:(}0.00158{txt:)}}    {ralign 12:{txt:(}0.00143{txt:)}}   {txt}

{txt}8.MoB       {res}       -0.970***       -0.649***       -0.301***       -0.144***       -0.129***{txt}
            {res} {ralign 12:{txt:(}0.00849{txt:)}}    {ralign 12:{txt:(}0.00209{txt:)}}    {ralign 12:{txt:(}0.00260{txt:)}}    {ralign 12:{txt:(}0.00150{txt:)}}    {ralign 12:{txt:(}0.00183{txt:)}}   {txt}

{txt}9.MoB       {res}            0               0               0               0               0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}10.MoB      {res}       -0.132***      -0.0315***       0.0266***        0.112***       0.0625***{txt}
            {res} {ralign 12:{txt:(}0.00506{txt:)}}    {ralign 12:{txt:(}0.00118{txt:)}}    {ralign 12:{txt:(}0.00127{txt:)}}    {ralign 12:{txt:(}0.00158{txt:)}}    {ralign 12:{txt:(}0.00161{txt:)}}   {txt}

{txt}11.MoB      {res}       -0.163***      -0.0397***       0.0233***       0.0358***       0.0381***{txt}
            {res} {ralign 12:{txt:(}0.00773{txt:)}}    {ralign 12:{txt:(}0.00169{txt:)}}    {ralign 12:{txt:(}0.00192{txt:)}}    {ralign 12:{txt:(}0.00235{txt:)}}    {ralign 12:{txt:(}0.00180{txt:)}}   {txt}

{txt}12.MoB      {res}       -0.303***      -0.0651***      -0.0399***      0.00113         0.00297*  {txt}
            {res} {ralign 12:{txt:(}0.00435{txt:)}}    {ralign 12:{txt:(}0.00174{txt:)}}    {ralign 12:{txt:(}0.00286{txt:)}}    {ralign 12:{txt:(}0.00190{txt:)}}    {ralign 12:{txt:(}0.00150{txt:)}}   {txt}

{txt}PGS         {res}       0.0433***        0.197***        0.282***        0.283***        0.110***{txt}
            {res} {ralign 12:{txt:(}0.00528{txt:)}}    {ralign 12:{txt:(}0.00170{txt:)}}    {ralign 12:{txt:(}0.00170{txt:)}}    {ralign 12:{txt:(}0.00198{txt:)}}    {ralign 12:{txt:(}0.00134{txt:)}}   {txt}
{txt}{hline 92}
{txt}N           {res}         1826            5734            6075            5240            7268   {txt}
{txt}{hline 92}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. *esttab         m1 m2 m3 m4 m5 using "${c -(}dirtables{c )-}/MoB_GxE.tex", replace ///
>         frag bookt b(3) se(3) keep(*.MoB#c.PGS *.MoB PGS) drop(9.MoB 9.MoB#c.PGS) star(* 0.10 ** 0.05 *** 0.01) ///
>         mtitles("Age 4" "Age 7" "Age 11" "Age 14" "Age 16") ///
>         stats(r2 N, label("R2" "Observations") fmt(3 0)) nonotes coeflabel(1.MoB "Jan" 2.MoB "Feb" 3.MoB "Mar" 4.MoB "Apr" 5.MoB "May" 6.MoB "Jun" 7.MoB "Jul" 9.MoB "Sep" 10.MoB "Oct" 11.MoB "Nov" 12.MoB "Dec" PGS "PGS" 1.MoB#c.PGS "Jan*PGS" 2.MoB#c.PGS "Feb*PGS" 3.MoB#c.PGS "Mar*PGS" 4.MoB#c.PGS "Apr*PGS" 5.MoB#c.PGS "May*PGS" 6.MoB#c.PGS "Jun*PGS" 7.MoB#c.PGS "Jul*PGS" 9.MoB#c.PGS "Sep*PGS" 10.MoB#c.PGS "Oct*PGS" 11.MoB#c.PGS "Nov*PGS" 12.MoB#c.PGS "Dec*PGS" ) 
. 
. 
. eststo  m1: reg ea  ib1.MoBnew#c.PGS ib1.MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     1,826
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1941
                                                {txt}Root MSE          =    {res} .89579

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}          ea{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
MoBnew#c.PGS {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2} .1155557{col 26}{space 2} .0077626{col 37}{space 1}   14.89{col 46}{space 3}0.000{col 54}{space 4} .0984702{col 67}{space 3} .1326411
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .1436643{col 26}{space 2} .0062181{col 37}{space 1}   23.10{col 46}{space 3}0.000{col 54}{space 4} .1299782{col 67}{space 3} .1573503
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}     .087{col 26}{space 2} .0070811{col 37}{space 1}   12.29{col 46}{space 3}0.000{col 54}{space 4} .0714146{col 67}{space 3} .1025854
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2} .0501204{col 26}{space 2} .0114857{col 37}{space 1}    4.36{col 46}{space 3}0.001{col 54}{space 4} .0248405{col 67}{space 3} .0754003
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .2238672{col 26}{space 2} .0083747{col 37}{space 1}   26.73{col 46}{space 3}0.000{col 54}{space 4} .2054347{col 67}{space 3} .2422998
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.1029665{col 26}{space 2} .0059864{col 37}{space 1}  -17.20{col 46}{space 3}0.000{col 54}{space 4}-.1161424{col 67}{space 3}-.0897906
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.0044496{col 26}{space 2} .0086036{col 37}{space 1}   -0.52{col 46}{space 3}0.615{col 54}{space 4}-.0233861{col 67}{space 3} .0144869
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0843366{col 26}{space 2} .0069822{col 37}{space 1}   12.08{col 46}{space 3}0.000{col 54}{space 4}  .068969{col 67}{space 3} .0997043
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .2329899{col 26}{space 2} .0037239{col 37}{space 1}   62.57{col 46}{space 3}0.000{col 54}{space 4} .2247936{col 67}{space 3} .2411862
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}  .172184{col 26}{space 2} .0078942{col 37}{space 1}   21.81{col 46}{space 3}0.000{col 54}{space 4}  .154809{col 67}{space 3} .1895591
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} .0531349{col 26}{space 2} .0024862{col 37}{space 1}   21.37{col 46}{space 3}0.000{col 54}{space 4} .0476627{col 67}{space 3}  .058607
{txt}{space 12} {c |}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2}-.1322282{col 26}{space 2} .0050589{col 37}{space 1}  -26.14{col 46}{space 3}0.000{col 54}{space 4}-.1433629{col 67}{space 3}-.1210936
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}-.1627945{col 26}{space 2} .0077293{col 37}{space 1}  -21.06{col 46}{space 3}0.000{col 54}{space 4}-.1798065{col 67}{space 3}-.1457825
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.3033789{col 26}{space 2}   .00435{col 37}{space 1}  -69.74{col 46}{space 3}0.000{col 54}{space 4}-.3129532{col 67}{space 3}-.2938046
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}-.2031382{col 26}{space 2}  .005739{col 37}{space 1}  -35.40{col 46}{space 3}0.000{col 54}{space 4}-.2157696{col 67}{space 3}-.1905069
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.5434785{col 26}{space 2} .0055291{col 37}{space 1}  -98.29{col 46}{space 3}0.000{col 54}{space 4}-.5556479{col 67}{space 3}-.5313091
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.6441946{col 26}{space 2} .0089699{col 37}{space 1}  -71.82{col 46}{space 3}0.000{col 54}{space 4}-.6639371{col 67}{space 3} -.624452
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.4442214{col 26}{space 2} .0085463{col 37}{space 1}  -51.98{col 46}{space 3}0.000{col 54}{space 4}-.4630316{col 67}{space 3}-.4254112
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.7367509{col 26}{space 2}  .005869{col 37}{space 1} -125.53{col 46}{space 3}0.000{col 54}{space 4}-.7496686{col 67}{space 3}-.7238332
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.6704823{col 26}{space 2} .0060621{col 37}{space 1} -110.60{col 46}{space 3}0.000{col 54}{space 4}-.6838249{col 67}{space 3}-.6571396
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} -1.00181{col 26}{space 2} .0061811{col 37}{space 1} -162.08{col 46}{space 3}0.000{col 54}{space 4}-1.015415{col 67}{space 3}-.9882058
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.9698667{col 26}{space 2} .0084934{col 37}{space 1} -114.19{col 46}{space 3}0.000{col 54}{space 4}-.9885606{col 67}{space 3}-.9511728
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .0433448{col 26}{space 2} .0052819{col 37}{space 1}    8.21{col 46}{space 3}0.000{col 54}{space 4} .0317195{col 67}{space 3} .0549701
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3826527{col 26}{space 2} .0326372{col 37}{space 1}  -11.72{col 46}{space 3}0.000{col 54}{space 4}-.4544867{col 67}{space 3}-.3108187
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-3.656964{col 26}{space 2} 1.437728{col 37}{space 1}   -2.54{col 46}{space 3}0.027{col 54}{space 4}-6.821382{col 67}{space 3}-.4925456
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} 3.288473{col 26}{space 2} 2.440657{col 37}{space 1}    1.35{col 46}{space 3}0.205{col 54}{space 4}-2.083378{col 67}{space 3} 8.660323
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2} .5821543{col 26}{space 2} 1.534046{col 37}{space 1}    0.38{col 46}{space 3}0.712{col 54}{space 4}-2.794257{col 67}{space 3} 3.958566
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2}-1.967853{col 26}{space 2} 1.894557{col 37}{space 1}   -1.04{col 46}{space 3}0.321{col 54}{space 4}-6.137744{col 67}{space 3} 2.202038
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-.9945495{col 26}{space 2} 2.714534{col 37}{space 1}   -0.37{col 46}{space 3}0.721{col 54}{space 4}-6.969198{col 67}{space 3} 4.980099
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}  1.55655{col 26}{space 2} 1.643175{col 37}{space 1}    0.95{col 46}{space 3}0.364{col 54}{space 4}-2.060055{col 67}{space 3} 5.173155
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.357409{col 26}{space 2}  2.04847{col 37}{space 1}    0.66{col 46}{space 3}0.521{col 54}{space 4}-3.151244{col 67}{space 3} 5.866061
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-2.541337{col 26}{space 2} 1.544869{col 37}{space 1}   -1.65{col 46}{space 3}0.128{col 54}{space 4} -5.94157{col 67}{space 3} .8588959
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2} -1.88773{col 26}{space 2} 1.960699{col 37}{space 1}   -0.96{col 46}{space 3}0.356{col 54}{space 4}-6.203198{col 67}{space 3} 2.427738
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.7623456{col 26}{space 2} 1.916302{col 37}{space 1}   -0.40{col 46}{space 3}0.698{col 54}{space 4}-4.980099{col 67}{space 3} 3.455408
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .727297{col 26}{space 2} .0154382{col 37}{space 1}   47.11{col 46}{space 3}0.000{col 54}{space 4} .6933177{col 67}{space 3} .7612763
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m2: reg ks1 ib1.MoBnew#c.PGS ib1.MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,734
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1388
                                                {txt}Root MSE          =    {res} .91415

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
MoBnew#c.PGS {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2} .0547301{col 26}{space 2} .0036125{col 37}{space 1}   15.15{col 46}{space 3}0.000{col 54}{space 4} .0467791{col 67}{space 3} .0626811
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0587424{col 26}{space 2} .0025342{col 37}{space 1}   23.18{col 46}{space 3}0.000{col 54}{space 4} .0531648{col 67}{space 3} .0643201
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0382814{col 26}{space 2} .0023667{col 37}{space 1}   16.18{col 46}{space 3}0.000{col 54}{space 4} .0330724{col 67}{space 3} .0434904
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}-.0199354{col 26}{space 2}  .001704{col 37}{space 1}  -11.70{col 46}{space 3}0.000{col 54}{space 4}-.0236859{col 67}{space 3}-.0161849
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .0522298{col 26}{space 2} .0025051{col 37}{space 1}   20.85{col 46}{space 3}0.000{col 54}{space 4} .0467161{col 67}{space 3} .0577436
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .1004373{col 26}{space 2} .0021392{col 37}{space 1}   46.95{col 46}{space 3}0.000{col 54}{space 4} .0957289{col 67}{space 3} .1051458
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0494901{col 26}{space 2} .0054018{col 37}{space 1}    9.16{col 46}{space 3}0.000{col 54}{space 4} .0376007{col 67}{space 3} .0613794
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0887859{col 26}{space 2}  .002575{col 37}{space 1}   34.48{col 46}{space 3}0.000{col 54}{space 4} .0831183{col 67}{space 3} .0944535
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .0201478{col 26}{space 2} .0018134{col 37}{space 1}   11.11{col 46}{space 3}0.000{col 54}{space 4} .0161565{col 67}{space 3}  .024139
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .0542623{col 26}{space 2} .0030884{col 37}{space 1}   17.57{col 46}{space 3}0.000{col 54}{space 4} .0474648{col 67}{space 3} .0610599
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} .0635881{col 26}{space 2} .0030154{col 37}{space 1}   21.09{col 46}{space 3}0.000{col 54}{space 4} .0569513{col 67}{space 3} .0702248
{txt}{space 12} {c |}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2}-.0314561{col 26}{space 2} .0011834{col 37}{space 1}  -26.58{col 46}{space 3}0.000{col 54}{space 4}-.0340608{col 67}{space 3}-.0288513
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}-.0397169{col 26}{space 2} .0016921{col 37}{space 1}  -23.47{col 46}{space 3}0.000{col 54}{space 4}-.0434412{col 67}{space 3}-.0359926
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0651481{col 26}{space 2}  .001737{col 37}{space 1}  -37.51{col 46}{space 3}0.000{col 54}{space 4}-.0689711{col 67}{space 3} -.061325
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}  -.18348{col 26}{space 2} .0031568{col 37}{space 1}  -58.12{col 46}{space 3}0.000{col 54}{space 4}-.1904281{col 67}{space 3}-.1765319
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} -.311623{col 26}{space 2} .0028321{col 37}{space 1} -110.03{col 46}{space 3}0.000{col 54}{space 4}-.3178564{col 67}{space 3}-.3053895
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.3744235{col 26}{space 2} .0018794{col 37}{space 1} -199.23{col 46}{space 3}0.000{col 54}{space 4}-.3785599{col 67}{space 3} -.370287
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.3441075{col 26}{space 2} .0013534{col 37}{space 1} -254.26{col 46}{space 3}0.000{col 54}{space 4}-.3470863{col 67}{space 3}-.3411287
{txt}{space 8}May  {c |}{col 14}{res}{space 2} -.457148{col 26}{space 2} .0020018{col 37}{space 1} -228.37{col 46}{space 3}0.000{col 54}{space 4}-.4615539{col 67}{space 3} -.452742
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.4580599{col 26}{space 2} .0023678{col 37}{space 1} -193.46{col 46}{space 3}0.000{col 54}{space 4}-.4632713{col 67}{space 3}-.4528485
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.5178467{col 26}{space 2} .0012689{col 37}{space 1} -408.10{col 46}{space 3}0.000{col 54}{space 4}-.5206396{col 67}{space 3}-.5150539
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.648957{col 26}{space 2} .0020866{col 37}{space 1} -311.01{col 46}{space 3}0.000{col 54}{space 4}-.6535496{col 67}{space 3}-.6443643
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .1974767{col 26}{space 2} .0017048{col 37}{space 1}  115.84{col 46}{space 3}0.000{col 54}{space 4} .1937245{col 67}{space 3} .2012289
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.3053262{col 26}{space 2} .0216567{col 37}{space 1}  -14.10{col 46}{space 3}0.000{col 54}{space 4}-.3529922{col 67}{space 3}-.2576601
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-1.268627{col 26}{space 2} 1.176761{col 37}{space 1}   -1.08{col 46}{space 3}0.304{col 54}{space 4}-3.858661{col 67}{space 3} 1.321408
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.7062516{col 26}{space 2} .7622061{col 37}{space 1}   -0.93{col 46}{space 3}0.374{col 54}{space 4}-2.383856{col 67}{space 3} .9713526
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}-1.138282{col 26}{space 2} .4864641{col 37}{space 1}   -2.34{col 46}{space 3}0.039{col 54}{space 4}-2.208982{col 67}{space 3}-.0675818
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} .9578814{col 26}{space 2} 1.110127{col 37}{space 1}    0.86{col 46}{space 3}0.407{col 54}{space 4}-1.485493{col 67}{space 3} 3.401255
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.223518{col 26}{space 2} 1.068844{col 37}{space 1}   -1.14{col 46}{space 3}0.277{col 54}{space 4}-3.576029{col 67}{space 3} 1.128992
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2} .1124537{col 26}{space 2} 1.104964{col 37}{space 1}    0.10{col 46}{space 3}0.921{col 54}{space 4}-2.319556{col 67}{space 3} 2.544463
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.457653{col 26}{space 2} 1.331374{col 37}{space 1}    1.09{col 46}{space 3}0.297{col 54}{space 4}-1.472682{col 67}{space 3} 4.387987
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.6282988{col 26}{space 2} .8515547{col 37}{space 1}   -0.74{col 46}{space 3}0.476{col 54}{space 4}-2.502558{col 67}{space 3}  1.24596
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-2.583014{col 26}{space 2} .8845357{col 37}{space 1}   -2.92{col 46}{space 3}0.014{col 54}{space 4}-4.529864{col 67}{space 3}-.6361637
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .1660871{col 26}{space 2}  .928371{col 37}{space 1}    0.18{col 46}{space 3}0.861{col 54}{space 4}-1.877244{col 67}{space 3} 2.209418
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4920728{col 26}{space 2} .0112651{col 37}{space 1}   43.68{col 46}{space 3}0.000{col 54}{space 4} .4672785{col 67}{space 3} .5168672
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m3: reg ks2 ib1.MoBnew#c.PGS ib1.MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     6,075
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1147
                                                {txt}Root MSE          =    {res} .93062

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
MoBnew#c.PGS {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2}-.0109858{col 26}{space 2} .0023092{col 37}{space 1}   -4.76{col 46}{space 3}0.001{col 54}{space 4}-.0160684{col 67}{space 3}-.0059032
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2}  .053902{col 26}{space 2} .0030452{col 37}{space 1}   17.70{col 46}{space 3}0.000{col 54}{space 4} .0471995{col 67}{space 3} .0606044
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0435771{col 26}{space 2} .0021307{col 37}{space 1}   20.45{col 46}{space 3}0.000{col 54}{space 4} .0388874{col 67}{space 3} .0482668
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}-.0551966{col 26}{space 2} .0023252{col 37}{space 1}  -23.74{col 46}{space 3}0.000{col 54}{space 4}-.0603145{col 67}{space 3}-.0500788
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .1051535{col 26}{space 2} .0025421{col 37}{space 1}   41.37{col 46}{space 3}0.000{col 54}{space 4} .0995585{col 67}{space 3} .1107485
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .1255069{col 26}{space 2} .0021481{col 37}{space 1}   58.43{col 46}{space 3}0.000{col 54}{space 4} .1207789{col 67}{space 3} .1302349
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0166602{col 26}{space 2} .0034642{col 37}{space 1}    4.81{col 46}{space 3}0.001{col 54}{space 4} .0090354{col 67}{space 3} .0242849
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0759979{col 26}{space 2} .0023041{col 37}{space 1}   32.98{col 46}{space 3}0.000{col 54}{space 4} .0709265{col 67}{space 3} .0810693
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} .0098439{col 26}{space 2} .0015667{col 37}{space 1}    6.28{col 46}{space 3}0.000{col 54}{space 4} .0063957{col 67}{space 3} .0132921
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.0185856{col 26}{space 2} .0023692{col 37}{space 1}   -7.84{col 46}{space 3}0.000{col 54}{space 4}-.0238001{col 67}{space 3}-.0133711
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} .0223759{col 26}{space 2} .0026484{col 37}{space 1}    8.45{col 46}{space 3}0.000{col 54}{space 4} .0165468{col 67}{space 3} .0282051
{txt}{space 12} {c |}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2} .0265693{col 26}{space 2} .0012662{col 37}{space 1}   20.98{col 46}{space 3}0.000{col 54}{space 4} .0237825{col 67}{space 3} .0293562
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0232523{col 26}{space 2} .0019235{col 37}{space 1}   12.09{col 46}{space 3}0.000{col 54}{space 4} .0190186{col 67}{space 3} .0274859
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0398832{col 26}{space 2} .0028604{col 37}{space 1}  -13.94{col 46}{space 3}0.000{col 54}{space 4}-.0461788{col 67}{space 3}-.0335875
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}-.0387394{col 26}{space 2} .0028983{col 37}{space 1}  -13.37{col 46}{space 3}0.000{col 54}{space 4}-.0451186{col 67}{space 3}-.0323602
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.2315176{col 26}{space 2} .0006989{col 37}{space 1} -331.25{col 46}{space 3}0.000{col 54}{space 4} -.233056{col 67}{space 3}-.2299793
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.2048818{col 26}{space 2} .0018646{col 37}{space 1} -109.88{col 46}{space 3}0.000{col 54}{space 4}-.2089859{col 67}{space 3}-.2007778
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} -.131998{col 26}{space 2} .0019914{col 37}{space 1}  -66.28{col 46}{space 3}0.000{col 54}{space 4}-.1363812{col 67}{space 3}-.1276149
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.1600048{col 26}{space 2} .0024424{col 37}{space 1}  -65.51{col 46}{space 3}0.000{col 54}{space 4}-.1653805{col 67}{space 3}-.1546292
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.1017441{col 26}{space 2} .0018954{col 37}{space 1}  -53.68{col 46}{space 3}0.000{col 54}{space 4}-.1059159{col 67}{space 3}-.0975724
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.2385789{col 26}{space 2} .0024048{col 37}{space 1}  -99.21{col 46}{space 3}0.000{col 54}{space 4}-.2438719{col 67}{space 3} -.233286
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} -.300834{col 26}{space 2} .0025965{col 37}{space 1} -115.86{col 46}{space 3}0.000{col 54}{space 4}-.3065488{col 67}{space 3}-.2951192
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .2818904{col 26}{space 2} .0016996{col 37}{space 1}  165.86{col 46}{space 3}0.000{col 54}{space 4} .2781496{col 67}{space 3} .2856311
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1192604{col 26}{space 2} .0220955{col 37}{space 1}   -5.40{col 46}{space 3}0.000{col 54}{space 4}-.1678923{col 67}{space 3}-.0706286
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2}-.7212056{col 26}{space 2} .9189741{col 37}{space 1}   -0.78{col 46}{space 3}0.449{col 54}{space 4}-2.743854{col 67}{space 3} 1.301443
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2} .9962718{col 26}{space 2}  .875419{col 37}{space 1}    1.14{col 46}{space 3}0.279{col 54}{space 4}-.9305124{col 67}{space 3} 2.923056
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}-.1025714{col 26}{space 2} .7335334{col 37}{space 1}   -0.14{col 46}{space 3}0.891{col 54}{space 4}-1.717068{col 67}{space 3} 1.511925
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 2.363871{col 26}{space 2} 1.171347{col 37}{space 1}    2.02{col 46}{space 3}0.069{col 54}{space 4}-.2142464{col 67}{space 3} 4.941988
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-1.304872{col 26}{space 2} 1.201941{col 37}{space 1}   -1.09{col 46}{space 3}0.301{col 54}{space 4}-3.950326{col 67}{space 3} 1.340583
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-.5164942{col 26}{space 2} 1.050459{col 37}{space 1}   -0.49{col 46}{space 3}0.633{col 54}{space 4}-2.828539{col 67}{space 3} 1.795551
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 1.255386{col 26}{space 2} 1.114329{col 37}{space 1}    1.13{col 46}{space 3}0.284{col 54}{space 4}-1.197235{col 67}{space 3} 3.708007
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-1.483925{col 26}{space 2} 1.079149{col 37}{space 1}   -1.38{col 46}{space 3}0.196{col 54}{space 4}-3.859117{col 67}{space 3} .8912663
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-2.161754{col 26}{space 2} 1.426204{col 37}{space 1}   -1.52{col 46}{space 3}0.158{col 54}{space 4}-5.300809{col 67}{space 3} .9773007
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2} .3437562{col 26}{space 2}  .883709{col 37}{space 1}    0.39{col 46}{space 3}0.705{col 54}{space 4}-1.601274{col 67}{space 3} 2.288787
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .205746{col 26}{space 2} .0110487{col 37}{space 1}   18.62{col 46}{space 3}0.000{col 54}{space 4}  .181428{col 67}{space 3} .2300639
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m4: reg ks3 ib1.MoBnew#c.PGS ib1.MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,240
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1112
                                                {txt}Root MSE          =    {res} .94229

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks3{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
MoBnew#c.PGS {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2} .0643827{col 26}{space 2} .0032635{col 37}{space 1}   19.73{col 46}{space 3}0.000{col 54}{space 4} .0571998{col 67}{space 3} .0715657
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0904782{col 26}{space 2} .0029845{col 37}{space 1}   30.32{col 46}{space 3}0.000{col 54}{space 4} .0839094{col 67}{space 3} .0970469
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0324914{col 26}{space 2} .0019616{col 37}{space 1}   16.56{col 46}{space 3}0.000{col 54}{space 4} .0281739{col 67}{space 3} .0368089
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2} .0237659{col 26}{space 2} .0024878{col 37}{space 1}    9.55{col 46}{space 3}0.000{col 54}{space 4} .0182904{col 67}{space 3} .0292415
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .0771825{col 26}{space 2} .0032347{col 37}{space 1}   23.86{col 46}{space 3}0.000{col 54}{space 4} .0700628{col 67}{space 3} .0843021
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} -.012594{col 26}{space 2} .0035081{col 37}{space 1}   -3.59{col 46}{space 3}0.004{col 54}{space 4}-.0203152{col 67}{space 3}-.0048728
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0007577{col 26}{space 2} .0033209{col 37}{space 1}    0.23{col 46}{space 3}0.824{col 54}{space 4}-.0065515{col 67}{space 3} .0080668
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0313979{col 26}{space 2} .0025417{col 37}{space 1}   12.35{col 46}{space 3}0.000{col 54}{space 4} .0258038{col 67}{space 3} .0369921
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0251159{col 26}{space 2}  .001751{col 37}{space 1}  -14.34{col 46}{space 3}0.000{col 54}{space 4}-.0289698{col 67}{space 3}-.0212619
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .0177196{col 26}{space 2} .0032312{col 37}{space 1}    5.48{col 46}{space 3}0.000{col 54}{space 4} .0106078{col 67}{space 3} .0248313
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}  .043286{col 26}{space 2} .0025965{col 37}{space 1}   16.67{col 46}{space 3}0.000{col 54}{space 4} .0375711{col 67}{space 3} .0490009
{txt}{space 12} {c |}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2} .1117192{col 26}{space 2}  .001584{col 37}{space 1}   70.53{col 46}{space 3}0.000{col 54}{space 4} .1082329{col 67}{space 3} .1152056
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0358189{col 26}{space 2} .0023455{col 37}{space 1}   15.27{col 46}{space 3}0.000{col 54}{space 4} .0306565{col 67}{space 3} .0409813
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0011313{col 26}{space 2} .0018963{col 37}{space 1}    0.60{col 46}{space 3}0.563{col 54}{space 4}-.0030424{col 67}{space 3} .0053051
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2} .0076126{col 26}{space 2} .0024877{col 37}{space 1}    3.06{col 46}{space 3}0.011{col 54}{space 4} .0021371{col 67}{space 3}  .013088
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.1139932{col 26}{space 2} .0029518{col 37}{space 1}  -38.62{col 46}{space 3}0.000{col 54}{space 4}-.1204902{col 67}{space 3}-.1074963
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.0638688{col 26}{space 2} .0023013{col 37}{space 1}  -27.75{col 46}{space 3}0.000{col 54}{space 4}-.0689339{col 67}{space 3}-.0588038
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.1130537{col 26}{space 2} .0021035{col 37}{space 1}  -53.75{col 46}{space 3}0.000{col 54}{space 4}-.1176835{col 67}{space 3} -.108424
{txt}{space 8}May  {c |}{col 14}{res}{space 2}-.0723877{col 26}{space 2} .0023331{col 37}{space 1}  -31.03{col 46}{space 3}0.000{col 54}{space 4}-.0775228{col 67}{space 3}-.0672526
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0844078{col 26}{space 2} .0017359{col 37}{space 1}  -48.62{col 46}{space 3}0.000{col 54}{space 4}-.0882286{col 67}{space 3} -.080587
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.1671578{col 26}{space 2} .0015768{col 37}{space 1} -106.01{col 46}{space 3}0.000{col 54}{space 4}-.1706284{col 67}{space 3}-.1636872
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.1440115{col 26}{space 2} .0015002{col 37}{space 1}  -95.99{col 46}{space 3}0.000{col 54}{space 4}-.1473134{col 67}{space 3}-.1407095
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .2831064{col 26}{space 2} .0019805{col 37}{space 1}  142.95{col 46}{space 3}0.000{col 54}{space 4} .2787474{col 67}{space 3} .2874654
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.1639635{col 26}{space 2} .0197991{col 37}{space 1}   -8.28{col 46}{space 3}0.000{col 54}{space 4} -.207541{col 67}{space 3} -.120386
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} .1593847{col 26}{space 2} 1.274981{col 37}{space 1}    0.13{col 46}{space 3}0.903{col 54}{space 4}-2.646829{col 67}{space 3} 2.965599
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-.0787527{col 26}{space 2} 1.431089{col 37}{space 1}   -0.06{col 46}{space 3}0.957{col 54}{space 4}-3.228559{col 67}{space 3} 3.071054
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}  .086241{col 26}{space 2} 1.074595{col 37}{space 1}    0.08{col 46}{space 3}0.937{col 54}{space 4}-2.278926{col 67}{space 3} 2.451408
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2} 1.230818{col 26}{space 2} 1.258075{col 37}{space 1}    0.98{col 46}{space 3}0.349{col 54}{space 4}-1.538186{col 67}{space 3} 3.999822
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2} -1.95809{col 26}{space 2} 1.092737{col 37}{space 1}   -1.79{col 46}{space 3}0.101{col 54}{space 4}-4.363189{col 67}{space 3}  .447008
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-1.152603{col 26}{space 2} 1.449334{col 37}{space 1}   -0.80{col 46}{space 3}0.443{col 54}{space 4}-4.342566{col 67}{space 3}  2.03736
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} 2.277082{col 26}{space 2} .6421749{col 37}{space 1}    3.55{col 46}{space 3}0.005{col 54}{space 4} .8636645{col 67}{space 3} 3.690499
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2} -2.45882{col 26}{space 2} .8529712{col 37}{space 1}   -2.88{col 46}{space 3}0.015{col 54}{space 4}-4.336197{col 67}{space 3} -.581443
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-1.160615{col 26}{space 2} 1.174034{col 37}{space 1}   -0.99{col 46}{space 3}0.344{col 54}{space 4}-3.744646{col 67}{space 3} 1.423416
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.6927891{col 26}{space 2} .9216682{col 37}{space 1}   -0.75{col 46}{space 3}0.468{col 54}{space 4}-2.721367{col 67}{space 3} 1.335789
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1673147{col 26}{space 2} .0092282{col 37}{space 1}   18.13{col 46}{space 3}0.000{col 54}{space 4} .1470036{col 67}{space 3} .1876259
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m5: reg ks4 ib1.MoBnew#c.PGS ib1.MoBnew PGS male PC*, robust cluster(MoB) 

{txt}Linear regression                               Number of obs     = {res}     7,268
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0368
                                                {txt}Root MSE          =    {res} .98985

{txt}{ralign 78:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}         ks4{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
MoBnew#c.PGS {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2} .0295075{col 26}{space 2} .0026054{col 37}{space 1}   11.33{col 46}{space 3}0.000{col 54}{space 4} .0237732{col 67}{space 3} .0352419
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0374419{col 26}{space 2} .0024476{col 37}{space 1}   15.30{col 46}{space 3}0.000{col 54}{space 4} .0320548{col 67}{space 3}  .042829
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2}-.0321376{col 26}{space 2} .0022703{col 37}{space 1}  -14.16{col 46}{space 3}0.000{col 54}{space 4}-.0371344{col 67}{space 3}-.0271407
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}-.0281241{col 26}{space 2} .0019036{col 37}{space 1}  -14.77{col 46}{space 3}0.000{col 54}{space 4} -.032314{col 67}{space 3}-.0239343
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2} .0083322{col 26}{space 2} .0025756{col 37}{space 1}    3.24{col 46}{space 3}0.008{col 54}{space 4} .0026633{col 67}{space 3} .0140011
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2} .0448085{col 26}{space 2} .0019846{col 37}{space 1}   22.58{col 46}{space 3}0.000{col 54}{space 4} .0404404{col 67}{space 3} .0491765
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2} .0196093{col 26}{space 2} .0039438{col 37}{space 1}    4.97{col 46}{space 3}0.000{col 54}{space 4} .0109291{col 67}{space 3} .0282896
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0883047{col 26}{space 2}  .001631{col 37}{space 1}   54.14{col 46}{space 3}0.000{col 54}{space 4} .0847148{col 67}{space 3} .0918946
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2} -.068172{col 26}{space 2} .0020562{col 37}{space 1}  -33.15{col 46}{space 3}0.000{col 54}{space 4}-.0726977{col 67}{space 3}-.0636464
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2} .0126888{col 26}{space 2} .0025957{col 37}{space 1}    4.89{col 46}{space 3}0.000{col 54}{space 4} .0069757{col 67}{space 3} .0184018
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2} .0073864{col 26}{space 2} .0032094{col 37}{space 1}    2.30{col 46}{space 3}0.042{col 54}{space 4} .0003225{col 67}{space 3} .0144504
{txt}{space 12} {c |}
{space 6}MoBnew {c |}
{space 8}Oct  {c |}{col 14}{res}{space 2} .0624702{col 26}{space 2} .0016074{col 37}{space 1}   38.86{col 46}{space 3}0.000{col 54}{space 4} .0589323{col 67}{space 3}  .066008
{txt}{space 8}Nov  {c |}{col 14}{res}{space 2} .0381459{col 26}{space 2} .0017963{col 37}{space 1}   21.24{col 46}{space 3}0.000{col 54}{space 4} .0341922{col 67}{space 3} .0420996
{txt}{space 8}Dec  {c |}{col 14}{res}{space 2} .0029667{col 26}{space 2} .0014995{col 37}{space 1}    1.98{col 46}{space 3}0.073{col 54}{space 4}-.0003336{col 67}{space 3} .0062669
{txt}{space 8}Jan  {c |}{col 14}{res}{space 2}  .049167{col 26}{space 2} .0016977{col 37}{space 1}   28.96{col 46}{space 3}0.000{col 54}{space 4} .0454304{col 67}{space 3} .0529037
{txt}{space 8}Feb  {c |}{col 14}{res}{space 2}-.0923631{col 26}{space 2}    .0016{col 37}{space 1}  -57.73{col 46}{space 3}0.000{col 54}{space 4}-.0958846{col 67}{space 3}-.0888416
{txt}{space 8}Mar  {c |}{col 14}{res}{space 2}-.1483534{col 26}{space 2} .0011362{col 37}{space 1} -130.57{col 46}{space 3}0.000{col 54}{space 4}-.1508542{col 67}{space 3}-.1458526
{txt}{space 8}Apr  {c |}{col 14}{res}{space 2}-.0857843{col 26}{space 2} .0019872{col 37}{space 1}  -43.17{col 46}{space 3}0.000{col 54}{space 4}-.0901581{col 67}{space 3}-.0814106
{txt}{space 8}May  {c |}{col 14}{res}{space 2} .0080556{col 26}{space 2} .0017273{col 37}{space 1}    4.66{col 46}{space 3}0.001{col 54}{space 4} .0042539{col 67}{space 3} .0118574
{txt}{space 8}Jun  {c |}{col 14}{res}{space 2}-.0833249{col 26}{space 2} .0020502{col 37}{space 1}  -40.64{col 46}{space 3}0.000{col 54}{space 4}-.0878375{col 67}{space 3}-.0788124
{txt}{space 8}Jul  {c |}{col 14}{res}{space 2}-.1171275{col 26}{space 2} .0014292{col 37}{space 1}  -81.95{col 46}{space 3}0.000{col 54}{space 4}-.1202732{col 67}{space 3}-.1139817
{txt}{space 8}Aug  {c |}{col 14}{res}{space 2}-.1294467{col 26}{space 2} .0018331{col 37}{space 1}  -70.62{col 46}{space 3}0.000{col 54}{space 4}-.1334812{col 67}{space 3}-.1254121
{txt}{space 12} {c |}
{space 9}PGS {c |}{col 14}{res}{space 2} .1101767{col 26}{space 2} .0013433{col 37}{space 1}   82.02{col 46}{space 3}0.000{col 54}{space 4} .1072201{col 67}{space 3} .1131333
{txt}{space 8}male {c |}{col 14}{res}{space 2}-.2407772{col 26}{space 2} .0292698{col 37}{space 1}   -8.23{col 46}{space 3}0.000{col 54}{space 4}-.3051997{col 67}{space 3}-.1763547
{txt}{space 9}PC1 {c |}{col 14}{res}{space 2} -1.23068{col 26}{space 2} 1.193909{col 37}{space 1}   -1.03{col 46}{space 3}0.325{col 54}{space 4}-3.858456{col 67}{space 3} 1.397096
{txt}{space 9}PC2 {c |}{col 14}{res}{space 2}-1.414408{col 26}{space 2} .9854913{col 37}{space 1}   -1.44{col 46}{space 3}0.179{col 54}{space 4} -3.58346{col 67}{space 3}  .754644
{txt}{space 9}PC3 {c |}{col 14}{res}{space 2}  .373497{col 26}{space 2} .8767515{col 37}{space 1}    0.43{col 46}{space 3}0.678{col 54}{space 4} -1.55622{col 67}{space 3} 2.303214
{txt}{space 9}PC4 {c |}{col 14}{res}{space 2}  2.22934{col 26}{space 2} 1.159949{col 37}{space 1}    1.92{col 46}{space 3}0.081{col 54}{space 4}-.3236905{col 67}{space 3} 4.782371
{txt}{space 9}PC5 {c |}{col 14}{res}{space 2}-.4555073{col 26}{space 2} .7817848{col 37}{space 1}   -0.58{col 46}{space 3}0.572{col 54}{space 4}-2.176204{col 67}{space 3} 1.265189
{txt}{space 9}PC6 {c |}{col 14}{res}{space 2}-2.171593{col 26}{space 2} 1.127033{col 37}{space 1}   -1.93{col 46}{space 3}0.080{col 54}{space 4}-4.652176{col 67}{space 3} .3089897
{txt}{space 9}PC7 {c |}{col 14}{res}{space 2} .9124381{col 26}{space 2} 1.187339{col 37}{space 1}    0.77{col 46}{space 3}0.458{col 54}{space 4}-1.700877{col 67}{space 3} 3.525753
{txt}{space 9}PC8 {c |}{col 14}{res}{space 2}-.8833312{col 26}{space 2} .8475991{col 37}{space 1}   -1.04{col 46}{space 3}0.320{col 54}{space 4}-2.748884{col 67}{space 3} .9822219
{txt}{space 9}PC9 {c |}{col 14}{res}{space 2}-.5058573{col 26}{space 2} .8102578{col 37}{space 1}   -0.62{col 46}{space 3}0.545{col 54}{space 4}-2.289223{col 67}{space 3} 1.277508
{txt}{space 8}PC10 {c |}{col 14}{res}{space 2}-.3048878{col 26}{space 2} .6685591{col 37}{space 1}   -0.46{col 46}{space 3}0.657{col 54}{space 4}-1.776376{col 67}{space 3} 1.166601
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .1781002{col 26}{space 2} .0152178{col 37}{space 1}   11.70{col 46}{space 3}0.000{col 54}{space 4} .1446061{col 67}{space 3} .2115944
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab  m1 m2 m3 m4 m5, b se keep(*.MoBnew#c.PGS *.MoBnew PGS) star(* 0.10 ** 0.05 *** 0.01) stats(N, fmt(0))
{res}
{txt}{hline 92}
{txt}                      (1)             (2)             (3)             (4)             (5)   
{txt}                       ea             ks1             ks2             ks3             ks4   
{txt}{hline 92}
{txt}1.MoBnew#c~S{res}            0               0               0               0               0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.MoBnew#c~S{res}        0.116***       0.0547***      -0.0110***       0.0644***       0.0295***{txt}
            {res} {ralign 12:{txt:(}0.00776{txt:)}}    {ralign 12:{txt:(}0.00361{txt:)}}    {ralign 12:{txt:(}0.00231{txt:)}}    {ralign 12:{txt:(}0.00326{txt:)}}    {ralign 12:{txt:(}0.00261{txt:)}}   {txt}

{txt}3.MoBnew#c~S{res}        0.144***       0.0587***       0.0539***       0.0905***       0.0374***{txt}
            {res} {ralign 12:{txt:(}0.00622{txt:)}}    {ralign 12:{txt:(}0.00253{txt:)}}    {ralign 12:{txt:(}0.00305{txt:)}}    {ralign 12:{txt:(}0.00298{txt:)}}    {ralign 12:{txt:(}0.00245{txt:)}}   {txt}

{txt}4.MoBnew#c~S{res}       0.0870***       0.0383***       0.0436***       0.0325***      -0.0321***{txt}
            {res} {ralign 12:{txt:(}0.00708{txt:)}}    {ralign 12:{txt:(}0.00237{txt:)}}    {ralign 12:{txt:(}0.00213{txt:)}}    {ralign 12:{txt:(}0.00196{txt:)}}    {ralign 12:{txt:(}0.00227{txt:)}}   {txt}

{txt}5.MoBnew#c~S{res}       0.0501***      -0.0199***      -0.0552***       0.0238***      -0.0281***{txt}
            {res} {ralign 12:{txt:(}0.0115{txt:)}}    {ralign 12:{txt:(}0.00170{txt:)}}    {ralign 12:{txt:(}0.00233{txt:)}}    {ralign 12:{txt:(}0.00249{txt:)}}    {ralign 12:{txt:(}0.00190{txt:)}}   {txt}

{txt}6.MoBnew#c~S{res}        0.224***       0.0522***        0.105***       0.0772***      0.00833***{txt}
            {res} {ralign 12:{txt:(}0.00837{txt:)}}    {ralign 12:{txt:(}0.00251{txt:)}}    {ralign 12:{txt:(}0.00254{txt:)}}    {ralign 12:{txt:(}0.00323{txt:)}}    {ralign 12:{txt:(}0.00258{txt:)}}   {txt}

{txt}7.MoBnew#c~S{res}       -0.103***        0.100***        0.126***      -0.0126***       0.0448***{txt}
            {res} {ralign 12:{txt:(}0.00599{txt:)}}    {ralign 12:{txt:(}0.00214{txt:)}}    {ralign 12:{txt:(}0.00215{txt:)}}    {ralign 12:{txt:(}0.00351{txt:)}}    {ralign 12:{txt:(}0.00198{txt:)}}   {txt}

{txt}8.MoBnew#c~S{res}     -0.00445          0.0495***       0.0167***     0.000758          0.0196***{txt}
            {res} {ralign 12:{txt:(}0.00860{txt:)}}    {ralign 12:{txt:(}0.00540{txt:)}}    {ralign 12:{txt:(}0.00346{txt:)}}    {ralign 12:{txt:(}0.00332{txt:)}}    {ralign 12:{txt:(}0.00394{txt:)}}   {txt}

{txt}9.MoBnew#c~S{res}       0.0843***       0.0888***       0.0760***       0.0314***       0.0883***{txt}
            {res} {ralign 12:{txt:(}0.00698{txt:)}}    {ralign 12:{txt:(}0.00258{txt:)}}    {ralign 12:{txt:(}0.00230{txt:)}}    {ralign 12:{txt:(}0.00254{txt:)}}    {ralign 12:{txt:(}0.00163{txt:)}}   {txt}

{txt}10.MoBnew#~S{res}        0.233***       0.0201***      0.00984***      -0.0251***      -0.0682***{txt}
            {res} {ralign 12:{txt:(}0.00372{txt:)}}    {ralign 12:{txt:(}0.00181{txt:)}}    {ralign 12:{txt:(}0.00157{txt:)}}    {ralign 12:{txt:(}0.00175{txt:)}}    {ralign 12:{txt:(}0.00206{txt:)}}   {txt}

{txt}11.MoBnew#~S{res}        0.172***       0.0543***      -0.0186***       0.0177***       0.0127***{txt}
            {res} {ralign 12:{txt:(}0.00789{txt:)}}    {ralign 12:{txt:(}0.00309{txt:)}}    {ralign 12:{txt:(}0.00237{txt:)}}    {ralign 12:{txt:(}0.00323{txt:)}}    {ralign 12:{txt:(}0.00260{txt:)}}   {txt}

{txt}12.MoBnew#~S{res}       0.0531***       0.0636***       0.0224***       0.0433***      0.00739** {txt}
            {res} {ralign 12:{txt:(}0.00249{txt:)}}    {ralign 12:{txt:(}0.00302{txt:)}}    {ralign 12:{txt:(}0.00265{txt:)}}    {ralign 12:{txt:(}0.00260{txt:)}}    {ralign 12:{txt:(}0.00321{txt:)}}   {txt}

{txt}1.MoBnew    {res}            0               0               0               0               0   {txt}
            {res} {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.MoBnew    {res}       -0.132***      -0.0315***       0.0266***        0.112***       0.0625***{txt}
            {res} {ralign 12:{txt:(}0.00506{txt:)}}    {ralign 12:{txt:(}0.00118{txt:)}}    {ralign 12:{txt:(}0.00127{txt:)}}    {ralign 12:{txt:(}0.00158{txt:)}}    {ralign 12:{txt:(}0.00161{txt:)}}   {txt}

{txt}3.MoBnew    {res}       -0.163***      -0.0397***       0.0233***       0.0358***       0.0381***{txt}
            {res} {ralign 12:{txt:(}0.00773{txt:)}}    {ralign 12:{txt:(}0.00169{txt:)}}    {ralign 12:{txt:(}0.00192{txt:)}}    {ralign 12:{txt:(}0.00235{txt:)}}    {ralign 12:{txt:(}0.00180{txt:)}}   {txt}

{txt}4.MoBnew    {res}       -0.303***      -0.0651***      -0.0399***      0.00113         0.00297*  {txt}
            {res} {ralign 12:{txt:(}0.00435{txt:)}}    {ralign 12:{txt:(}0.00174{txt:)}}    {ralign 12:{txt:(}0.00286{txt:)}}    {ralign 12:{txt:(}0.00190{txt:)}}    {ralign 12:{txt:(}0.00150{txt:)}}   {txt}

{txt}5.MoBnew    {res}       -0.203***       -0.183***      -0.0387***      0.00761**        0.0492***{txt}
            {res} {ralign 12:{txt:(}0.00574{txt:)}}    {ralign 12:{txt:(}0.00316{txt:)}}    {ralign 12:{txt:(}0.00290{txt:)}}    {ralign 12:{txt:(}0.00249{txt:)}}    {ralign 12:{txt:(}0.00170{txt:)}}   {txt}

{txt}6.MoBnew    {res}       -0.543***       -0.312***       -0.232***       -0.114***      -0.0924***{txt}
            {res} {ralign 12:{txt:(}0.00553{txt:)}}    {ralign 12:{txt:(}0.00283{txt:)}}    {ralign 12:{txt:(}0.000699{txt:)}}    {ralign 12:{txt:(}0.00295{txt:)}}    {ralign 12:{txt:(}0.00160{txt:)}}   {txt}

{txt}7.MoBnew    {res}       -0.644***       -0.374***       -0.205***      -0.0639***       -0.148***{txt}
            {res} {ralign 12:{txt:(}0.00897{txt:)}}    {ralign 12:{txt:(}0.00188{txt:)}}    {ralign 12:{txt:(}0.00186{txt:)}}    {ralign 12:{txt:(}0.00230{txt:)}}    {ralign 12:{txt:(}0.00114{txt:)}}   {txt}

{txt}8.MoBnew    {res}       -0.444***       -0.344***       -0.132***       -0.113***      -0.0858***{txt}
            {res} {ralign 12:{txt:(}0.00855{txt:)}}    {ralign 12:{txt:(}0.00135{txt:)}}    {ralign 12:{txt:(}0.00199{txt:)}}    {ralign 12:{txt:(}0.00210{txt:)}}    {ralign 12:{txt:(}0.00199{txt:)}}   {txt}

{txt}9.MoBnew    {res}       -0.737***       -0.457***       -0.160***      -0.0724***      0.00806***{txt}
            {res} {ralign 12:{txt:(}0.00587{txt:)}}    {ralign 12:{txt:(}0.00200{txt:)}}    {ralign 12:{txt:(}0.00244{txt:)}}    {ralign 12:{txt:(}0.00233{txt:)}}    {ralign 12:{txt:(}0.00173{txt:)}}   {txt}

{txt}10.MoBnew   {res}       -0.670***       -0.458***       -0.102***      -0.0844***      -0.0833***{txt}
            {res} {ralign 12:{txt:(}0.00606{txt:)}}    {ralign 12:{txt:(}0.00237{txt:)}}    {ralign 12:{txt:(}0.00190{txt:)}}    {ralign 12:{txt:(}0.00174{txt:)}}    {ralign 12:{txt:(}0.00205{txt:)}}   {txt}

{txt}11.MoBnew   {res}       -1.002***       -0.518***       -0.239***       -0.167***       -0.117***{txt}
            {res} {ralign 12:{txt:(}0.00618{txt:)}}    {ralign 12:{txt:(}0.00127{txt:)}}    {ralign 12:{txt:(}0.00240{txt:)}}    {ralign 12:{txt:(}0.00158{txt:)}}    {ralign 12:{txt:(}0.00143{txt:)}}   {txt}

{txt}12.MoBnew   {res}       -0.970***       -0.649***       -0.301***       -0.144***       -0.129***{txt}
            {res} {ralign 12:{txt:(}0.00849{txt:)}}    {ralign 12:{txt:(}0.00209{txt:)}}    {ralign 12:{txt:(}0.00260{txt:)}}    {ralign 12:{txt:(}0.00150{txt:)}}    {ralign 12:{txt:(}0.00183{txt:)}}   {txt}

{txt}PGS         {res}       0.0433***        0.197***        0.282***        0.283***        0.110***{txt}
            {res} {ralign 12:{txt:(}0.00528{txt:)}}    {ralign 12:{txt:(}0.00170{txt:)}}    {ralign 12:{txt:(}0.00170{txt:)}}    {ralign 12:{txt:(}0.00198{txt:)}}    {ralign 12:{txt:(}0.00134{txt:)}}   {txt}
{txt}{hline 92}
{txt}N           {res}         1826            5734            6075            5240            7268   {txt}
{txt}{hline 92}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. esttab  m1 m2 m3 m4 m5 using "${c -(}dirtables{c )-}/MoB_GxE.tex", replace ///
>         frag bookt b(3) se(3) keep(*.MoBnew#c.PGS *MoBnew PGS) drop(1.MoBnew 1.MoBnew#c.PGS) star(* 0.10 ** 0.05 *** 0.01) ///
>         mtitles("Age 4" "Age 7" "Age 11" "Age 14" "Age 16") ///
>         stats(r2 N, label("R2" "Observations") fmt(3 0)) nonotes coeflabel(1.MoBnew "Sep" 2.MoBnew "Oct" 3.MoBnew "Nov" 4.MoBnew "Dec" 5.MoBnew "Jan" 6.MoBnew "Feb" 7.MoBnew "Mar" 8.MoBnew "Apr" 9.MoBnew "May" 10.MoBnew "Jun" 11.MoBnew "Jul" 12.MoBnew "Aug" 1.MoBnew#c.PGS "Sep*PGS" 2.MoBnew#c.PGS "Oct*PGS" 3.MoBnew#c.PGS "Nov*PGS" 4.MoBnew#c.PGS "Dec*PGS" 5.MoBnew#c.PGS "Jan*PGS" 6.MoBnew#c.PGS "Feb*PGS" 7.MoBnew#c.PGS "Mar*PGS" 8.MoBnew#c.PGS "Apr*PGS" 9.MoBnew#c.PGS "May*PGS" 10.MoBnew#c.PGS "Jun*PGS" 11.MoBnew#c.PGS "Jul*PGS" 12.MoBnew#c.PGS "Aug*PGS" PGS "PGS") 
{res}{txt}(output written to {browse  `"\\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/tables/MoB_GxE.tex"'})

{com}. 
. 
. * Continuous MoB
. eststo  m1: reg ea  c.MoBnew#c.PGS MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     1,826
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1793
                                                {txt}Root MSE          =    {res} .89897

{txt}{ralign 80:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}            ea{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
c.MoBnew#c.PGS {c |}{col 16}{res}{space 2} .0047178{col 28}{space 2} .0057609{col 39}{space 1}    0.82{col 48}{space 3}0.430{col 56}{space 4}-.0079619{col 69}{space 3} .0173974
{txt}{space 14} {c |}
{space 8}MoBnew {c |}{col 16}{res}{space 2}-.0876541{col 28}{space 2} .0054369{col 39}{space 1}  -16.12{col 48}{space 3}0.000{col 56}{space 4}-.0996206{col 69}{space 3}-.0756876
{txt}{space 11}PGS {c |}{col 16}{res}{space 2}  .104642{col 28}{space 2} .0402599{col 39}{space 1}    2.60{col 48}{space 3}0.025{col 56}{space 4} .0160306{col 69}{space 3} .1932533
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.3903618{col 28}{space 2} .0299078{col 39}{space 1}  -13.05{col 48}{space 3}0.000{col 56}{space 4}-.4561885{col 69}{space 3}-.3245351
{txt}{space 11}PC1 {c |}{col 16}{res}{space 2}-3.917197{col 28}{space 2} 1.592689{col 39}{space 1}   -2.46{col 48}{space 3}0.032{col 56}{space 4}-7.422682{col 69}{space 3}-.4117119
{txt}{space 11}PC2 {c |}{col 16}{res}{space 2} 3.423831{col 28}{space 2} 2.409412{col 39}{space 1}    1.42{col 48}{space 3}0.183{col 56}{space 4}-1.879249{col 69}{space 3} 8.726911
{txt}{space 11}PC3 {c |}{col 16}{res}{space 2} .3871332{col 28}{space 2} 1.531861{col 39}{space 1}    0.25{col 48}{space 3}0.805{col 56}{space 4} -2.98447{col 69}{space 3} 3.758737
{txt}{space 11}PC4 {c |}{col 16}{res}{space 2}-1.832452{col 28}{space 2}  1.87637{col 39}{space 1}   -0.98{col 48}{space 3}0.350{col 56}{space 4}-5.962315{col 69}{space 3} 2.297411
{txt}{space 11}PC5 {c |}{col 16}{res}{space 2}-1.019153{col 28}{space 2} 2.537792{col 39}{space 1}   -0.40{col 48}{space 3}0.696{col 56}{space 4}-6.604797{col 69}{space 3}  4.56649
{txt}{space 11}PC6 {c |}{col 16}{res}{space 2} 1.132586{col 28}{space 2} 1.580013{col 39}{space 1}    0.72{col 48}{space 3}0.488{col 56}{space 4}-2.344999{col 69}{space 3}  4.61017
{txt}{space 11}PC7 {c |}{col 16}{res}{space 2} 1.421337{col 28}{space 2} 2.027013{col 39}{space 1}    0.70{col 48}{space 3}0.498{col 56}{space 4}-3.040089{col 69}{space 3} 5.882763
{txt}{space 11}PC8 {c |}{col 16}{res}{space 2}-2.770922{col 28}{space 2} 1.290446{col 39}{space 1}   -2.15{col 48}{space 3}0.055{col 56}{space 4}-5.611174{col 69}{space 3} .0693303
{txt}{space 11}PC9 {c |}{col 16}{res}{space 2} -1.66039{col 28}{space 2} 1.885585{col 39}{space 1}   -0.88{col 48}{space 3}0.397{col 56}{space 4}-5.810534{col 69}{space 3} 2.489755
{txt}{space 10}PC10 {c |}{col 16}{res}{space 2}-.8987838{col 28}{space 2}  2.00308{col 39}{space 1}   -0.45{col 48}{space 3}0.662{col 56}{space 4}-5.307534{col 69}{space 3} 3.509966
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  .815246{col 28}{space 2} .0307705{col 39}{space 1}   26.49{col 48}{space 3}0.000{col 56}{space 4} .7475206{col 69}{space 3} .8829715
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m2: reg ks1 c.MoBnew#c.PGS MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,734
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1364
                                                {txt}Root MSE          =    {res} .91384

{txt}{ralign 80:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}           ks1{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
c.MoBnew#c.PGS {c |}{col 16}{res}{space 2} .0029967{col 28}{space 2} .0020096{col 39}{space 1}    1.49{col 48}{space 3}0.164{col 56}{space 4}-.0014263{col 69}{space 3} .0074198
{txt}{space 14} {c |}
{space 8}MoBnew {c |}{col 16}{res}{space 2}-.0589774{col 28}{space 2} .0031717{col 39}{space 1}  -18.59{col 48}{space 3}0.000{col 56}{space 4}-.0659582{col 69}{space 3}-.0519965
{txt}{space 11}PGS {c |}{col 16}{res}{space 2} .2251286{col 28}{space 2} .0164012{col 39}{space 1}   13.73{col 48}{space 3}0.000{col 56}{space 4} .1890297{col 69}{space 3} .2612275
{txt}{space 10}male {c |}{col 16}{res}{space 2} -.306872{col 28}{space 2} .0216338{col 39}{space 1}  -14.18{col 48}{space 3}0.000{col 56}{space 4}-.3544878{col 69}{space 3}-.2592563
{txt}{space 11}PC1 {c |}{col 16}{res}{space 2}-1.279988{col 28}{space 2} 1.189482{col 39}{space 1}   -1.08{col 48}{space 3}0.305{col 56}{space 4}-3.898021{col 69}{space 3} 1.338045
{txt}{space 11}PC2 {c |}{col 16}{res}{space 2}-.6756703{col 28}{space 2} .7289039{col 39}{space 1}   -0.93{col 48}{space 3}0.374{col 56}{space 4}-2.279977{col 69}{space 3} .9286365
{txt}{space 11}PC3 {c |}{col 16}{res}{space 2}-1.112451{col 28}{space 2} .4822893{col 39}{space 1}   -2.31{col 48}{space 3}0.042{col 56}{space 4}-2.173962{col 69}{space 3}-.0509391
{txt}{space 11}PC4 {c |}{col 16}{res}{space 2} .9348994{col 28}{space 2} 1.120509{col 39}{space 1}    0.83{col 48}{space 3}0.422{col 56}{space 4}-1.531325{col 69}{space 3} 3.401123
{txt}{space 11}PC5 {c |}{col 16}{res}{space 2}-1.265538{col 28}{space 2} 1.031515{col 39}{space 1}   -1.23{col 48}{space 3}0.245{col 56}{space 4}-3.535887{col 69}{space 3} 1.004811
{txt}{space 11}PC6 {c |}{col 16}{res}{space 2} .0841734{col 28}{space 2} 1.106325{col 39}{space 1}    0.08{col 48}{space 3}0.941{col 56}{space 4}-2.350832{col 69}{space 3} 2.519179
{txt}{space 11}PC7 {c |}{col 16}{res}{space 2} 1.558358{col 28}{space 2} 1.304559{col 39}{space 1}    1.19{col 48}{space 3}0.257{col 56}{space 4}-1.312956{col 69}{space 3} 4.429672
{txt}{space 11}PC8 {c |}{col 16}{res}{space 2}-.6514196{col 28}{space 2} .8594207{col 39}{space 1}   -0.76{col 48}{space 3}0.464{col 56}{space 4}-2.542992{col 69}{space 3} 1.240153
{txt}{space 11}PC9 {c |}{col 16}{res}{space 2}-2.574417{col 28}{space 2} .8463491{col 39}{space 1}   -3.04{col 48}{space 3}0.011{col 56}{space 4}-4.437219{col 69}{space 3}-.7116156
{txt}{space 10}PC10 {c |}{col 16}{res}{space 2} .1688549{col 28}{space 2} .9103264{col 39}{space 1}    0.19{col 48}{space 3}0.856{col 56}{space 4} -1.83476{col 69}{space 3}  2.17247
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .5931196{col 28}{space 2} .0256945{col 39}{space 1}   23.08{col 48}{space 3}0.000{col 56}{space 4} .5365665{col 69}{space 3} .6496727
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m3: reg ks2 c.MoBnew#c.PGS MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     6,075
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1099
                                                {txt}Root MSE          =    {res} .93162

{txt}{ralign 80:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}           ks2{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
c.MoBnew#c.PGS {c |}{col 16}{res}{space 2} .0007404{col 28}{space 2} .0026391{col 39}{space 1}    0.28{col 48}{space 3}0.784{col 56}{space 4}-.0050683{col 69}{space 3} .0065492
{txt}{space 14} {c |}
{space 8}MoBnew {c |}{col 16}{res}{space 2} -.026093{col 28}{space 2}  .003638{col 39}{space 1}   -7.17{col 48}{space 3}0.000{col 56}{space 4}-.0341001{col 69}{space 3}-.0180859
{txt}{space 11}PGS {c |}{col 16}{res}{space 2} .3043803{col 28}{space 2} .0199326{col 39}{space 1}   15.27{col 48}{space 3}0.000{col 56}{space 4} .2605091{col 69}{space 3} .3482516
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.1204746{col 28}{space 2} .0228147{col 39}{space 1}   -5.28{col 48}{space 3}0.000{col 56}{space 4}-.1706894{col 69}{space 3}-.0702599
{txt}{space 11}PC1 {c |}{col 16}{res}{space 2}-.6972024{col 28}{space 2}  .928144{col 39}{space 1}   -0.75{col 48}{space 3}0.468{col 56}{space 4}-2.740034{col 69}{space 3} 1.345629
{txt}{space 11}PC2 {c |}{col 16}{res}{space 2} .9892884{col 28}{space 2} .8610952{col 39}{space 1}    1.15{col 48}{space 3}0.275{col 56}{space 4}-.9059693{col 69}{space 3} 2.884546
{txt}{space 11}PC3 {c |}{col 16}{res}{space 2} .0153989{col 28}{space 2} .7516355{col 39}{space 1}    0.02{col 48}{space 3}0.984{col 56}{space 4} -1.63894{col 69}{space 3} 1.669737
{txt}{space 11}PC4 {c |}{col 16}{res}{space 2} 2.358119{col 28}{space 2} 1.162955{col 39}{space 1}    2.03{col 48}{space 3}0.068{col 56}{space 4}-.2015263{col 69}{space 3} 4.917765
{txt}{space 11}PC5 {c |}{col 16}{res}{space 2}-1.405102{col 28}{space 2} 1.148412{col 39}{space 1}   -1.22{col 48}{space 3}0.247{col 56}{space 4}-3.932739{col 69}{space 3} 1.122536
{txt}{space 11}PC6 {c |}{col 16}{res}{space 2}-.5697448{col 28}{space 2} 1.067461{col 39}{space 1}   -0.53{col 48}{space 3}0.604{col 56}{space 4} -2.91921{col 69}{space 3} 1.779721
{txt}{space 11}PC7 {c |}{col 16}{res}{space 2}  1.37933{col 28}{space 2} 1.116978{col 39}{space 1}    1.23{col 48}{space 3}0.243{col 56}{space 4}-1.079123{col 69}{space 3} 3.837783
{txt}{space 11}PC8 {c |}{col 16}{res}{space 2}-1.541677{col 28}{space 2} 1.110252{col 39}{space 1}   -1.39{col 48}{space 3}0.192{col 56}{space 4}-3.985326{col 69}{space 3} .9019713
{txt}{space 11}PC9 {c |}{col 16}{res}{space 2}-2.240857{col 28}{space 2} 1.410931{col 39}{space 1}   -1.59{col 48}{space 3}0.141{col 56}{space 4}-5.346295{col 69}{space 3} .8645799
{txt}{space 10}PC10 {c |}{col 16}{res}{space 2} .3657692{col 28}{space 2} .8473525{col 39}{space 1}    0.43{col 48}{space 3}0.674{col 56}{space 4}-1.499241{col 69}{space 3} 2.230779
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  .265294{col 28}{space 2} .0226093{col 39}{space 1}   11.73{col 48}{space 3}0.000{col 56}{space 4} .2155314{col 69}{space 3} .3150567
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m4: reg ks3 c.MoBnew#c.PGS MoBnew PGS male PC*, robust cluster(MoB)

{txt}Linear regression                               Number of obs     = {res}     5,240
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1087
                                                {txt}Root MSE          =    {res} .94184

{txt}{ralign 80:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}           ks3{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
c.MoBnew#c.PGS {c |}{col 16}{res}{space 2}-.0030935{col 28}{space 2} .0029818{col 39}{space 1}   -1.04{col 48}{space 3}0.322{col 56}{space 4}-.0096564{col 69}{space 3} .0034693
{txt}{space 14} {c |}
{space 8}MoBnew {c |}{col 16}{res}{space 2}-.0197441{col 28}{space 2}  .003842{col 39}{space 1}   -5.14{col 48}{space 3}0.000{col 56}{space 4}-.0282004{col 69}{space 3}-.0112879
{txt}{space 11}PGS {c |}{col 16}{res}{space 2} .3318223{col 28}{space 2} .0243771{col 39}{space 1}   13.61{col 48}{space 3}0.000{col 56}{space 4} .2781686{col 69}{space 3}  .385476
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.1657711{col 28}{space 2} .0203596{col 39}{space 1}   -8.14{col 48}{space 3}0.000{col 56}{space 4}-.2105823{col 69}{space 3}-.1209599
{txt}{space 11}PC1 {c |}{col 16}{res}{space 2} .0913134{col 28}{space 2} 1.254726{col 39}{space 1}    0.07{col 48}{space 3}0.943{col 56}{space 4} -2.67032{col 69}{space 3} 2.852947
{txt}{space 11}PC2 {c |}{col 16}{res}{space 2}-.1647307{col 28}{space 2} 1.418761{col 39}{space 1}   -0.12{col 48}{space 3}0.910{col 56}{space 4}-3.287403{col 69}{space 3} 2.957942
{txt}{space 11}PC3 {c |}{col 16}{res}{space 2} .2110339{col 28}{space 2} 1.072648{col 39}{space 1}    0.20{col 48}{space 3}0.848{col 56}{space 4}-2.149848{col 69}{space 3} 2.571916
{txt}{space 11}PC4 {c |}{col 16}{res}{space 2} 1.231731{col 28}{space 2} 1.248395{col 39}{space 1}    0.99{col 48}{space 3}0.345{col 56}{space 4}-1.515967{col 69}{space 3} 3.979429
{txt}{space 11}PC5 {c |}{col 16}{res}{space 2}-1.836217{col 28}{space 2} 1.081839{col 39}{space 1}   -1.70{col 48}{space 3}0.118{col 56}{space 4}-4.217329{col 69}{space 3} .5448952
{txt}{space 11}PC6 {c |}{col 16}{res}{space 2}-1.250551{col 28}{space 2} 1.449416{col 39}{space 1}   -0.86{col 48}{space 3}0.407{col 56}{space 4}-4.440694{col 69}{space 3} 1.939592
{txt}{space 11}PC7 {c |}{col 16}{res}{space 2} 2.373351{col 28}{space 2} .6474479{col 39}{space 1}    3.67{col 48}{space 3}0.004{col 56}{space 4} .9483274{col 69}{space 3} 3.798374
{txt}{space 11}PC8 {c |}{col 16}{res}{space 2}-2.387119{col 28}{space 2} .8643981{col 39}{space 1}   -2.76{col 48}{space 3}0.019{col 56}{space 4}-4.289646{col 69}{space 3}-.4845916
{txt}{space 11}PC9 {c |}{col 16}{res}{space 2}-1.256124{col 28}{space 2} 1.163231{col 39}{space 1}   -1.08{col 48}{space 3}0.303{col 56}{space 4}-3.816379{col 69}{space 3} 1.304131
{txt}{space 10}PC10 {c |}{col 16}{res}{space 2}-.8107545{col 28}{space 2} .9177687{col 39}{space 1}   -0.88{col 48}{space 3}0.396{col 56}{space 4} -2.83075{col 69}{space 3} 1.209241
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .2491341{col 28}{space 2} .0353813{col 39}{space 1}    7.04{col 48}{space 3}0.000{col 56}{space 4} .1712604{col 69}{space 3} .3270077
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo  m5: reg ks4 c.MoBnew#c.PGS MoBnew PGS male PC*, robust cluster(MoB) 

{txt}Linear regression                               Number of obs     = {res}     7,268
                                                {txt}{help j_robustsingular:F(10, 11) }        =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.0331
                                                {txt}Root MSE          =    {res} .99038

{txt}{ralign 80:(Std. Err. adjusted for {res:12} clusters in MoB)}
{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}           ks4{col 16}{c |}      Coef.{col 28}   Std. Err.{col 40}      t{col 48}   P>|t|{col 56}     [95% Con{col 69}f. Interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
c.MoBnew#c.PGS {c |}{col 16}{res}{space 2}-.0006244{col 28}{space 2} .0027199{col 39}{space 1}   -0.23{col 48}{space 3}0.823{col 56}{space 4} -.006611{col 69}{space 3} .0053621
{txt}{space 14} {c |}
{space 8}MoBnew {c |}{col 16}{res}{space 2}-.0148565{col 28}{space 2} .0028136{col 39}{space 1}   -5.28{col 48}{space 3}0.000{col 56}{space 4}-.0210491{col 69}{space 3}-.0086639
{txt}{space 11}PGS {c |}{col 16}{res}{space 2} .1254031{col 28}{space 2} .0143202{col 39}{space 1}    8.76{col 48}{space 3}0.000{col 56}{space 4} .0938845{col 69}{space 3} .1569218
{txt}{space 10}male {c |}{col 16}{res}{space 2}-.2427908{col 28}{space 2} .0298612{col 39}{space 1}   -8.13{col 48}{space 3}0.000{col 56}{space 4} -.308515{col 69}{space 3}-.1770667
{txt}{space 11}PC1 {c |}{col 16}{res}{space 2}-1.286812{col 28}{space 2}  1.19164{col 39}{space 1}   -1.08{col 48}{space 3}0.303{col 56}{space 4}-3.909593{col 69}{space 3} 1.335968
{txt}{space 11}PC2 {c |}{col 16}{res}{space 2}-1.402818{col 28}{space 2} .9903975{col 39}{space 1}   -1.42{col 48}{space 3}0.184{col 56}{space 4}-3.582669{col 69}{space 3} .7770318
{txt}{space 11}PC3 {c |}{col 16}{res}{space 2} .4327843{col 28}{space 2}  .879353{col 39}{space 1}    0.49{col 48}{space 3}0.632{col 56}{space 4}-1.502659{col 69}{space 3} 2.368227
{txt}{space 11}PC4 {c |}{col 16}{res}{space 2}  2.22849{col 28}{space 2} 1.151295{col 39}{space 1}    1.94{col 48}{space 3}0.079{col 56}{space 4}-.3054943{col 69}{space 3} 4.762473
{txt}{space 11}PC5 {c |}{col 16}{res}{space 2}-.3826824{col 28}{space 2} .7390037{col 39}{space 1}   -0.52{col 48}{space 3}0.615{col 56}{space 4}-2.009219{col 69}{space 3} 1.243854
{txt}{space 11}PC6 {c |}{col 16}{res}{space 2}-2.199208{col 28}{space 2} 1.137303{col 39}{space 1}   -1.93{col 48}{space 3}0.079{col 56}{space 4}-4.702394{col 69}{space 3} .3039786
{txt}{space 11}PC7 {c |}{col 16}{res}{space 2} .9476583{col 28}{space 2} 1.177481{col 39}{space 1}    0.80{col 48}{space 3}0.438{col 56}{space 4} -1.64396{col 69}{space 3} 3.539277
{txt}{space 11}PC8 {c |}{col 16}{res}{space 2}-.8525375{col 28}{space 2} .8511928{col 39}{space 1}   -1.00{col 48}{space 3}0.338{col 56}{space 4}   -2.726{col 69}{space 3} 1.020925
{txt}{space 11}PC9 {c |}{col 16}{res}{space 2}-.4958288{col 28}{space 2} .8004814{col 39}{space 1}   -0.62{col 48}{space 3}0.548{col 56}{space 4}-2.257677{col 69}{space 3} 1.266019
{txt}{space 10}PC10 {c |}{col 16}{res}{space 2} -.371315{col 28}{space 2} .6812281{col 39}{space 1}   -0.55{col 48}{space 3}0.597{col 56}{space 4}-1.870688{col 69}{space 3} 1.128058
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .2373289{col 28}{space 2} .0301711{col 39}{space 1}    7.87{col 48}{space 3}0.000{col 56}{space 4} .1709227{col 69}{space 3} .3037351
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. esttab  m1 m2 m3 m4 m5, b se keep(c.MoBnew#c.PGS MoBnew PGS) star(* 0.10 ** 0.05 *** 0.01) stats(N, fmt(0))
{res}
{txt}{hline 92}
{txt}                      (1)             (2)             (3)             (4)             (5)   
{txt}                       ea             ks1             ks2             ks3             ks4   
{txt}{hline 92}
{txt}c.MoBnew#c~S{res}      0.00472         0.00300        0.000740        -0.00309       -0.000624   {txt}
            {res} {ralign 12:{txt:(}0.00576{txt:)}}    {ralign 12:{txt:(}0.00201{txt:)}}    {ralign 12:{txt:(}0.00264{txt:)}}    {ralign 12:{txt:(}0.00298{txt:)}}    {ralign 12:{txt:(}0.00272{txt:)}}   {txt}

{txt}MoBnew      {res}      -0.0877***      -0.0590***      -0.0261***      -0.0197***      -0.0149***{txt}
            {res} {ralign 12:{txt:(}0.00544{txt:)}}    {ralign 12:{txt:(}0.00317{txt:)}}    {ralign 12:{txt:(}0.00364{txt:)}}    {ralign 12:{txt:(}0.00384{txt:)}}    {ralign 12:{txt:(}0.00281{txt:)}}   {txt}

{txt}PGS         {res}        0.105**         0.225***        0.304***        0.332***        0.125***{txt}
            {res} {ralign 12:{txt:(}0.0403{txt:)}}    {ralign 12:{txt:(}0.0164{txt:)}}    {ralign 12:{txt:(}0.0199{txt:)}}    {ralign 12:{txt:(}0.0244{txt:)}}    {ralign 12:{txt:(}0.0143{txt:)}}   {txt}
{txt}{hline 92}
{txt}N           {res}         1826            5734            6075            5240            7268   {txt}
{txt}{hline 92}
{txt}Standard errors in parentheses
{txt}* p<0.10, ** p<0.05, *** p<0.01

{com}. 
. esttab  m1 m2 m3 m4 m5 using "${c -(}dirtables{c )-}/MoB_GxE2.tex", replace ///
>         frag bookt b(3) se(3) keep(c.MoBnew#c.PGS MoBnew PGS) star(* 0.10 ** 0.05 *** 0.01) ///
>         mtitles("Age 4" "Age 7" "Age 11" "Age 14" "Age 16") ///
>         stats(r2 N, label("R2" "Observations") fmt(3 0)) nonotes coeflabel(MoBnew "MoB" c.MoBnew#c.PGS "MoB*PGS" PGS "PGS") 
{res}{txt}(output written to {browse  `"\\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/tables/MoB_GxE2.tex"'})

{com}. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}\\rdsfcifs.acrc.bris.ac.uk/ALSPAC_GxE/Alspac/logfiles/PractictionersPaper_2020-04-17_22-29-23.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}17 Apr 2020, 22:29:40
{txt}{.-}
{smcl}
{txt}{sf}{ul off}